Repository: DavydovMA/colobot-data
Catalog: levels/missions/chapter002/level004/po/*.po
Languages: ru

source: Black Box
ru: Чёрный Ящик

source: Discover crucial information left behind by the first expedition.
ru: Найдите важную информацию, оставленную первой экспедицией.

source: From Mission Control
ru: Из Центра Управления

source: We have no way of being sure where the previous expedition was headed when it left the Moon surface nor why it chose to go wherever it was going.
ru: У нас нет возможности узнать, куда направилась предыдущая экспедиция, когда она покинула поверхность Луны, и почему она решила отправиться туда, куда она направилась.

source: Locate the <a object|bbox>black box</a> they must have left behind and bring it back aboard your ship. The black box should contain the coordinates of the next planet the expedition was planning to visit.
ru: Найдите <a object|bbox>Чёрный Ящик</a>, который они должны были оставить после себя и верните его на свой Корабль. Чёрный ящик должен содержать координаты следующей планеты, которую планировала посетить экспедиция.

source: Your bot's <a object|power>power cells</a> are almost entirely empty. Recharging them should be your priority. The observation satellite in orbit indicates that the subsoil in this particular area is loaded with energy. You should therefore be able to build a functional <a object|station>power station</a> on any flat surface.
ru: <a object|power>Батареи</a> Ваших ботов почти полностью пусты. Подзарядка должна быть Вашим приоритетом. Спутник наблюдения на орбите сообщает, что недра этого района полны энергии. Таким образом, у Вас есть возможность построить действующую <a object|station>Энергозаправку</a> на любой ровной поверхности.

source: We have developed a program that will recharge the <a object|power>power cell</a> of a bot. Refer to the program page of your SatCom <button 53/>.
ru: Мы разработали программу, которая перезаряжает <a object|power>Батарею</a> бота. Обратитесь к странице программы Вашего СатКом <button 53/>.

source: Procedure
ru: Процедура

source: You first need to build a <a object|convert>converter</a> that converts the chunks of titanium ore already in your possession into usable <a object|titan>titanium cubes</a>.
ru: Сначала Вам нужно построить <a object|convert>Преобразователь</a>, который переработает уже имеющиеся куски Руды Титановой в пригодный для использования <a object|titan>Титан</a>.

source: You should then build both a <a object|station>power station</a> and a <a object|radar>radar</a> which will indicate the location of the black box on your mini map.
ru: Затем Вы должны построить <a object|station>Энергозаправку</a> и <a object|radar>Радар</a>, который укажет местоположение Чёрного Ящика на Вашей мини-карте.

source: With your power cells fully charged, retrieve the black box. It needs to be placed on the <a object|base>spaceship</a> platform for you to be able to take off.
ru: Когда Ваши Батареи будут полностью заряжены, найдите Чёрный Ящик. Его надо разместить на платформе <a object|base>Космического Корабля</a>, чтобы Вы могли взлететь.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
ru: <format key><key help/></format> позволяет Вам просмотреть эти инструкции в любое время с помощью Вашего личного СатКом <button 63/>.

source: See also
ru: Смотрите также

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
ru: <a command>Управление</a> и <a cbot>Язык CBOT</a>

source: Satellite Report
ru: Спутниковый Отчёт

source: Currently in a geo-stationary orbit of the Moon.
ru: Сейчас на геостационарной орбите Луны.

source: -> SURFACE<c/>
ru: -> ПОВЕРХНОСТЬ<c/>

source: \tab;Temperature: -38.2C \tab;Atmosphere: none \tab;Wind: 0.0 mps \tab;Titanium ore: none \tab;Uranium ore: none
ru: \tab;Температура: -38.2C \tab;Атмосфера: отсутствует \tab;Ветер: 0.0 м/с \tab;Руда Титановая: отсутствует \tab;Руда Урановая: отсутствует

source: -> SUBSOIL<c/>
ru: -> НЕДРА<c/>

source: \tab;Energy source: everywhere \tab;Titanium ore: none \tab;Uranium ore: none
ru: \tab;Энергия: везде \tab;Руда Титановая: отсутствует \tab;Руда Урановая: отсутствует

source: Walkthrough
ru: Прохождение

source: Build a converter <button 162/> with the only titanium cube available.
ru: Постройте Преобразователь <button 162/>, с помощью только доступного Титана.

source: Deposit one chunk of titanium ore at a time at the center of the platform and let the converter do the rest.
ru: Поместите один кусок Руды Титановой в центре платформы и пусть Преобразователь сделает всё остальное.

source: Build a power station <button 164/> with one of the newly converted titanium cubes.
ru: Постройте Энергозаправку <button 164/> , с помощью одного недавно переработанного Титана.

source: If you don't feel like looking for the black box yourself, build a radar <button 168/> and the box will appear on your mini map somewhere north of your present location, at the bottom of a crater, next to a few derelict spacecraft and debris from the previous expedition.
ru: Если Вам не хочется искать Чёрный ящик, постройте Радар <button 168/> и Ящик появится на Вашей мини-карте где-нибудь к северу от Вашего текущего местоположения, на дне кратера, рядом с заброшенным Космическим Кораблём и несколькими обломками от предыдущей экспедиции.

source: Place the grabbers at the center of the power station platform to recharge them. The cells should still have a little power left in them, just enough to radio-control the bots onto the platform.
ru: Поместите Погрузчики в центре Энергозаправки для подзарядки. В Батареях должно остаться немного энергии, достаточной для радио-управления ботами на платформе.

source: Radio-control the winged grabber to the black box and back.
ru: Проведите по радио-управлению Погрузчик Крылатый до Чёрного Ящика и обратно.

source: Gather both grabbers and the black box onto the spaceship platform and climb on board yourself.
ru: Захватите оба Погрузчика и Чёрный Ящик на Космический Корабль и взберитесь на борт самостоятельно.

source: Take off.
ru: Взлетайте.

source: <a command>Controls</a>
ru: <a command>Управление</a>
