Repository: DavydovMA/colobot-data
Catalog: levels/missions/chapter006/level002/po/*.po
Languages: ru

source: Analysis
ru: Анализ

source: Recover and analyze some organic matter.
ru: Найдите и проанализируйте немного Био-Материи.

source: From Mission Control
ru: Из Центра Управления

source: The previous expedition provided us with a piece of information about some <a object|bullet>organic matter</a>, which seems to be produced by the <a object|ant>ants</a>, and which opened startling new possibilities. It apparently allows the creation of a new type of mutant bot with enhanced performance through the use of insect parts.
ru: Предыдущая экспедиция предоставила нам обрывки информации о какой-то <a object|bullet>Био-Материи</a>, которая похоже производится <a object|ant>муравьями</a>, и открыла новые возможности. В частности, это позволит создать новые типы ботов мутантов с улучшенными характеристиками за счёт использования частей насекомых.

source: Your mission is to experiment with the first practical application of this "green gold". Build a <a object|botgs>legged grabber bot</a>, load it on the spaceship and take off.
ru: Ваша миссия - поэкспериментировать с первым практическим применением этого "зелёного золота". Создайте бот <a object|botgs>Погрузчик Лапчатый</a>, загрузите его на Космический Корабль и взлетайте.

source: Procedure
ru: Процедура

source: Take a sample of organic matter from a nest of giant ants. The analysis of it will be performed by an <a object|labo>autolab</a>, which will also perform the necessary research to allow a practical application.
ru: Возьмите образец Био-Материи из гнезда гигантских муравьёв. Проведите анализ в <a object|labo>Лаборатории</a>, которая проведёт необходимые исследования для практического применения.

source: In order to improve your defense capacity, we have transmitted a program to your <a object|botgr>grabber bots</a> that takes care of recharging the power cell of a <a object|tower>defense tower</a> (see <button 53/> ).
ru: Чтобы повысить Вашу обороноспособность, мы переслали программу Вашим <a object|botgr>Ботам Погрузчика</a>, которая следит за перезарядкой Батареи <a object|tower>Башни Обороны</a> (смотрите <button 53/> ).

source: Note
ru: Внимание

source: The temperature has dropped significantly, it should therefore be possible to fly.
ru: Температура значительно упала, значит, можно будет летать.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
ru: <format key><key help/></format> позволяет Вам просмотреть эти инструкции в любое время с помощью Вашего личного СатКом <button 63/>.

source: See also
ru: Смотрите также

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
ru: <a command>Управление</a> и <a cbot>Язык CBOT</a>

source: Satellite Report
ru: Спутниковый Отчёт

source: Currently in a geo-stationary orbit of Volcano.
ru: Сейчас на геостационарной орбите Вулкана.

source: -> SURFACE<c/>
ru: -> ПОВЕРХНОСТЬ<c/>

source: \tab;Temperature: 53.1C \tab;Atmosphere: CO2, SO2, HCN, HS, CH4, NH3 \tab;Wind: 0.3 mps \tab;Titanium ore: some \tab;Uranium ore: little
ru: \tab;Температура: 53.1C \tab;Атмосфера: CO2, SO2, HCN, HS, CH4, NH3 \tab;Ветер: 0.3 м/с \tab;Руда Титановая: немного \tab;Руда Урановая: мало

source: -> SUBSOIL<c/>
ru: -> НЕДРА<c/>

source: \tab;Energy source: everywhere \tab;Titanium ore: none \tab;Uranium ore: none
ru: \tab;Энергия: везде \tab;Руда Титановая: отсутствует \tab;Руда Урановая: отсутствует

source: -> ADDITIONAL INFORMATION<c/>
ru: -> ДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ<c/>

source: \tab;Detected: giant ants \tab; - Danger: yes, not immediate \tab;Detected: unknown flying organisms \tab; - Danger: yes, immediate
ru: \tab;Обнаружено: гигантские муравьи \tab; - Угроза: да, не прямая \tab;Обнаружено: неизвестные летающие организмы \tab; - Угроза: да, прямая

source: Walkthrough
ru: Прохождение

source: Quickly build a <a object|tower>defense tower</a> north of your spaceship. After you <a object|power>powered</a> it, execute the program <code>ServiceTower1</code> on one of the <a object|botgr>grabbers</a> which will recharge the power cell when it is empty. Place another power cell 2 m north of the tower as a first target for the attacking wasps.
ru: Быстро постройте <a object|tower>Башню Обороны</a> севернее от Вашего Космического Корабля. После того, как Вы <a object|power>включите</a> её, запустите программу <code>ServiceTower1</code> на одном из <a object|botgr>Погрузчиков</a>, который будет перезаряжать Батарею, когда та опустеет. Разместите ещё одну Батарею в 2 метрах севернее от Башни Обороны, как первичную мишень для атакующих ос.

source: Build a <a object|station>power station</a> close to the defense tower.
ru: Постройте <a object|station>Энергозаправку</a> рядом с Башней Обороны.

source: Build a <a object|convert>converter</a> south of the spaceship and execute the program <code>CollectTitanium3</code> on the second <a object|botgr>grabber</a> in order to produce some <a object|titan>titanium</a>.
ru: Постройте <a object|convert>Преобразователь</a> южнее от Космического Корабля и запустите программу <code>CollectTitanium3</code> на втором <a object|botgr>Погрузчике</a>, чтобы производить немного <a object|titan>Титана</a>.

source: Build a <a object|factory>bot factory</a> and a <a object|botfj>winged shooter</a> to eliminate the <a object|ant>ants</a>.
ru: Постройте <a object|factory>Фабрику Ботов</a> и <a object|botfj>Стрелка Крылатого</a> для уничтожения <a object|ant>муравьёв</a>.

source: Use a <a object|botgj>winged grabber</a> to bring back some <a object|bullet>organic matter</a> from the island in the middle of the lava lake.
ru: С помощью <a object|botgj>Погрузчика Крылатого</a> раздобудьте немного <a object|bullet>Био-Материи</a> с острова посреди лавового озера.

source: Build an <a object|labo>autolab</a>, drop the <a object|bullet>organic matter</a> on the platform and click the button <button 109/> in order to develop the blueprints for legged bots.
ru: Постройте <a object|labo>Лабораторию</a>, поставьте <a object|bullet>Био-Материю</a> на платформу и нажмите на кнопку <button 109/>, чтобы разработать чертежи ботов на лапках.

source: As soon as the organic matter has been analyzed, produce a <a object|botgs>legged grabber</a> and bring it aboard the spaceship.
ru: Как только Био-Материя будет проанализирована, создайте <a object|botgs>Погрузчик Лапчатый</a> и заберите его на борт Космического Корабля.

source: Take off.
ru: Взлетайте.

source: <a command>Controls</a>
ru: <a command>Управление</a>
