Repository: DavydovMA/colobot-data
Catalog: levels/exercises/chapter001/level002/po/*.po
Languages: ru

source: Power Cell 1
ru: Батарея 1

source: Instruct a bot to change the power cell of a nearby winged shooter.
ru: Прикажите боту поменять Батарею ближайшего Стрелка Крылатого.

source: Objective
ru: Задание

source: Program the <a object|botgr>grabber bot</a> to change the <a object|power>power cell</a> of the <a object|botfj>winged shooter</a>. The winged shooter can then shoot the spiders.
ru: Запрограммируйте <a object|botgr>Погрузчика</a> поменять <a object|power>Батарею</a> <a object|botfj>Стрелка Крылатого</a>. После этого Стрелок Крылатый сможет уничтожить пауков.

source: Procedure
ru: Процедура

source: Program the <a object|botgr>grabber bot</a>.
ru: Запрограммировать <a object|botgr>Погрузчика</a>.

source: Execute the program with the arrow button <button 21/>.
ru: Выполните программу с помощью кнопки со стрелкой <button 21/>.

source: The <a object|botfj>winged shooter</a> is already programmed, it will do its job as soon as it has got a new power cell.
ru: <a object|botfj>Стрелок Крылатый</a> уже запрограммирован, он начнёт выполнять свою работу, как только получит новую Батарею.

source: Program
ru: Программа

source: You will need the following instructions:
ru: Вам понадобятся следующие инструкции:

source: <n/>Takes whatever there is in front of the bot.
ru: <n/>Берёт всё, что есть перед ботом.

source: <n/>Drops whatever the bot is carrying in front.
ru: <n/>Ставит перед собой всё, что несёт.

source: <n/>We have seen this instruction already in the previous exercise: it performs a rotation of a certain angle, given in degrees.
ru: <n/>Мы уже видели эту инструкцию в предыдущем упражнении: она выполняет поворот на указанный угол, заданный в градусах.

source: pick up the empty power cell with <c/>grab();<n/>
ru: подобрать пустую Батарею <c/>grab();<n/>

source: turn left 90 degrees (quarter turn) with <code>turn(90)</code>
ru: повернуться влево на 90 градусов (четверть оборота) <code>turn(90)</code>

source: drop the empty cell with <c/>drop();<n/>
ru: поставить пустую Батарею <c/>drop();<n/>

source: etc.
ru: и т.д.

source: It is up to you now to write the rest of the program!
ru: Теперь Вы должны сами закончить эту программу!

source: If you have got a problem, you can always look at the solution: select the <code>Solution</code> program, and click the braces button <button 22/>.
ru: Если у Вас возникнут проблемы, Вы всегда можете посмотреть решение: выберите программу <code>Solution</code>, и нажмите кнопку со скобками <button 22/>.

source: Remarks
ru: Комментарий

source: Be careful to write the instructions precisely, respecting lower and upper case letters.
ru: Будьте осторожны и пишите инструкции точно, соблюдайте верхний и нижний регистр букв.

source: Always write one instruction per line, finishing each line with a semicolon.
ru: Всегда пишите одну инструкцию на строку, заканчивая каждую строку точкой с запятой.

source: In case your program does not do exactly what you wanted, you can put the bot back at the starting point with the button <button 59/>. You can also start over again from the beginning (hit the key "Esc", the click "Restart"). The program you have written will not be lost.
ru: Если вдруг Ваша программа делает не совсем то, что хотелось бы, Вы можете вернуть бота обратно в стартовую точку, нажав кнопку <button 59/>. Вы также можете начать всё с самого начала (нажмите кнопку "Esc" и выберите "Заново"). Написанная Вами программа не будет потеряна.

source: <format key><key help/></format> allows you to review these instructions at all times.
ru: <format key><key help/></format> позволяет Вам просмотреть эти инструкции в любое время.

source: Let us see the beginning of the program:
ru: Давайте посмотрим на начало программы:
