Repository: DavydovMA/colobot-data
Catalog: levels/battles/chapter001/level001/po/*.po
Languages: ru

source: Code battle - vs aliens
ru: Битва программ - против пришельцев

source: A map for begginers! Research all needed technologies and build your infrastructure to kill all the aliens on the opposite side of the river - using programming only!
ru: Карта для новичков! Исследуйте все необходимые технологии и постройте свою инфраструктуру, чтобы уничтожить всех пришельцев на противоположной стороне реки - используя только программирование!

source: Code Battle (vs Aliens)
ru: Битва Программ (против Пришельцев)

source: This is a training code battle level, which purpose is to familiarize you with this <a battles>game mode</a>.
ru: Это обучающий уровень Битвы программ, цель которого - познакомить Вас с этим <a battles>игровым режимом</a>.

source: Brief introduction
ru: Краткое введение

source: Code battle is a completely new game mode featured in Colobot: Gold Edition. There are two or more teams and the one that survives the longest is the winner. As the name suggest, you can only use programming in this game mode.
ru: Битва программ - это совершенно новый игровой режим, представленный в Colobot: Gold Edition. Есть две или более команд, и та, которая выживает дольше всех, становится победителем. Как следует из названия, в этом игровом режиме Вы можете использовать только программирование.

source: It is recommended to read <a %lvl%/help/help.%lng% notes>the notes section</a> below.
ru: Рекомендуется прочитать <a %lvl%/help/help.%lng% notes>раздел заметок</a> ниже.

source: Your objective
ru: Ваша цель

source: Kill all the aliens located on the other side of the river.
ru: Уничтожьте всех пришельцев, находящихся на другом берегу реки.

source: Notes\m notes;
ru: Заметки\m заметки;

source: The <a object/ant>aliens</a> will not attack you, unless you come too close to them.
ru: <a object|ant>Пришельцы</a> не нападут на Вас, если Вы не подойдете к ним слишком близко.

source: <a cbot>The CBOT documentation</a> might come in handy.
ru: <a cbot>Документация CBOT</a> может пригодиться.

source: There is <a object/enerspot>an underground power source</a> only under the beginning base areas.
ru: <a object|enerspot>Подземное Месторождение Энергии</a> находится только под начальной базой.

source: If you have not played Colobot before, it is recommended to read about <a battles production>the basics of production line</a>.
ru: Если Вы раньше не играли в Colobot, рекомендуется прочитать о <a battles production>Основах производственной линии</a>.

source: The pre-built <a object|derrick>Derrick</a> and <a |object\radar>RadarStation</a> are indestructible.
ru: Предварительно построенные <a object|derrick>Вышка</a> и <a object|radar>Радар</a> неразрушимы.
