Repository: DavydovMA/colobot-data
Catalog: levels/challenges/chapter003/level001/po/*.po
Languages: ru

source: Mover 1
ru: Перевозчик 1

source: Retrieve some titanium ore in order to convert it to titanium cubes.
ru: Переработайте Руду Титановую в Титан.

source: Exercise
ru: Упражнение

source: Convert some <a object|titanore>titanium ore</a> to <a object|titan>titanium cubes</a>, then drop 2 titanium cubes on the pads whose coordinates are:
ru: Переработайте некоторое количество <a object|titanore>Руды Титановой</a> в <a object|titan>Титан</a>, затем поставьте 2 Титана на площадки с координатами:

source: The <a object|derrick>derrick</a> extracts titanium ore from the subsoil; you just have to pick it up.
ru: <a object|derrick>Вышка</a> добывает Руду Титановую из-под земли; Вы просто должны их подобрать.

source: The <a object|convert>converter</a> converts titanium ore to titanium cubes. Just drop the titanium ore on the platform, move backward, and wait until it has been converted.
ru: <a object|convert>Преобразователь</a> перерабатывает Руду Титановую в Титан. Просто поставьте Руду Титановую на платформу, отойдите назад и подождите пока она будет переработана.

source: General principle
ru: Общий принцип

source: Wait until there is some titanium ore.
ru: Подождать пока не появится Руда Титановая.

source: Go to the titanium ore.
ru: Подойти к Руде Титановой.

source: Pick it up.
ru: Подобрать её.

source: Go to the converter.
ru: Дойти до Преобразователя.

source: Drop the titanium ore.
ru: Поставить Руду Титановую.

source: Move back 2.5 meters.
ru: Отойти назад на 2.5 метра.

source: Wait until there is a titanium cube.
ru: Подождать пока не появится Титан.

source: Pick up the titanium cube.
ru: Подобрать Титан.

source: Go to the platform.
ru: Подойти к площадке.

source: Drop the titanium cube.
ru: Поставить Титан.

source: Useful instructions
ru: Полезные инструкции

source: <code><a cbot|for>for</a></code> to repeat some instructions <code><a cbot|do>do - while</a></code> to repeat some instructions <code><a cbot|radar>radar</a></code> to look for different objects <code><a cbot|goto>goto</a></code> to move the bot <code><a cbot|grab>grab</a></code> to grab an object <code><a cbot|drop>drop</a></code> to drop an object
ru: <code><a cbot|for>for</a></code> повторять инструкции <code><a cbot|do>do - while</a></code> повторять инструкции <code><a cbot|radar>radar</a></code> искать разные объекты <code><a cbot|goto>goto</a></code> передвинуть бот <code><a cbot|grab>grab</a></code> брать объект <code><a cbot|drop>drop</a></code> ставить объект

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|programming>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Repeat two times :
ru: Повторить два раза :
