Repository: DavydovMA/colobot-data
Catalog: levels/missions/chapter004/level001/po/*.po
Languages: ru

source: Viruses
ru: Вирусы

source: A new bug threatens all your systems.
ru: Новый баг угрожает всем Вашим системам.

source: From Mission Control
ru: Из Центра Управления

source: Build a <a object|radar>radar</a> on the highest point in the area. Make sure that the radar will work safely even after your departure to other planets. Your <a object|research>research center</a> should be able to provide a solution.
ru: Постройте <a object|radar>Радар</a> на самой высокой точке в этом районе. Убедитесь, что Радар будет безопасно работать даже после Вашего отлёта на другие планеты. Ваш <a object|research>Центр Исследований</a> должен быть в состоянии обеспечить решением.

source: It is possible that the organisms detected are in fact the <a object|worm>worms</a> alluded to by the first expedition. If this is indeed the case, don't be excessively alarmed: they seem fairly harmless to living organisms but could cause the programs of bots and buildings to malfunction through the emission of viruses.
ru: Возможно, что обнаруженные организмы на самом деле являются <a object|worm>червями</a>, о которых докладывала первая экспедиция. Если это действительно так, не стоит сильно переживать: они кажутся довольно безопасными для живых организмов, но могут привести к неисправности программ ботов и зданий посредством заражения вирусами.

source: Radars not only give you precious information about objects and organisms present in the region, they also relay information to and from the Earth once you have taken off to other planets. It is highly probable that problems with the radar stations built by the first expedition caused the transmission problems that we are aware of.
ru: Радары не только дают Вам драгоценную информацию о объектах и организмах, присутствующих в регионе, они также передают информацию на и с Земли, как только Вы улетите на другие планеты. Вполне вероятно, что проблемы с Радарами, построенными первой экспедицией, вызвали проблемы передачи, о которых мы осведомлены.

source: In order to help you with the boring task of gathering the necessary raw material, we have developed a program that instructs the <a object|botgr>wheeled grabber</a> to look for <a object|titanore>titanium ore</a> on its own (see the programming page <button 53/>).
ru: Для того, чтобы помочь Вам с нудной задачей сбора необходимого сырья, мы разработали программу, которая приказывает <a object|botgr>Погрузчику Колёсному</a> отыскивать <a object|titanore>Руду Титановую</a> самостоятельно. (смотрите страницу Программы <button 53/>).

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
ru: <format key><key help/></format> позволяет Вам просмотреть эти инструкции в любое время с помощью Вашего личного СатКом <button 63/>.

source: See also
ru: Смотрите также

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
ru: <a command>Управление</a> и <a cbot>Язык CBOT</a>

source: Satellite Report
ru: Спутниковый Отчёт

source: Currently in a geo-stationary orbit of Crystalium.
ru: Сейчас на геостационарной орбите Кристаллиума.

source: -> SURFACE<c/>
ru: -> ПОВЕРХНОСТЬ<c/>

source: \tab;Temperature: 5.4C \tab;Atmosphere: nitrogen \tab;Wind: 0.0 mps \tab;Titanium ore: some \tab;Uranium ore: none
ru: \tab;Температура: 5.4C \tab;Атмосфера: азот \tab;Ветер: 0.0 м/с \tab;Руда Титановая: немного \tab;Руда Урановая: отсутствует

source: -> SUBSOIL<c/>
ru: -> НЕДРА<c/>

source: \tab;Energy source: none \tab;Titanium ore: data not available \tab;Uranium ore: none
ru: \tab;Энергия: отсутствует \tab;Руда Титановая: данные не доступны \tab;Руда Урановая: отсутствует

source: -> ADDITIONAL INFORMATION<c/>
ru: -> ДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ<c/>

source: \tab;Detected: unidentified organisms \tab; - Danger: ?
ru: \tab;Обнаружено: неопознанные организмы \tab; - Угроза: ?

source: Walkthrough
ru: Прохождение

source: Build a <a object|factory>bot factory</a>.
ru: Постройте <a object|factory>Фабрику Ботов</a>.

source: Produce a <a object|botgj>winged grabber</a>.
ru: Соберите <a object|botgj>Погрузчик Крылатый</a>.

source: Carry a <a object|titan>titanium cube</a> to the highest point.
ru: Перенесите <a object|titan>Титан</a> на высшую точку.

source: Build a <a object|radar>radar</a> on the spot.
ru: Постройте <a object|radar>Радар</a> на месте.

source: Build a <a object|research>research center</a> next to the spaceship.
ru: Постройте <a object|research>Центр Исследований</a> рядом с Космическим Кораблём.

source: Initiate the <defense tower research program> <button 68/>.
ru: Начните <defense tower research program> <button 68/>.

source: Build the <a object|tower>defense tower</a> next to the radar.
ru: Постройте <a object|tower>Башню Обороны</a> рядом с Радаром.

source: When all the worms are destroyed, you can go back to your ship and take off.
ru: Когда все черви будут уничтожены, Вы можете вернуться на Космический Корабль и взлететь.

source: <a command>Controls</a>
ru: <a command>Управление</a>
