Repository: DavydovMA/colobot-data
Catalog: help/object/po/*.po
Languages: ru

source: This huge insect is the mother of them all. It lays <a object|egg>eggs</a> and from these eggs will hatch all the various kinds of insects <a object|human>you</a>'re likely to encounter. All of them are extremely hazardous to yourself and your mission. The queen's protective shell is particularly resistant to attack.
ru: Это огромное насекомое - матка всех пришельцев. Она откладывает <a object|egg>Яйца</a>, и из этих яиц вылупляются всевозможные виды насекомых, которых <a object|human>Вы</a> можете встретить. Все они чрезвычайно опасны для вас и вашей миссии. Защитная оболочка Королевы особенно устойчива к атакам.

source: <a object|ant>ants</a>
ru: <a object|ant>муравьев</a>

source: <a object|spider>spiders</a>
ru: <a object|spider>пауков</a>

source: <a object|wasp>wasps</a>
ru: <a object|wasp>ос</a>

source: <a object|worm>worms</a>
ru: <a object|worm>червей</a>

source: Nest
ru: Гнездо Пришельцев

source: The alien nest is an odd structure out of which <a object|bullet>organic matter</a> erupts on a regular basis. <a object|wasp>Wasps</a> visit nests regularly to collect ammunition that they will use to bombard your bots, buildings and yourself.
ru: Гнездо Пришельцев - это странное сооружение, из которого регулярно извергается <a object|bullet>Био-Материя</a>. <a object|wasp>Осы</a> регулярно прилетают в гнездо, чтобы пополнить боеприпасы, которые они будут использовать для бомбардировки ваших ботов, зданий и Вас самих.

source: <button 170/> Nuclear Plant
ru: <button 170/> Энергостанция Ядерная

source: The nuclear plant is a <a object|atomic>nuclear power cell</a> factory. It transforms a chunk of <a object|uranore>uranium ore</a> into a <a object|atomic>nuclear power cell</a> fully charged and ready for use.
ru: Энергостанция Ядерная - это производство <a object|atomic>Батареи Ядерной</a>. Перерабатывает кусок <a object|uranore>Руды Урановой</a> в полностью заряженную и готовую к использованию <a object|atomic>Батарею Ядерную</a>.

source: Uranium ore.
ru: Руда Урановая.

source: Nuclear power cell.
ru: Батарея Ядерная.

source: 30 seconds.
ru: 30 секунд.

source: Regular Power Cell
ru: Батарея Обычная

source: A power cell supplies the bots and a few buildings with energy.
ru: Батарея снабжает энергией ботов и некоторые здания.

source: An entirely red power cell is empty. The green section indicates the remaining capacity. A power cell can be recharged using a <a object|station>power station</a>. A <a object|energy>power plant</a> is needed to produce a new and fully charged power cell.
ru: Полностью красная Батарея пуста. Зелёная часть показывает оставшуюся емкость. Батарею можно перезаряжать на <a object|station>Энергозаправке</a>. А <a object|energy>Энергостанция</a> требуется для производства новой и полностью заряженные Батареи.

source: The capacity of a regular power cell is 100 times smaller than that of a <a object|atomic>nuclear power cell</a> produced by a <a object|nuclear>nuclear plant</a> using <a object|uranore>uranium ore</a>.
ru: Емкость Батареи Обычной в 100 раз меньше, чем у <a object|atomic>Батареи Ядерной</a>, произведенной на <a object|nuclear>Энергостанции Ядерной</a> из <a object|uranore>Руды Урановой</a>.

source: <button 168/> Radar
ru: <button 168/> Радар

source: The radar indicates the direction of the nearest <a object|mother>enemy</a>. Moreover, the information given by the radar allows the mini-map at the bottom right corner of your screen to show the position of all bots, buildings and enemies as small squares and triangles of different colors.
ru: Радар показывает направление до ближайшего <a object|mother>Врага</a>. Более того, информация, предоставляемая радаром, позволяет на мини-карте в правом нижнем углу экрана отображать положение всех ботов, зданий и врагов в виде небольших квадратов и треугольников разных цветов.

source: Radar stations also act as relays for communication with the Earth from distant planets.
ru: Радар также действует как станция для связи с Землей с далеких планет.

source: Information for the mini-map.
ru: Информация для мини-карты.

source: Constant.
ru: Постоянно.

source: <button 169/> Repair Center
ru: <button 169/> Пункт Ремонта

source: The repair center regenerates the shield on damaged bots. A bot's shield will absorb a certain amount of <a object|mother>enemy</a> hits. If there is no shield left, this means that the bot itself, when hit next, will be destroyed.
ru: Пункт Ремонта восстанавливает щит на поврежденных ботах. Щит бота поглощает определенное количество ударов <a object|mother>Врага</a>. Если щита не осталось, это означает, что бот при следующем ударе будет уничтожен.

source: Damaged bot.
ru: Поврежденные боты.

source: Repaired bot with regenerated shield.
ru: Отремонтированный бот с восстановленным щитом.

source: A few seconds depending on the repair job to be done.
ru: Несколько секунд в зависимости от выполняемого ремонта.

source: <button 163/> Research Center
ru: <button 163/> Центр Исследований

source: The research center is an enormous computer. Its most useful feature is its ability to come up with new technologies as well as improvements on existing ones regarding buildings and bots in particular.
ru: Центр Исследований - это огромный компьютер. Его самая полезная особенность - это способность разрабатывать новые технологии, а также улучшать существующие здания и боты.

source: The 65'536 processors it contains use up a large amount of energy. Each research program necessitates a brand new and fully charged <a object|power>power cell</a>
ru: Содержащиеся в нем 65'536 процессоров потребляют большое количество энергии. Каждая исследовательская программа требует совершенно новую и полностью заряженную <a object|power>Батарею<a>

source: Any flat surface of at least 5 meters wide.
ru: Любая ровная поверхность шириной не менее 5 метров.

source: Request for research.
ru: Запрос на исследование.

source: Regular or nuclear power cell.
ru: Батарея Обычная или Ядерная.

source: Between 9 seconds and 1 minute depending on the research.
ru: От 9 секунд до 1 минуты в зависимости от исследования.

source: Ruin
ru: Руины

source: A ruin is what's left of a building after it has been disabled by a <a object|spider>spider</a> or by friendly fire.
ru: Руины - это то, что осталось от здания после того, как оно было выведено из строя <a object|spider>Пауком</a> или дружественным огнем.

source: It can't be converted back into a reusable <a object|titan>titanium cube</a>.
ru: Руины нельзя снова преобразовать в <a object|titan>Титан</a>.

source: <button 175/> Vault
ru: <button 175/> Ангар

source: This dome-shaped building was conceived by the first expedition. Its purpose was to offer protection to a new type of advanced bot. To protect it from insect attacks, the vault was locked by 4 <a object|key>keys</a>. Only after you find the 4 keys and place each one of them on their corresponding slots will you be given access to the bot.
ru: Это куполообразное сооружение было задумано еще во время первой экспедиции. Его цель состоит в том, чтобы обеспечить сохранность новому типу продвинутых ботов. Для защиты от атак насекомых, Ангар был заблокирован четырьмя <a object|key>Ключами</a>. Только после того, как Вы найдете 4 ключа и поместите каждый из них в соответствующие слоты, получите доступ к боту.

source: Spider
ru: Паук

source: Spiders work like suicide commandoes: whenever a spider gets within a close enough range of its target, it inflates its abdomen and bursts into a multitude of tiny burning fragments. These fragments will set fire to everything they get in contact with. Luckily the spider won't survive.
ru: Пауки действуют как коммандос-самоубийца: всякий раз, когда паук оказывается на достаточно близком расстоянии от своей цели, он раздувает свое брюшко и разрывается на множество крошечных горящих фрагментов. Эти фрагменты воспламеняют все, с чем соприкасаются. К счастью, паук не выживет.

source: Starting Pad
ru: Старт

source: The starting pad is a platform used in some exercises.
ru: Старт - это начальный пункт, используемый на тренировках.

source: <button 164/> Power Station
ru: <button 164/> Энергозаправка

source: The power station extracts energy from the underground and recharges <a object|power>regular power cells</a> through induction. To recharge a power cell loaded at the back of a bot, just move the bot to the center of the platform and wait a few seconds. A <a object|power>power cell</a> carried at arm's length can also be recharged. <a object|atomic>Nuclear power cells</a> are non-rechargeable.
ru: Энергозаправка добывает энергию из месторождения и заряжает <a object|power>Батарею Обычную</a> за счет индукции. Чтобы перезарядить Батарею, установленную в задней части бота, просто переместите бота в центр платформы и подождите несколько секунд. Можно также перезарядить <a object|power>Батарею</a>, находящуюся на вытянутых руках. <a object|atomic>Батарея Ядерная</a> не подлежит перезарядке.

source: A power plant needs some energy in the subsoil. If the satellite report says that energy is available only at some places, you will need a <a object|botsr>sniffer bot</a> to prospect the subsoil. The marks it lays down provide information about the specifics of its findings: a <a object|enerspot>green cross</a> means that there is an energy deposit at this location beneath the surface, which is indispensable to the construction of a power station or a <a object|energy>power plant</a>.
ru: Энергозаправке требуется Месторождение Энергии. Если в спутниковом отчете говорится, что энергия доступна только в отдельных местах, вам понадобится <a object|botsr>Бот Разведчик</a> для поиска месторождения. Пометки, которые он проставит, укажут о находках: <a object|enerspot>Крест Зелёный</a> означает Месторождение Энергии, которое требуется для постройки Энергозаправки или <a object|energy>Энергостанции</a>.

source: The large power cell at the top of the station remaining red after the construction is completed can only mean that the site is not geologically adequate.
ru: Если большая батарея наверху станции остается красной после завершения строительства, это означает, что площадка не подходит с геологической точки зрения.

source: Any flat and geologically adequate surface at least 6 meters wide.
ru: Любая ровная и геологически подходящая поверхность шириной не менее 6 метров.

source: Empty power cell.
ru: Батареи пустые.

source: Recharged power cell.
ru: Батареи заряженные.

source: A few seconds, depending on the capacity to be recharged.
ru: Несколько секунд, в зависимости от заряжаемой емкости.

source: Underground Titanium Deposit
ru: Подземное Месторождение Титана

source: A red cross reveals the presence of a stratum of <a object|titanore>titanium ore</a> in the subsoil. It will be possible to extract it using a <a object|derrick>derrick</a>.
ru: Крест Красный отмечает наличие месторождения <a object|titanore>Руды Титановой</a>. Её можно будет добыть используя <a object|derrick>Вышку</a>.

source: A <a object|botsr>sniffer</a> will lay down a red cross each time it uncovers a deposit. <a object|botsr>Sniffer bots</a> can also detect the presence of <a object|uranore>uranium ore</a> as indicated by a <a object|uranspot>yellow circle</a> and of energy as indicated by a <a object|enerspot>green cross</a>.
ru: <a object|botsr>Разведчик</a> будет ставить Крест Красный при обнаружении месторождения. <a object|botsr>Бот Разведчик</a> также может обнаружить месторождение <a object|uranore>Руды Урановой</a> отметив <a object|uranspot>Кругом Жёлтым</a>, и Энергии отметив <a object|enerspot>Крест Зелёный</a>.

source: Titanium
ru: Титан

source: Titanium is indispensable for the construction of buildings, <a object|factory>bots</a> and <a object|energy>regular power cells</a>. There is usually some left on the <a object|base>spaceship</a> when you embark on a new mission.
ru: Титан незаменим при строительстве зданий, <a object|factory>Ботов</a> и <a object|energy>Батареи Обычной</a>. Немного Титана имеется на <a object|base>Космическом Корабле</a>, когда вы отправляетесь в новую миссию.

source: If more is needed, you'll have to <a object|convert>convert</a> chunks of <a object|titanore>titanium ore</a> into usable titanium cubes.
ru: Если требуется большее количество, вам понадобится <a object|convert>Преобразователь</a> и куски <a object|titanore>Руды Титановой</a> переработайте в Титан.

source: Titanium Ore
ru: Руда Титановая

source: <a object|titan>Titanium</a> is indispensable for the construction of buildings, <a object|factory>bots</a> and <a object|energy>regular power cells</a>. The titanium <a object|human>you</a> see in its usable, cube shaped form has been <a object|convert>converted</a> from raw chunks of titanium ore.
ru: <a object|titan>Титан</a> незаменим при строительстве зданий, <a object|factory>Ботов</a> и <a object|energy>Батареи Обычной</a>. Титан, который <a object|human>Вы </a> видите в готовом виде, был получен в <a object|convert>Преобразователе</a> из кусков Руды Титановой.

source: Titanium ore can be found either directly on the surface or in the subsoil. In the latter case, it needs to be first located and identified by a <a object|botsr>sniffer</a>, then extracted using a <a object|derrick>derrick</a>. If a sniffer identifies a titanium ore deposit, it lays down a <a object|stonspot>red cross</a>.
ru: Руду Титановую можно найти либо непосредственно на поверхности, либо в месторождении. В последнем случае месторождение нужно сначала найти и распознать с помощью <a object|botsr>Разведчика</a>, а затем добыть руду с помощью <a object|derrick>Вышки</a>. Если Разведчик обнаруживает месторождение Руды Титановой, ставит <a object|stonspot>Крест Красный</a>.

source: Explosive (TNT)
ru: Заряд (ТНТ)

source: A TNT charge is extremely sensitive. You should approach it with caution so as not to hit it or give it any kind of shock. The risk is minimized once the explosive is within a <a object|botgr>grabber</a>'s grasp.
ru: Заряд TNT чрезвычайно чувствителен. Подходите к нему осторожно, чтобы не ударить и не встряхнуть. Риск минимален, когда взрывчатка окажется в манипуляторе <a object|botgr>Погрузчика</a>.

source: <button 165/> Defense Tower
ru: <button 165/> Башня Обороны

source: The tower constitutes the best defense against <a object|mother>enemy</a> attacks, whether they originate on the ground or from the skies.
ru: Башня представляет собой лучшую защиту от атак <a object|mother>Врагов</a>, независимо от того, исходят ли они с земли или с неба.

source: The tower requires either a <a object|power>regular</a> or a <a object|atomic>nuclear</a> power cell. A regular power cell provides a capacity for 8 shots. A nuclear power cell is of course preferable. The tower starts blinking when it runs out of power.
ru: Башня требует либо <a object|power>Батарею Обычную</a>, либо <a object|atomic>Батарею Ядерную</a>. Батарея Обычная рассчитана на 8 выстрелов. Батарея Ядерная, конечно, предпочтительнее. Башня начинает мигать, когда в ней заканчивается энергия.

source: The range is 40 meters. To visualize it, select the tower then hit the <range> button <button 41/>. Red dots outline the circular zone for 20 seconds.
ru: Дальность действия 40 метров. Чтобы показать зону действия, выберите Башню и нажмите <range> кнопку <button 41/>. Маленькие красные точки очертят круговую зону на 20 секунд.

source: Any flat surface of at least 3.5 meters wide.
ru: Любая ровная поверхность шириной не менее 3.5 метров.

source: Uranium Ore
ru: Руда Урановая

source: Uranium ore is essential to the production of <a object|atomic>nuclear power cells</a>.
ru: Руда Урановая необходима для производства <a object|atomic>Батареи Ядерной</a>.

source: It is to be found on the surface or in the subsoil. In the latter case, it needs to be first located and identified by a <a object|botsr>sniffer</a>, then extracted using a <a object|derrick>derrick</a>. If a sniffer identifies a deposit of uranium ore, it lays down a <a object|uranspot>yellow circle</a>.
ru: Руду Урановую можно найти либо непосредственно на поверхности, либо в месторождении. В последнем случае месторождение нужно сначала найти и распознать с помощью <a object|botsr>Разведчика</a>, а затем добыть руду с помощью <a object|derrick>Вышки</a>. Если Разведчик обнаруживает месторождение Руды Урановой, ставит <a object|stonspot>Круг Жёлтый</a>.

source: A <a object|nuclear>nuclear plant</a> will then take care of converting the chunk into a new and fully charged <a object|atomic>nuclear power cell</a>.
ru: Затем <a object|nuclear>Энергостанция Ядерная</a> перерабатывает кусок в новую и полностью заряженную <a object|atomic>Батарею Ядерную</a>.

source: All <a object|botgr>grabbers</a>. Due to its radioactivity, the <a object|human>astronaut</a> can not transport it.
ru: Все <a object|botgr>Погрузчики</a>. Из-за радиоактивности <a object|human>Космонавт</a> не может ее перемещать.

source: Underground Uranium Deposit
ru: Подземное Месторождение Урана

source: A yellow circle reveals the presence of a stratum of <a object|uranore>uranium ore</a> in the subsoil. It will be possible to extract it using a <a object|derrick>derrick</a>.
ru: Круг Жёлтый показывает наличие месторождения <a object|uranore>Руды Урановой</a>. Руду можно добыть используя <a object|derrick>Вышку</a>.

source: A <a object|botsr>sniffer</a> will lay down a yellow circle each time it uncovers a deposit. <a object|botsr>Sniffer bots</a> can also detect the presence of <a object|titanore>titanium ore</a> as indicated by a <a object|stonspot>red cross</a> and of energy as indicated by a <a object|enerspot>green cross</a>.
ru: <a object|botsr>Разведчик</a> будет ставить Круг Жёлтый при обнаружении месторождения. <a object|botsr>Бот Разведчик</a> также может обнаружить месторождение <a object|uranore>Руды Титановой</a> отметив <a object|uranspot>Крест Красный</a>, и энергии отметив <a object|enerspot>Крест Зелёный</a>.

source: Wasp
ru: Оса

source: The wasp is a formidable enemy, very hard to shoot down since its flying is particularly swift. Wasps carry balls of <a object|bullet>organic matter</a> that they will hurl at your bots and buildings and at yourself from above.
ru: Оса - грозный враг, которую очень трудно сбить, так как она летит особенно быстро. Осы несут шары из <a object|bullet>Био-Материи</a>, которые они будут швырять сверху в ваших ботов, здания и вас.

source: The <a object|tower>defense tower</a> is the easiest way to get rid of them.
ru: <a object|tower>Башня Обороны</a> - самый простой способ избавиться от них.

source: Checkpoint
ru: Этап

source: In the exercises, blue crosses indicate positions that have to be crossed. They disappear as soon as a <a object|bottr>practice bot</a> crosses them.
ru: На тренировках Крест Синий обозначает позицию, которую необходимо пересечь. Крест исчезнет, как только его пересечет <a object|bottr>Бот Учебный</a>.

source: Worm
ru: Червь

source: Worms transmit viruses to programmed bots. The virus alters the programming to such an extent that the bot either functions in a very erratic way or stops functioning altogether.
ru: Черви передают вирусы запрограммированным ботам. Вирус изменяет программу до такой степени, что бот либо работает очень странно, либо вообще перестает работать.

source: Worms live in the subsoil but sometimes emerge and crawl on the surface. When they are underground they are undetectable and indestructible.
ru: Черви живут под землей, но иногда появляются и ползают по поверхности. Когда они находятся под землей, их невозможно обнаружить и невозможно уничтожить.

source: Derelict bot
ru: Обломки бота

source: A derelict bot is what's left of a bot after it has been disabled by a <a object|spider>spider</a> or by friendly fire.
ru: Обломки - это то, что осталось от бота после того, как он был выведен из строя <a object|spider>Пауком</a> или дружественным огнем.

source: A <a object|botrecy>recycler</a> can convert a derelict bot back into a reusable <a object|titan>titanium cube</a>.
ru: <a object|botrecy>Утилизатор</a> может переработать Обломки обратно в <a object|titan>Титан</a>.

source: It gives birth to the following insects :
ru: Она откладывает Яйца следующих насекомых :

source: <button 169/> Destroyer
ru: <button 169/> Разрушитель

source: This building was designed to destroy objects. The object just needs to be placed at the center of the platform and the button can be pressed. The destroyer takes care of the rest.
ru: Это здание было спроектировано для разрушения объектов. Просто нужно разместить объект в центре платформы и нажать кнопку. Об остальном позаботится Разрушитель.

source: Object that is no longer needed.
ru: Объект, который больше не нужен.

source: Satisfaction.
ru: Исполнение.

source: 5 seconds.
ru: 5 секунд.

source: <a cbot>CBOT Language</a>, <a cbot|type>variables</a> and <a cbot|category>categories</a>.
ru: <a cbot>Язык CBOT</a>, <a cbot|type>переменные</a> и <a cbot|category>категории</a>.

source: Target2
ru: Цель

source: Target1
ru: Цель

source: These buildings appear in the flying exercise missions and their height can vary. In the center <a object|target2>Target2</a> is placed.
ru: Эти здания появляются в миссиях на тренировочных полетах, и их высота может изменяться. В центре размещается <a object|target2>Цель Воздушная</a>.

source: In the flying exercise missions, brown crosses indicate positions that have to be crossed by a winged bot. They disappear as soon as a bot flies through them. They are placed in the center of the <a object|target1>Target1</a> building.
ru: На тренировочных полетах Крест Коричневый обозначает позицию, которую должен пересечь Бот Крылатый. Крест исчезает, как только через них пролетает бот. Крест размещается в центре здания <a object|target1>Цель</a>.
