Repository: DavydovMA/colobot-data
Catalog: help/object/po/*.po
Languages: ru

source: Ant
ru: Муравей

source: Ants shoot tiny corrosive balls that eventually gnaw into the protective shielding of bots and buildings, causing them to explode.
ru: Муравьи стреляют крошечными токсичными сферами, которые разъедают защитные экраны ботов и зданий, заставляя их взрываться.

source: <a object|human>You</a> can resist their attack much longer than most buildings and bots, and your protective shield will be restored as your wounds heal. However, if you stay too long in their range or if there are too many of them, your life is in great danger.
ru: <a object|human>Вы</a> можете противостоять их атакам гораздо дольше, чем большинство зданий и ботов, и ваш защитный щит будет восстанавливаться по мере заживления ран. Однако, если вы слишком долго остаетесь в зоне поражения или их слишком много, ваша жизнь подвергается большой опасности.

source: Object <a cbot|category>Category</a>
ru: Объект <a cbot|category>Категория</a>

source: See also
ru: Смотрите также

source: <a cbot>CBOT Language</a>, <a cbot|type>Variables</a> and <a cbot|category>Categories</a>.
ru: <a cbot>Язык CBOT</a>, <a cbot|type>Переменные</a> и <a cbot|category>Категории</a>.

source: Nuclear Power Cell
ru: Батарея Ядерная

source: A nuclear power cell supplies the bots and some buildings with energy. Its capacity is 100 times that of a <a object|power>regular power cell</a>.
ru: Батарея Ядерная снабжает энергией ботов и некоторые здания. Её ёмкость в 100 раз больше, чем у <a object|power>Батареи Обычной</a>.

source: Nuclear power cells cannot be recharged or recycled. A <a object|nuclear>nuclear plant</a> and some <a object|uranore>uranium ore</a> is needed to produce a new and fully charged nuclear power cell.
ru: Батарея Ядерная не подлежит перезарядке или переработке. Потребуется <a object|nuclear>Энергостанция Ядерная</a> и <a object|uranore>Руда Урановая</a> для производства новой и полностью заряженной Батареи Ядерной.

source: Transport
ru: Транспорт

source: All <a object|botgr>grabbers</a> and the <a object|human>astronaut</a>.
ru: Все <a object|botgr>Погрузчики</a> и <a object|human>Космонавт</a>.

source: Barrier
ru: Барьер

source: The barrier is nothing more than an obstacle used in the exercises.
ru: Барьер - это не более чем препятствие, используемое на тренировках.

source: <button 171/> Spaceship
ru: <button 171/> Космический Корабль

source: <a object|human>Your</a> means of transportation from one planet to the next, the only way to travel safely across the cosmos and accomplish your missions.
ru: <a object|human>Ваше</a> средство передвижения с одной планеты на другую, единственный способ безопасно путешествовать по космосу и выполнять свои миссии.

source: In addition to yourself, the spaceship can carry bots and raw materials. Whenever a mission is completed, you must select the spaceship, then click on the <takeoff> command <button 28/>.
ru: Помимо вас, Космический Корабль может перевозить ботов и сырье. Когда миссия завершена, вы должны выбрать Космический Корабль, затем нажать <takeoff> команду <button 28/>.

source: Black Box
ru: Чёрный Ящик

source: A black box is actually orange so as to be easier to identify and locate. Each <a object|base>spaceship</a> is equipped with a black box that records and stores information about the flight.
ru: Чёрный ящик на самом деле оранжевого цвета, чтобы было легче распознать и найти его. Каждый <a object|base>Космический Корабль</a> оснащен Чёрным Ящиком, в котором записывается и хранится информация о полете.

source: A black box can also be used to leave important information. On every planet the first expedition has left a black box containing the coordinates of the planet it was heading towards next.
ru: Чёрный Ящик также можно использовать для хранения важной информации. На каждой планете первая экспедиция оставила черный ящик с координатами планеты, к которой она направилась.

source: Organic Matter
ru: Био-Материя

source: The organic matter is the insects' secretion. <a object|wasp>Wasps</a> often use balls of organic matter to bombard you. You should perhaps try to get hold of some since it could allow you, given the necessary <a object|labo>analysis</a>, to discover new and strange technologies that will improve the efficiency of your bots.
ru: Био-Материя - это выделения насекомых. <a object|wasp>Осы</a> часто используют сферы из Био-Материи, чтобы бомбардировать вас. Возможно, вам стоит попытаться заполучить некоторое их количество, чтобы после проведения необходимых <a object|labo>Исследований</a>, открыть новые и необычные технологии, которые улучшат эффективность ваших ботов.

source: <button 174/> Power Captor
ru: <button 174/> Молниеотвод

source: The power captor acts as both a lightning conductor and a power converter. It offers protection within a radius of 50 meters against the perilous lightning bolts of magnetic storms. Additionally, when the captor is hit by lightning, all bots and <a object|power>power cells</a> placed underneath, with the exception of the <a object|atomic>nuclear power cells</a>, are recharged.
ru: Молниеотвод улавливает разряды молний и преобразует в энергию. Он защищает в радиусе 50 метров от воздействия молнии во время магнитных бурь. Кроме того, когда в Молниеотвод попадает молния, все боты и <a object|power>Батареи Обычные</a>, размещенные снизу, кроме <a object|atomic>Батареи Ядерной</a>, перезаряжаются.

source: To visualize the zone shielded by a power captor, select it then hit the <range> button <button 41/>. Red dots outline the circular zone for 20 seconds.
ru: Чтобы показать зону действия, выберите Молниеотвод и нажмите <range> кнопку <button 41/>. Маленькие красные точки очертят круговую зону на 20 секунд.

source: In the vastness of space, few planets suffer from magnetic storms. Among the ones you'll be visiting, only Orpheon is subject to this phenomenon.
ru: На просторах космоса мало планет подверженных явлению магнитных бурь. Из тех, что вы посетите, только Орфеон подвержен этому явлению.

source: Note that your <a object|base>spaceship</a> can also act as a lightning conductor. However it will not recharge power cells.
ru: Заметьте, что ваш <a object|base>Космический Корабль</a> также может действовать как Молниеотвод. Однако он не будет заряжать Батареи.

source: Requirements for building
ru: Требования к зданию

source: Any flat surface of at least 10 meters wide.
ru: Любая ровная поверхность шириной не менее 10 метров.

source: Power source
ru: Источник энергии

source: Lightning bolts.
ru: Молнии.

source: Duration of operation
ru: Длительность операции

source: 1 second.
ru: 1 секунда.

source: <button 162/> Converter
ru: <button 162/> Преобразователь

source: This building was designed to convert chunks of <a object|titanore>titanium ore</a> into usable <a object|titan>titanium cubes</a>. All <a object|human>you</a> need to do is place a chunk at the center of the platform and step back. The converter takes care of the rest.
ru: Это здание было спроектировано для переработки куска <a object|titanore>Руды Титановой</a> в <a object|titan>Титан</a>. Все что <a object|human>Вам</a> надо, - это поместить кусок в центр платформы и отойти. Об остальном позаботится Преобразователь.

source: Any flat surface of at least 6 meters wide.
ru: Любая ровная поверхность шириной не менее 6 метров.

source: Input
ru: Вход

source: Titanium ore.
ru: Руда Титановая.

source: Output
ru: Выход

source: Titanium.
ru: Титан.

source: None.
ru: Ничто.

source: 15 seconds.
ru: 15 секунд.

source: <button 161/> Derrick
ru: <button 161/> Вышка

source: The derrick is intended for the extraction of raw materials.
ru: Вышка предназначена для добычи сырья.

source: In order to determine the best site on which to erect a derrick, a <a object|botsr>sniffer</a> should be used to prospect the subsoil. The marks it lays down provide information about the specifics of what the derrick will be able to extract:
ru: Чтобы определить лучшее место для установки Вышки, следует использовать <a object|botsr>Разведчик</a> для поиска месторождений. Отметки, которые Разведчик проставит, укажут на то, что сможет добывать Вышка:

source: a <a object|stonspot>red cross</a> -> <a object|titanore>titanium ore</a>.
ru: <a object|stonspot>Крест Красный</a> -> <a object|titanore>Руда Титановая</a>.

source: a <a object|uranspot>yellow circle</a> -> <a object|uranore>uranium ore</a>.
ru: <a object|uranspot>Круг Жёлтый</a> -> <a object|uranore>Руда Урановая</a>.

source: Any flat and geologically adequate surface of at least 2.5 meters wide.
ru: Любая ровная и геологически подходящая поверхность шириной не менее 2,5 метров.

source: Titanium or uranium ore in the subsoil.
ru: Месторождение Руды Титановой или Урановой.

source: Chunks of titanium or uranium ore.
ru: Куски Руды Титановой или Урановой.

source: 10 seconds for titanium and 30 for uranium.
ru: 10 секунд для Титана и 30 для Урана.

source: Alien Egg
ru: Яйцо Пришельцев

source: The alien eggs are laid by the <a object|mother>Alien Queen</a>. After a short time, they will hatch and an <a object|ant>ant</a>, a <a object|wasp>wasp</a>, a <a object|spider>spider</a> or a <a object|worm>worm</a> will come out.
ru: Яйцо Пришельцев откладывает <a object|mother>Королева Пришельцев</a>. Через короткое время из него вылупится <a object|ant>Муравей</a>, <a object|wasp>Оса</a>, <a object|spider>Паук</a> или <a object|worm>Червь</a>.

source: <button 167/> Power Plant
ru: <button 167/> Энергостанция Обычная

source: The power plant is a <a object|power>power cell</a> factory. It transforms a <a object|titan>titanium cube</a> into a regular power cell fully charged and ready for use.
ru: Энергостанция Обычная - это производство <a object|power>Батареи Обычной</a>. Перерабатывает <a object|titan>Титан</a> в полностью заряженную и готовую к использованию Батарею Обычную.

source: A power plant requires some energy in the subsoil. If the satellite report says that energy is available only at some places, you will need a <a object|botsr>sniffer bot</a> to prospect the subsoil. The marks it lays down provide information about the specifics of its findings: a <a object|enerspot>green cross</a> means that there is an energy deposit at this location beneath the surface, which is indispensable for the construction of a power plant or a <a object|station>power station</a>.
ru: Энергостанция Обычная требует небольшое Месторождение Энергии. Если в отчете спутника указано, что энергия доступна только в отдельных местах, вам понадобится <a object|botsr>Бот Разведчик</a> для поиска месторождения. Отметки, проставленные Разведчиком, в виде: <a object|enerspot>Крест Зелёный</a> указывают на Месторождение Энергии, необходимое для строительства Энергостанции Обычной или <a object|station>Энергозаправки</a>.

source: If the large power cell at the base of the plant remains red after the construction is completed, this means that the site is not geologically adequate.
ru: Если большая батарея в основании станции остается красной после завершения строительства, это означает, что площадка не подходит с геологической точки зрения.

source: Any flat and geologically adequate surface of at least 4 meters wide.
ru: Любая ровная и геологически подходящая поверхность шириной не менее 4 метров.

source: Regular power cell.
ru: Батарея Обычная.

source: Subsoil energy.
ru: Месторождение Энергии.

source: 12 seconds.
ru: 12 секунд.

source: Underground Energy Deposit
ru: Подземное Месторождение Энергии

source: Whenever a <a object|botsr>sniffer</a> uncovers a source of energy in the subsoil, it lays down a green cross. The following buildings can be erected nearby :
ru: Каждый раз, когда <a object|botsr>Разведчик</a> обнаруживает Месторождение Энергии, он ставит Крест Зелёный. Следующие здания могут быть возведены поблизости :

source: <a object|station>Power station</a>
ru: <a object|station>Энергозаправкa</a>

source: <a object|energy>Power plant</a>
ru: <a object|energy>Энергостанция Обычная</a>

source: In order to prospect the subsoil you need a <a object|botsr>sniffer bot</a>, which can also discover <a object|titanore>titanium ore</a> deposits (indicated by a <a object|stonspot>red cross</a>) or <a object|uranore>uranium ore</a> deposits (indicated by a <a object|uranspot>yellow circle</a>).
ru: Для поиска месторождений вам понадобится <a object|botsr>Бот Разведчик</a>, который также может обнаруживать месторождения <a object|titanore>Руды Титановой</a> (отмечено <a object|stonspot>Крест Красный</a>) или <a object|uranore>Руды Урановой</a> (отмечено <a object|uranspot> Круг Жёлтый</a>).

source: Impossible.
ru: Невозможно.

source: <button 172/> Information Exchange Post
ru: <button 172/> Пункт Обмена Информацией

source: This building stores digital information. A post can contain up to 10 pieces of information, each one referenced by a name. For example, a post can contain 3 informations:<c/> \tab;"Position.x" 23.45 \tab;"Position.y" -102.70 \tab;"Quantity" 3.00
ru: В этом здании хранится цифровая информация. Пункт может содержать до 10 единиц информации, каждая со своим именем. Например, пункт может содержать 3 единицы информации:<c/> \tab;"Position.x" 23.45 \tab;"Position.y" -102.70 \tab;"Quantity" 3.00

source: To put new information, you must execute the command <code><a cbot|send>send</a></code>. To read information from a post, you must execute the command <code><a cbot|receive>receive</a></code>.
ru: Чтобы отправить новую информацию в пункт, вы должны выполнить команду <code><a cbot|send>send</a></code>. Чтобы принять информацию из пункта, вы должны выполнить команду <code><a cbot|receive>receive</a></code>.

source: Any flat surface of at least 2.5 meters wide.
ru: Любая ровная поверхность шириной не менее 2.5 метров.

source: Digital information.
ru: Цифровая информация.

source: <button 160/> Bot Factory
ru: <button 160/> Фабрика Ботов

source: This building is intended for the manufacturing of bots using <a object|titan>titanium</a>.
ru: Это здание предназначено для создания ботов из <a object|titan>Титана</a>.

source: Place the titanium cube inside the factory.
ru: Поместите Титан внутрь Фабрики.

source: Step back out.
ru: Отойдите.

source: Select the factory.
ru: Выберите фабрику.

source: Click on the button showing the diagram of the bot you want the factory to assemble (e.g. <button 137/> for a <a object|botgr>wheeled grabber</a>).
ru: Нажмите на кнопку с картинкой бота, которого вы хотите построить (например: <button 137/> для <a object|botgr>Погрузчик Колёсный</a>).

source: The finished bot does not include an onboard <a object|power>power cell</a>. You'll need to supply it with one for it to be able to leave the factory.
ru: Готовый бот не имеет на борту <a object|power>Батареи</a>. Вам понадобится вставить ее в батарейный отсек, чтобы бот смог покинуть Фабрику.

source: The list of feasible bots will depend upon the research your <a object|research>research center</a> has completed at this time.
ru: Список доступных ботов будет зависеть от уровня исследований, которые ваш <a object|research>Центр Исследований</a> завершил на текущий момент.

source: Any flat surface of at least 7.5 meters wide.
ru: Любая ровная поверхность шириной не менее 7.5 метров.

source: Completed bot.
ru: Готовый бот.

source: Colored Flag
ru: Флаг

source: The colored flags are helpful to mark strategic locations or positions that <a object|human>you</a> will need to find again. Flags appear on the mini-map in the shape of a cross of the same color as the flag.
ru: Флагами разного цвета можно отметить стратегические места или позиции, которые <a object|human>Вам</a> нужно будет снова найти. Флаги появляются на мини-карте в виде креста того же цвета, что и флаг.

source: Use the buttons <button 118/> and <button 119/> to plant and remove flags, the colors of which you can choose with the buttons above.
ru: Используйте кнопки <button 118/> и <button 119/>, чтобы установить и убрать флаг, цвет которого вы можете выбрать с помощью кнопок выше.

source: When your mini-map is out of order, the fact that flags follow the direction of the wind can help you to find your way and not to walk around in circles.
ru: Когда ваша мини-карта вышла из строя, тот факт, что флаги развеваются по ветру, поможет вам сориентироваться, а не ходить по кругу.

source: When programming, you can use flags to give a bot a reference to a certain position: the instruction <code><a cbot|radar>radar</a></code> allows bots to know the exact position of a flag of a given color.
ru: При программировании вы можете использовать флаги, чтобы направить бота на определенную позицию: инструкция <code><a cbot|radar>radar</a></code> позволяет ботам определить точную позицию флага определенного цвета.

source: Finishing Pad
ru: Финиш

source: The finishing pad is an objective to be reached in some exercises.
ru: Финиш - это конечный пункт, который нужно достигнуть на тренировках.

source: <code>GoalArea</code>
ru: <code>FinishArea</code>

source: <button 136/> Astronaut
ru: <button 136/> Космонавт

source: The astronaut is you within the game.
ru: Космонавт - это вы в игре.

source: If you die, the mission immediately fails.
ru: Если вы умираете, миссия немедленно завершается.

source: You can construct buildings with the help of the neutron gun holstered to your survival kit. The survival kit allows you, in most missions, to fly, thanks to the reactor placed underneath, or to swim with no time limit. You can carry most objects but the weight will slow down your movements considerably. Flying, swimming and walking underwater are also made impossible if you are carrying an object. The use of a <a object|botgr>grabber</a> or a <a object|botsub>subber</a> is advised for tasks such as these.
ru: Вы можете строить здания с помощью нейтронного пистолета, прикрепленного к вашему ранцу для выживания. Ранец для выживания позволяет вам в большинстве миссий летать благодаря размещенным снизу двигателю или плавать без ограничения по времени. Вы можете переносить большинство объектов, но вес значительно замедлит ваши движения. Полеты, плавание и ходьба под водой становятся невозможны, если вы переносите какой-либо объект. Для подобных задач лучше использовать <a object|botgr>Погрузчика</a> или <a object|botsub>Амфибию</a>.

source: You cannot carry <a object|uranore>uranium ore</a> because of the risks attached to radioactivity.
ru: Из-за радиоактивности Вы не можете переносить <a object|uranore>Руду Урановую</a>.

source: A special button <button 111/> allows you to ensure that the ground around you is flat. This is important since building is only possible on a flat surface. A flat surface is designated green while a sloping one is red.
ru: Специальная кнопка <button 111/> позволяет вам убедиться, что земля вокруг вас ровная. Это важно, поскольку строительство возможно только на ровной поверхности. Ровная поверхность отображается зелёной, а наклонная - красной.

source: A button <button 118/> allows you to mark a location with <a object|flag>flags</a> of various colors. This can help you not to get lost, to find important positions again, or to indicate a position to a bot. 5 flags of 5 different colors are at your disposal. You can remove a flag by using the next button <button 119/> and store it for further use.
ru: Кнопка <button 118/> позволяет вам отмечать места с помощью <a object|flag>Флагов</a> различных цветов. Это поможет Вам не заблудиться, снова найти важные места или указать позицию боту. В вашем распоряжении 5 флагов 5 разных цветов. Вы можете убрать флаг, нажав следующую кнопку <button 119/>, и сохранить его для дальнейшего использования.

source: <button 176/> Mission Control
ru: <button 176/> Центр Управления

source: Earth control center for all <a object|human>your</a> space missions. Though still named after the well-known mission control of the old days, "Houston" is actually located in the middle of the Nevada Desert, the new center for space exploration activities.
ru: Центр Управления на земле руководит всеми <a object|human>Вашими</a> космическими миссиями. Хотя он и назван в честь хорошо известного центра управления полетами, "Хьюстон" на самом деле теперь находится в центре пустыни Невада, в новом центре космических исследований.

source: The Mission Control Center watches over you day and night, and a whole team of scientists and engineers are working hard trying to find a solution to all the problems that you encounter.
ru: Центр Управления полётами наблюдают за вами день и ночь, и целая команда ученых и инженеров трудолюбиво, пытается найти решение всех проблем, с которыми Вы сталкиваетесь.

source: Keys A, B, C and D
ru: Ключи A, B, C и D

source: The keys give <a object|human>you</a> access to the <a object|safe>vault</a>. You'll need 4 of them.
ru: Ключи дают <a object|human>Вам</a> доступ к <a object|safe>Ангару</a>. Вам понадобится 4 штуки.

source: Key A, blue and triangle-shaped
ru: Ключ A, синий и треугольный

source: Key B, red and pentagon-shaped
ru: Ключ B, красный и пятиугольный

source: Key C, green and shaped like a 6-pointed star
ru: Ключ C, зелёный и в форме 6-конечной звезды

source: Key D, yellow and circular
ru: Ключ D, жёлтый и круглый

source: Objects <a cbot|category>Category</a>
ru: Объект <a cbot|category>Категория</a>

source: <button 166/> Autolab
ru: <button 166/> Лаборатория

source: The lab is intended for the analysis of <a object|bullet>organic matter</a>. It will help <a object|human>you</a> become familiar with the insects' very own technology and perhaps even use it to your advantage. Place a chunk of <a object|bullet>organic matter</a> on the platform, select the lab, and click the button corresponding to the desired research program.
ru: Лаборатория предназначена для анализа <a object|bullet>Био-Материи</a>. Это поможет <a object|human>Вам</a> узнать больше о технологиями пришельцев и, возможно, даже использовать их в своих интересах. Поместите кусок <a object|bullet>Био-Материи</a> на платформу, выберите Лабораторию и нажмите кнопку, заинтересовавшей вас исследовательской программы.

source: Organic matter.
ru: Био-Материя.

source: New and improved technologies.
ru: Новые и улучшенные технологии.

source: 20 seconds.
ru: 20 секунд.

source: Apollo Lunar Roving Vehicle
ru: Луноход Аполлон

source: <code>< no archive picture available ></code>
ru: <code>< архивное изображение недоступно ></code>

source: The Lunar Jeep (LRV) was brought to the moon on July 30th 1971 by the astronauts David Scott and Jim Irwin from Apollo mission 15. Its batteries are still partly charged, which allows you to remote control it. But this old-fashioned technology will be of no use to you.
ru: Лунный джип (LRV) был доставлен на Луну 30 июля 1971 года астронавтами Дэвидом Скоттом и Джимом Ирвином из миссии 15 Аполлон. Его батареи все еще частично заряжены, что позволяет управлять им дистанционно. Но эта устаревшая технология вам ни к чему.

source: Mine
ru: Мина

source: Mines were a defensive weapons system used by the first expedition. Because of the dangers this system causes for the mission itself, they are no longer used in your expedition. In some exercises mines are used to learn how to avoid obstacles. There is no way to remove them or to create new ones.
ru: Мины были системой оборонительного оружия, использовавшейся в первой экспедиции. Из-за опасностей, которые эта система создавала для самой миссии, они больше не используются в вашей экспедиции. На тренировках мины используются, чтобы научиться избегать препятствий. Невозможно демонтировать их или установить новые.

source: With a <a object|bottr>practice bot</a>, don't get any closer than 2 meters to the position given by the instruction <a cbot|radar>radar</a>.
ru: На <a object|bottr>Боте Учебном</a> не подходите ближе 2 метров к позиции, отображенной на <a cbot|radar>Радаре</a>.

source: Alien Queen
ru: Королева Пришельцев
