Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: Done by <a object|labo>AutoLab</a>:
ru: Выполнено в <a object|labo>Лаборатории</a>:

source: <code><format const>ResearchLegged</format> </code>Legged bots (e.g. <a object|botgs>legged grabber</a>) <code><format const>ResearchOrgaShooter</format> </code>Bots with orgaball cannon (e.g. <a object|botoc>tracked orga shooter</a>)
ru: <code><format const>ResearchLegged</format> </code>Боты Лапчатые (например, <a object|botgs>Погрузчик Лапчатый</a>) <code><format const>ResearchOrgaShooter</format> </code>Боты с био-ядреным орудие (например, <a object|botoc>Био-Стрелок Гусеничный</a>)

source: Impossible to research:
ru: Невозможно исследовать:

source: <code><format const>ResearchSniffer</format> </code>Sniffers (e.g. <a object|botsc>tracked sniffer</a>) <code><format const>ResearchSubber</format> </code><a object|botsub>Subber</a> <code><format const>ResearchRecycler</format> </code><a object|botrecy>Recycler</a>
ru: <code><format const>ResearchSniffer</format> </code>Разведчики (например, <a object|botsc>Разведчик Гусеничный</a>) <code><format const>ResearchSubber</format> </code><a object|botsub>Амфибия</a> <code><format const>ResearchRecycler</format> </code><a object|botrecy>Утилизатор</a>

source: <a cbot>CBOT Language</a>, <a cbot|type>variables</a> and <a cbot|category>categories</a>.
ru: <a cbot>Язык CBOT</a>, <a cbot|type>переменные</a> и <a cbot|category>категории</a>.

source: Instruction <code>round</code>
ru: Инструкция <code>round</code>

source: Rounds a number.
ru: Округляет число.

source: Rounded <code>value</code>. For example, <code>round(2.5)</code> is <code>3.0</code>, whereas <code>round(2.4)</code> is <code>2.0</code>.
ru: Округлённое <code>value</code>. Например, <code>round(2.5)</code> - это <code>3.0</code>, а <code>round(2.4)</code> - <code>2.0</code>.

source: <a cbot|trunc>trunc</a>, <a cbot|floor>floor</a>, <a cbot|ceil>ceil</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|expr>expressions</a>.
ru: <a cbot|trunc>trunc</a>, <a cbot|floor>floor</a>, <a cbot|ceil>ceil</a>, <a cbot>программирование</a>, <a cbot|type>типы</a> и <a cbot|expr>выражения</a>.

source: Detects the object of the given category that is closest to the given position. Similar to <c/><a cbot|radar>radar();</a><n/>, but can search starting from the specific point instead of the actual bot's position.
ru: Обнаруживает объект данной категории, ближайший к данной позиции. Подобно <c/><a cbot|radar>radar();</a><n/>, но может выполнять поиск, начиная с определенной точки, а не с фактической позиции бота.

source: <a cbot|category>Category</a> of the objects that should be detected. For example, when you are looking for an ant, write <code>search(AlienAnt)</code>.
ru: <a cbot|category>Категория</a> объектов, которые необходимо обнаружить. Например, если вы ищете муравья, напишите <code>search(AlienAnt)</code>.

source: <a cbot|array>Array</a> of categories of the objects that should be detected. For example, when you are looking only for grabbers, starting from a certain point in the level:
ru: <a cbot|array>Массив</a> категорий объектов, которые необходимо обнаружить. Например, если вы ищете только Погрузчиков, начиная с определенной точки уровня:

source: position: <code><a cbot|point>point</a></code> (default value: <code><a cbot|this>this</a>.<a cbot|object>position</a></code>)
ru: position: <code><a cbot|point>point</a></code> (значение по умолчанию: <code><a cbot|this>this</a>.<a cbot|object>position</a></code>)

source: Instruction <code>sin</code>
ru: Инструкция <code>sin</code>

source: Sine of the angle.
ru: Синус угла.

source: Instruction <code>sqrt</code>
ru: Инструкция <code>sqrt</code>

source: Non-negative number.
ru: Не отрицательное число.

source: Square root of the value.
ru: Квадратный корень значения.

source: Instructions <code>switch</code>, <code>case</code> and <code>default</code>
ru: Инструкции <code>switch</code>, <code>case</code> и <code>default</code>

source: With the instruction <code>switch() {}</code> you can execute a proper set of instructions (a case) basing on some value.
ru: С инструкцией <code>switch() {}</code> вы можете выполнить набор инструкций выбрав (case) на основании значения.

source: Note: the <a cbot|busy>busy</a> instruction might be much better to use in this scenario.
ru: Заметьте: в этом сценарии лучше использовать инструкцию <a cbot|busy>busy</a>.

source: See the following <a cbot|function>function</a>: the bot will be <a cbot|wait>waiting</a> a proper amount of time for a certain task to be completed:
ru: Смотри следующую <a cbot|function>функцию</a>: бот будет <a cbot|wait>ждать</a> нужное количество времени для выполнения определенной задачи:

source: public void WaitForTaskCompleted(object building) { int cat = building.category; <a cbot|if>if</a> (cat == Converter) wait(15); else if (cat == BotFactory) wait(15); else if (cat == PowerPlant) wait(12); else message("Undefined wait time", DisplayError); }
ru: public void WaitForTaskCompleted(object building) { int cat = building.category; <a cbot|if>if</a> (cat == Converter) wait(15); else if (cat == BotFactory) wait(15); else if (cat == PowerPlant) wait(12); else message("Неопределённое время ожидания", DisplayError); }

source: This function can be also written using the <code>switch() {}</code> instruction:
ru: Эту функцию также можно записать при помощи инструкции <code>switch() {}</code>:

source: public void WaitForTaskCompleted(object building) { switch (building.category) { case Converter: wait(15); break; case BotFactory: wait(15); break; case PowerPlant: wait(12); break; default: message("Undefined wait time", DisplayError); } }
ru: public void WaitForTaskCompleted(object building) { switch (building.category) { case Converter: wait(15); break; case BotFactory: wait(15); break; case PowerPlant: wait(12); break; default: message("Нелроеделённое время ожидания", DisplayError); } }

source: Which way to write this kind of choice structures, is a matter of taste.
ru: Каким образом написать такую структуру выбора - дело вкуса.

source: You can also make cases like this:
ru: Вы также можете сделать таким образом:

source: switch (building.category) { case Converter: case BotFactory: wait(15); break; case PowerPlant: wait(12); break; default: message("Undefined wait time", DisplayError); }
ru: switch (building.category) { case Converter: case BotFactory: wait(15); break; case PowerPlant: wait(12); break; default: message("Неопределённое время ожидания", DisplayError); }

source: <a object|convert>Converter</a> and <a object|factory>bot factory</a> have the same waiting time, so in order to not write the same instructions twice, we made multiple cases run the same code. In fact, all code after the highest case used will be executed if we do not <code><a cbot|break>break</a></code> it.
ru: У <a object|convert>Преобразователя</a> и <a object|factory>Фабрики Ботов</a> одинаковое время ожидания, поэтому, чтобы не писать одни и те же инструкции дважды, мы заставили несколько случаев запускать один и тот же код. Фактически, весь код после использованного верхнего регистра будет выполнен, если мы его не <code><a cbot|break>break</a></code>.

source: With this conditional structure you can execute <code>instructions1</code> or <code>instructions2</code> ... or <code>instructionsN</code> or <code>instructionsDefault</code> depending on the <code>value</code>.
ru: С условной структурой вы можете выполнить <code>instructions1</code> или <code>instructions2</code> ... или <code>instructionsN</code> или <code>instructionsDefault</code> в зависмости от <code>value</code>.

source: If the <code>value</code> is equal to <code>value1</code>, <code>instructions1</code> to <code>N</code> (including <code>instructionsDefault</code>) are executed. If the <code>value</code> is equal to <code>value2</code>, <code>instructions2</code> to <code>N</code> (including <code>instructionsDefault</code>) are executed. And so on. If the <code>value</code> is equal to <code>valueN</code>, <code>instructionsN</code> and <code>instructionsDefault</code> are executed. If the <code>value</code> is not equal to any value in the given cases, <code>instructionsDefault</code> are executed.
ru: Если <code>value</code> равно <code>value1</code>, <code>instructions1</code> до <code>N</code> (включая <code>instructionsDefault</code>) выполнены. Если <code>value</code> равно <code>value2</code>, <code>instructions2</code> до <code>N</code> (включая <code>instructionsDefault</code>) выполнены. И так далее. Если <code>value</code> равно <code>valueN</code>, <code>instructionsN</code> и <code>instructionsDefault</code> выполнены. Если <code>value</code> не равно никакому значению в данных случаях, <code>instructionsDefault</code> выполнено.

source: You can exit from the the <code>switch() {}</code> instruction using <code><a cbot|break>break</a></code>.
ru: Вы можете выйти из инструкции <code>switch() {}</code> используя <code><a cbot|break>break</a></code>.

source: Do not put a <a cbot|term>semicolon</a> at the end of the <code>switch ( ) { }</code> instruction.
ru: Не ставьте <a cbot|term>точку с запятой</a> в конце инструкции <code>switch ( ) { }</code>.

source: Instruction <code>takeoff</code>
ru: Инструкция <code>takeoff</code>

source: Takes off the spaceship.
ru: Взлёт Космического Корабля.

source: <a object|base>SpaceShip</a>
ru: <a object|base>Космический Корабль</a>

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <code>takeoff()</code>. <code>== 0 </code>Spaceship takes off <code>!= 0 </code>Spaceship could not take off (e.g. mission is not finished yet)
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <code>takeoff()</code> возвращает значение, отличное от нуля. <code>== 0 </code>Космический Корабль взлетает <code>!= 0 </code>Космический корабль не взлетает (например, миссия еще не завершена)

source: Instruction <code>tan</code>
ru: Инструкция <code>tan</code>

source: Angle in degrees (except multiples of 90).
ru: Угол в градусах (за исключением кратных 90)

source: Tangent of the angle.
ru: Тангенс угла.

source: Instruction <code>trunc</code>
ru: Инструкция <code>trunc</code>

source: Truncation is a method of approximating a decimal number by dropping all decimal places past a certain point without rounding. For positive numbers, it works like the <c/><a cbot|floor>floor();</a><n/> function, and for negative numbers, it works like the <c/><a cbot|ceil>ceil();</a><n/> function. It can be said that it rounds towards zero.
ru: Усечение - это метод приближения десятичного числа путем отбрасывания всех десятичных знаков после запятой без округления. Для положительных чисел оно работает как функция <c/><a cbot|floor>floor();</a><n/>, а для отрицательных чисел работает как <c/><a cbot|ceil>ceil();</a><n/> функция. Можно сказать, что оно округляется до нуля.

source: Truncated <code>value</code>. For example, <code>trunc(-2.5)</code> is <code>-2.00</code>.
ru: Усечённое <code>value</code>. Например, <code>trunc(-2.5)</code> - это <code>-2.00</code>.

source: In a program, categories are always displayed like that: <format const>category</format>. If a category isn't highlighted, it is misspelled. Caps and lower cases should be kept as is.
ru: В программе категории всегда отображаются следующим образом: <format const>category</format>. Если категория не выделена, она написана неправильно. Заглавные и строчные буквы следует сохранять как есть.

source: In a program, the name of a type is always displayed like that: <format type>type</format>. If the name of a type is not highlighted, this means that the name is misspelled. Type names are always written with lower case characters. Here is a list of the different types:
ru: В программе название типа всегда отображается так: <format type>type</format>. Если название типа не выделено, это означает, что название написано с ошибкой. Названия типов всегда пишутся строчными буквами. Вот список различных типов:

source: Instruction <code>produce</code>
ru: Инструкция <code>produce</code>

source: Immediately creates an <a cbot|category>object</a>.
ru: Немедленно создает <a cbot|category>объект</a>.

source: Orientation (angle) of the object.
ru: Направление (угол) объекта.

source: <a cbot|category>Category</a> of the object.
ru: <a cbot|category>Категория</a> объекта.

source: Energy level.
ru: Уровень энергии.

source: Return: <code><a cbot|void>void</a></code>
ru: Возвращает значение: <code><a cbot|void>void</a></code>

source: Nothing.
ru: Ничего.

source: Example usage
ru: Пример использования

source: It is used by <a object|mother>AlienQueen</a> to produce <a object|egg>AlienEggs</a>.
ru: Это используется <a object|mother>Королевой Пришельцев</a> чтобы производить <a object|egg>Яйца Пришельцев</a>.

source: Where object will be created. The second syntax creates the object at the current bot's position.
ru: Место где объект был создан. Второй синтаксис создает объект в текущей позиции бота.

source: Program for the object. Will have effect only for programmable objects like robots or aliens.
ru: Программа для объекта. Будет иметь эффект только для программируемых объектов таких как боты и враги.

source: Expressions are used for various calculations with many different variables, which return the desired result. What distinguishes them from standard instructions are operators, which are described below.
ru: Выражения используются для различных вычислений с множеством разных переменных, которые возвращают желаемый результат. От стандартных инструкций их отличают операторы, описание которых приводится ниже.

source: Binary operations
ru: Бинарные операции

source: Assuming that <code>a</code>, <code>b</code> can be values of declared and initialized variables of types <code>t1</code> and <code>t2</code>, the binary operations can be described as follows:
ru: Предполагая, что <code>a</code>, <code>b</code> могут быть значениями объявленных и инициализированных переменных типов <code>t1</code> и <code>t2</code>, двоичные операции можно описать следующим образом:

source: Where <code>r</code> is the result of the operation and <code>op</code> is a binary operator which works with values of types <code>t1</code> and <code>t2</code>.
ru: Где <code>r</code> - результат операции, а <code>op</code> - двоичный оператор, который работает со значениями типов <code>t1</code> и <code>t2</code>.

source: Order of operations
ru: Порядок операций

source: Let <code>a op1 b op2 c</code> be a legal expression, then the following rules apply:
ru: Пусть <code>a op1 b op2 c</code> будет допустимым выражением, тогда применяются следующие правила:

source: If <code>op1 == op2</code> or <code>op1</code> is as strong as <code>op2</code> or <code>op1</code> is stronger than <code>op2</code>, first calculate <code>a op1 b</code> and store its result in a temporary variable <code>r</code>, then calculate <code>r op2 c</code>, which is the final result of the expression.
ru: Если <code>op1 == op2</code> или <code>op1</code> такой же сильный, как <code>op2</code> или <code> op1</code> сильнее, чем <code>op2</code>, сначала вычислите <code>a op1 b</code> и сохраните его результат во временной переменной <code>r</code>, затем вычислите <code>r op2 c</code>, который является окончательным результат выражения.

source: If <code>op1</code> is weaker than <code>op2</code>, first calculate <code>b op2 c</code> and store its result in a temporary variable <code>r</code>, then calculate <code>a op1 r</code>, which is the final result of the expression.
ru: Если <code>op1</code> слабее, чем <code>op2</code>, сначала вычислите <code>b op2 c</code> и сохраните его результат во временной переменной <code>r</code>, затем вычислите <code>op1 r</code>, который является окончательным результатом выражения.

source: Note: an operation can be made stronger by surrounding it in brackets, so for example assuming that <code>op1</code> is weaker than <code>op2</code>, in an expression <code>(a op1 b) op2 c</code> the <code>a op1 b</code> operation will be executed first.
ru: Заметьте: операцию можно усилить, заключив ее в скобки, например, если предположить, что <code>op1</code> слабее, чем <code>op2</code>, в выражении <code>(a op1 b) op2 c</code> операция <code>a op1 b</code> будет выполнена первой.

source: Tip: always use brackets if you are not sure about the order of operations, do not try to remember how strong are each of the operators. Generally it should be fairly obvious.
ru: Совет: всегда используйте скобки, если вы не уверены в порядке выполнения операций, не пытайтесь вспомнить, насколько сильны каждый из операторов. Обычно это должно быть довольно очевидно.

source: Here is a complicated example, which uses arithemtic operations described below, showing how expressions are calculated: <c/>Assume a, b, c, d, x, y, z, e are all initialized variables of type float or int. Then the following expression should be calculated the following way: a * b + c - d / x % (y * z) - e = = r1 + c - d / x % (y * z) - e = , r1 = a * b = r2 - d / x % (y * z) - e = , r2 = r1 + c = r2 - r3 % (y * z) - e = , r3 = d / x = r2 - r3 % r4 - e = , r4 = y * z = r2 - r5 - e = , r5 = r3 % r4 = r6 - e = , r6 = r2 - r5 = r7 , r7 = r6 - e r7 is the final result of this expression.
ru: Вот сложный пример, в котором используются описанные ниже арифметические операции, показывающие, как вычисляются выражения: <c/> Предположим, что a, b, c, d, x, y, z, e - все инициализированные переменные типа float или int. Тогда следующее выражение следует вычислить следующим образом: a * b + c - d / x % (y * z) - e = = r1 + c - d / x % (y * z) - e = , r1 = a * b = r2 - d / x % (y * z) - e = , r2 = r1 + c = r2 - r3 % (y * z) - e = , r3 = d / x = r2 - r3 % r4 - e = , r4 = y * z = r2 - r5 - e = , r5 = r3 % r4 = r6 - e = , r6 = r2 - r5 = r7 , r7 = r6 - e r7 - конечный результат этого выражения.

source: Assignment operator
ru: Оператор присваивания

source: <code>=</code> is the assignment operator. It is used to store the result of an expression in a variable.
ru: <code>=</code> - оператор присваивания. Он используется для хранения результата выражения в переменной.

source: On the left side of this operator there must be so called l-value and on the right side - r-value. L-values are just <a cbot|var>variables</a><n/>, r-values are expressions or just usual values. This makes the assignment operator kind of special, because what is l-value is pretty restrictive (it cannot be an expression, constant and so on, only single variable). Also, the type of l-value must match the type of r-value (unless a conversion is possible, for example assigning a <code><a cbot|float>float</a></code> to <code><a cbot|int>int</a></code>).
ru: Слева от этого оператора должно быть так называемое l-значение, а справа - r-значение. L-значения - это просто <a cbot|var>переменные</a><n/>, r-значения - это выражения или просто обычные значения. Это делает оператор присваивания особенным, потому что то, что является l-значением, довольно ограничено (оно не может быть выражением, константой и т.д., только одной переменной). Кроме того, тип l-значения должен соответствовать типу r-значения (если преобразование невозможно, например, присвоение <code><a cbot|float>float</a></code> к <code><a cbot|int>int</a></code>).

source: This example is actually really confusing, but this property is actually useful, because it lets doing something like this:
ru: Этот пример действительно сбивает с толку, но это свойство действительно полезно, потому что позволяет делать что-то вроде этого:

source: Basic arithmetic operations
ru: Основные арифметические операции

source: Binary operators below are working with fundamental number types (<code><a cbot|int>int</a></code>, <code><a cbot|float>float</a></code>).
ru: Приведенные ниже двоичные операторы работают с основными числовыми типами (<code><a cbot|int>int</a></code>, <code><a cbot|float>float</a></code>).

source: List
ru: Список

source: <code>+</code> addition <code>-</code> subtraction <code>*</code> multiplication <code>/</code> division <code>%</code> remainder of the division (only for the type <code><a cbot|int>int</a></code>)
ru: <code>+</code> сложение <code>-</code> вычитание <code>*</code> умножение <code>/</code> деление <code>%</code> остаток от деления (только для типа <code><a cbot|int>int</a></code>)

source: Notes
ru: Заметки

source: The <code>*</code>, <code>/</code>, <code>%</code> are all stronger than <code>+</code> and <code>-</code>.
ru: Все <code>*</code>, <code>/</code>, <code>%</code> сильнее чем <code>+</code> и <code>-</code>.

source: The result <a cbot|type>type</a> is always <code><a cbot|float>float</a></code>. If <code>a</code> or <code>b</code> are of type <code><a cbot|int>int</a></code>, they are automatically converted to <code><a cbot|float>float</a></code>. Note: this means that results of intermediate calculations tends to be as precise as possible, the precision is lost only during converting the final (<code><a cbot|float>float</a></code>) result to <code><a cbot|int>int</a></code>, for example by the assignment <code>=</code> operator.
ru: Результатом <a cbot|type>типа</a> всегда является <code><a cbot|float>float</a></code>. Если <code>a</code> или <code>b</code> относятся к типу <code><a cbot|int>int</a></code>, они автоматически преобразуются в <code><a cbot|float>float</a></code>. Примечание: это означает, что результаты промежуточных вычислений имеют тенденцию быть максимально точными, точность теряется только во время преобразования окончательного (<code><a cbot|float>float</a></code>) результата в <code><a cbot|int>int</a></code>, например, с помощью оператора присваивания <code>=</code>.

source: Real life examples
ru: Примеры из реальной жизни

source: Compound assignment operators
ru: Составные операторы присваивания

source: Besides the <code>=</code> operator for variable assignment there are several compound-assignment operators.
ru: Помимо оператора <code>=</code> для присваивания переменной существует несколько операторов составного присваивания.

source: The compound-assignment operators combine the <code>=</code> assignment operator with another binary operator such as <code>+</code> or <code>-</code>. Compound-assignment operators perform the operation specified by the additional operator and then assign the result to the left operand. For example, a compound-assignment expression such as
ru: Операторы составного присваивания объединяют оператор присваивания <code>=</code> с другим двоичным оператором, таким как <code>+</code> или <code>-</code>. Операторы составного присваивания выполняют операцию, указанную дополнительным оператором, а затем присваивают результат левому операнду. Например, выражение присваивания соединения, такое как

source: String concatenation
ru: Конкатенация (соединение) строк

source: If at least one of the values used with the <code>+</code> operator is a <a cbot|string>string</a>, then the operation of concatenation is performed. The result of the operator is then a string, which is created by joining end-to-end the string and the other value. If the other value is not a string, then it is converted to string beforehand.
ru: Если хотя бы одно из значений, используемых с оператором <code>+</code>, является <a cbot|string>строкой</a>, то выполняется операция конкатенации. Результатом оператора является строка, которая создается путем сквозного соединения строки и другого значения. Если другое значение не является строкой, оно заранее преобразуется в строку.
