Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: Class members are <a cbot|public>public</a> by default, which means that they are accessible outside of the class definition. They can also be declared as <code><a cbot|private>private</a></code> or <code><a cbot|protected>protected</a></code>. Such members can only be accessed inside of the class definition.
ru: Члены класса по умолчанию являются <a cbot|public>public</a>, что означает, что они доступны вне определения класса. Их также можно объявить как <code><a cbot|private>private</a></code> или <code><a cbot|protected>protected</a></code>. К таким членам можно получить доступ только внутри определения класса.

source: Fields and methods can also be declared as <code><a cbot|static>static</a></code>. Methods can be additionaly declared as <code><a cbot|synchro>synchronized</a></code>.
ru: Поля и методы также можно объявить как <code><a cbot|static>static</a></code>. Методы могут быть дополнительно объявлены как <code><a cbot|synchro>synchronized</a></code>.

source: Another way of initiliazing fields is by defining a constructor which is a special method having the same name as the class. This method will be called automatically at <a cbot|new>creation</a> time of a class instance. Constructors can be <a cbot|function>overloaded</a>.
ru: Другой способ инициализации полей - определение конструктора, который представляет собой специальный метод с тем же названием, что и класс. Этот метод будет вызываться автоматически при <a cbot|new>создании</a> экземпляра класса. Конструкторы могут быть <a cbot|function>перегружены</a>.

source: <code><a cbot|public>public</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|protected>protected</a></code>, <code><a cbot|static>static</a></code>, <code><a cbot|synchro>synchronized</a></code>, <code><a cbot|new>new</a></code>, <code><a cbot|pointer>reference</a></code>, <code><a cbot|this>this</a></code>, <code><a cbot|super>super</a></code>, <code><a cbot|extends>extends</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|public>public</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|protected>protected</a></code>, <code><a cbot|static>static</a></code>, <code><a cbot|synchro>synchronized</a></code>, <code><a cbot|new>new</a></code>, <code><a cbot|pointer>reference</a></code>, <code><a cbot|this>this</a></code>, <code><a cbot|super>super</a></code>, <code><a cbot|extends>extends</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Keyword <code>protected</code>
ru: Ключевое слово <code>protected</code>

source: This is an access modifier for <a cbot|class>class</a> members. Protected class members can be accessed in a child class, but they can't be accessed outside of classes definitions being part of the same inheritance tree (see the <code><a cbot|extends>extends</a></code> keyword).
ru: Это модификатор доступа для членов <a cbot|class>class</a>. Доступ к защищенным членам класса можно получить в дочернем классе, но к ним нельзя получить доступ за пределами определений классов, являющихся частью того же дерева наследования (смотри ключевое слово <code><a cbot|extends>extends</a></code>).

source: public class Parent { protected int field = 0; } public class Child extends Parent { void Print() { message(field); } } extern void object::Test() { Child child(); child.Print(); // 0 //child.field = 1; // Error! }
ru: public class Parent { protected int field = 0; } public class Child extends Parent { void Print() { message(field); } } extern void object::Test() { Child child(); child.Print(); // 0 //child.field = 1; // Ошибка! }

source: This is an access modifier for <a cbot|class>class</a> members. Private members are not accessible outside of the class definition.
ru: Это модификатор доступа для членов <a cbot|class>class</a>. Закрытые члены недоступны вне определения класса.

source: <code><a cbot|class>class</a></code>, <code><a cbot|public>public</a></code>, <code><a cbot|protected>protected</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|public>public</a></code>, <code><a cbot|protected>protected</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: <code>public</code> is also an access modifier for <a cbot|class>class</a> members, which is the default one. Public members can be accessed from outside of the class definition.
ru: <code>public</code> также является модификатором доступа для членов <a cbot|class>class</a>, который используется по умолчанию. Доступ к открытым членам можно получить извне определения класса.

source: <code><a cbot|class>class</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|protected>protected</a></code>, <code><a cbot|function>functions</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|protected>protected</a></code>, <code><a cbot|function>functions</a></code> <a cbot|programming>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: <code><a cbot|class>class</a></code>, <code><a cbot|public>public</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|extends>extends</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|public>public</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|extends>extends</a></code> <a cbot|programming>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Keyword <code>super</code>
ru: Ключевое слово <code>super</code>

source: <code><a cbot|class>class</a></code>, <code><a cbot|this>this</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|this>this</a></code> <a cbot|programming>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: <code><a cbot|class>class</a></code>, <code><a cbot|super>super</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|super>super</a></code> <a cbot|programming>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Keyword <code>extends</code>
ru: Ключевое слово <code>extends</code>

source: Inherited Members
ru: Наследованные Методы

source: Only <code><a cbot|public>public</a></code> and <code><a cbot|protected>protected</a></code> members are inherited. <code><a cbot|private>private</a></code> members are directly inaccessible even for a child, although they can be accessed indirectly through inherited methods.
ru: Только <code><a cbot|public>public</a></code> и <code><a cbot|protected>protected</a></code> методы наследуются. <code><a cbot|private>private</a></code> члены напрямую недоступны даже для дочернего, хотя они могут быть доступны косвенно через наследованные методы.

source: Constructors and destructors are not inherited, however, they can be overriden.
ru: Конструкторы и деструкторы не наследуются, однако их можно переопределить.

source: Method Overriding
ru: Переопределение Метода

source: Inherited methods can be overriden (redefined) in the child class definition. Example:
ru: Наследованные методы могут быть переопределены в дочернее определение класса. Например:

source: public class Parent { void foo() { message("foo"); } } public class Child extends Parent { void foo() { message("bar"); } } extern void object::Test() { Child child(); child.foo(); // Will show "bar" }
ru: public class Parent { void foo() { message("foo"); } } public class Child extends Parent { void foo() { message("bar"); } } extern void object::Test() { Child child(); child.foo(); // Показать "bar" }

source: Polymorphism
ru: Полиморфизм

source: <code><a cbot|pointer>Reference</a></code> of type Parent can point to an object of type Child. However, such a pointer can't be used to access a child member. In order to access a child member, it must be assured that the Parent reference really points to a Child object. If that's the case, it can be safely copied to a pointer of type Child, which has access to the child members.
ru: <code><a cbot|pointer>Ссылка</a></code> типа Parent может указывать на объект типа Child. Однако такой указатель нельзя использовать для доступа к дочернему члену. Чтобы получить доступ к дочернему элементу, необходимо убедиться, что ссылка Parent действительно указывает на объект Child. В этом случае его можно безопасно скопировать в указатель типа Child, у которого есть доступ к дочерним членам.

source: public class Parent { void foo() { message("foo"); } } public class Child extends Parent { void foo() { message("bar"); } void bar() { message("foo bar"); } } extern void object::Test() { Parent people[2]; people[0] = new Parent(); people[1] = new Child(); for (int i = 0; i < 2; ++i) { people[i].foo(); } //people[1].bar(); // Error Child child = people[1]; child.bar(); // OK }
ru: public class Parent { void foo() { message("foo"); } } public class Child extends Parent { void foo() { message("bar"); } void bar() { message("foo bar"); } } extern void object::Test() { Parent people[2]; people[0] = new Parent(); people[1] = new Child(); for (int i = 0; i < 2; ++i) { people[i].foo(); } //people[1].bar(); // Ошибка Child child = people[1]; child.bar(); // OK }

source: Multiple Inheritance
ru: Множественное Наследование

source: A child cannot have multiple parents, however, a parent can have many children.
ru: У дочернего не может быть нескольких родителей, однако родитель может иметь много дочерних.

source: <code><a cbot|class>class</a></code>, <code><a cbot|public>public</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|protected>protected</a></code>, <code><a cbot|new>new</a></code>, <code><a cbot|pointer>reference</a></code>, <code><a cbot|this>this</a></code>, <code><a cbot|super>super</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|public>public</a></code>, <code><a cbot|private>private</a></code>, <code><a cbot|protected>protected</a></code>, <code><a cbot|new>new</a></code>, <code><a cbot|pointer>reference</a></code>, <code><a cbot|this>this</a></code>, <code><a cbot|super>super</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: This keyword is similar to <code><a cbot|this>this</a></code>, however, it grants access to methods from the parent class (see the <code><a cbot|extends>extends</a></code> keyword), which is especially useful for method overriding.
ru: Это ключевое слов подобно <code><a cbot|this>this</a></code>, но, оно дает доступ к методам от родительского класса (смотри ключевое слово <code><a cbot|extends>extends</a></code>), это особенно полезно для перегрузки методов.

source: public class Parent { protected int field; void Parent() { field = 0; } void Print() { message("Parent's field: " + field); } } public class Child extends Parent { private int childsField; void Child() { super.Parent(); childsField = field + 1; } void Print() { super.Print(); message("Child's field: " + childsField); } } extern void object::Test() { Child child(); child.Print(); // Will show both 0 and 1 }
ru: public class Parent { protected int field; void Parent() { field = 0; } void Print() { message("Parent's field: " + field); } } public class Child extends Parent { private int childsField; void Child() { super.Parent(); childsField = field + 1; } void Print() { super.Print(); message("Child's field: " + childsField); } } extern void object::Test() { Child child(); child.Print(); // Будет отображаться как 0, так и 1 }

source: This keyword is used in a <code><a cbot|class>class</a></code> definition when we want the class to inherit members from another class. The class which is extended we usually call a parent or base, the extending class we call a child.
ru: Это ключевое слово используется в определении <code><a cbot|class>class</a></code> когда мы хотим чтобы класс наследовал члены от другого класса. Класс, который расширен, мы обычно называем родителем или базовым классом, а расширяющий класс мы называем дочерним.

source: public class Parent { void foo() { message("foo"); } } public class Child extends Parent { void bar() { message("bar"); } } extern void object::Test() { Child child(); child.foo(); // Will show "foo" child.bar(); // Will show "bar" }
ru: public class Parent { void foo() { message("foo"); } } public class Child extends Parent { void bar() { message("bar"); } } extern void object::Test() { Child child(); child.foo(); // Покажет "foo" child.bar(); // Покажет "bar" }

source: A parent's method can be called inside an overriden method by using the <code><a cbot|super>super</a></code> keyword.
ru: Родительский метод может быть вызван внутри перегруженного метода используя ключевое слово <code><a cbot|super>super</a></code>.

source: As shown in the previous example, the class members can be initialized in the class definition (<c/>int x = 3.33;<n/>).
ru: Как показано в предыдущем примере, члены класса могут быть инициализированы в определении класса (<c/>int x = 3.33;<n/>).

source: <code>"r"</code> mode: open for reading. <code>"w"</code> mode: open for writing. <code>"a"</code> mode: open for appending.
ru: <code>"r"</code> режим: открыть для чтения. <code>"w"</code> режим: открыть для записи. <code>"w"</code> режим: открыть для добавления.

source: <c/>openfile();<n/> opens an text file in the files/ folder. This is not a method of the <code><a cbot|file>file</a></code> class but openfile returns a <a cbot|pointer>reference</a> to a new instance of the file class. You must supply two parameters, the filename and the opening mode.
ru: <c/>openfile();<n/> открывает текстовый файл в файлах/папке. Это не метод класса <code><a cbot|file>file</a></code>, но openfile возвращает <a cbot|pointer>ссылку</a> на новый экземпляр класса файла. Вы должны указать два параметра: название файла и режим открытия.

source: <code>"r"</code> mode: open for reading. <code>"w"</code> mode: open for writing. <code>"w"</code> mode: open for appending.
ru: <code>"r"</code> режим: открыть для чтения. <code>"w"</code> режим: открыть для записи. <code>"w"</code> режим: открыть для добавления.

source: Nothing but a name can be changed in the main function. The keyword <code><a cbot|extern>extern</a></code> distinguishes the main function from others.
ru: В основной функции изменить нельзя ничего, кроме названия. Ключевое слово <code><a cbot|extern>extern</a></code> отличает основную функцию от других.

source: Public Functions
ru: Public Функции

source: Default Parameters
ru: Параметры по умолчанию

source: Last function parameters can have default values that can be omitted when calling.
ru: Параметры последней функции могут иметь значения по умолчанию, которые можно не указывать при вызове.

source: float Add(float a = 0.0, float b = 0.0) { return a + b; } // Somewhere in the main program... Add(); // Will return 0.0 Add(2.0); // Will return 2.0 Add(2.0, 3.0); // Will return 5.0 // ...
ru: float Add(float a = 0.0, float b = 0.0) { return a + b; } // Где-то в основной программе... Add(); // Возвращает 0.0 Add(2.0); // Возвращает 2.0 Add(2.0, 3.0); // Возвращает 5.0 // ...

source: Default Parameters and Overloading
ru: Параметры по умолчанию и Перегрузка

source: Functions with default parameters still can be overloaded, one must only ensure that function calls are not ambiguous. For example, consider the following code:
ru: Функции с параметрами по умолчанию все ещё могут быть перегружены, нужно только убедиться, что вызовы функций не являются неоднозначными. Например, рассмотрим следующий код:

source: float Add(float a = 0.0, float b = 0.0) { return a + b; } string Add(string a = "", string b = "") { return a + b; } // Somewhere in the main program... Add(); // Compilation error: ambiguous call Add(""); // Ok Add(0.0); // Ok // ...
ru: float Add(float a = 0.0, float b = 0.0) { return a + b; } string Add(string a = "", string b = "") { return a + b; } // Где-то в основной программе... Add(); // Ошибка компиляции: неоднозначный вызов Add(""); // Ok Add(0.0); // Ok // ...

source: Note that in the above example overloading causes the first default parameter to be useless as caller needs to pass it anyway in order to distinguish the two functions.
ru: Заметьте, что в приведенном выше примере перегрузка приводит к тому, что первый параметр по умолчанию становится бесполезным, поскольку вызывающей стороне необходимо передать его в любом случае, чтобы различать две функции.

source: <button 192/> <code><a object|botbr>WheeledBuilder</a> </code>Wheeled Builder <button 193/> <code><a object|botbc>TrackedBuilder</a> </code>Tracked Builder <button 194/> <code><a object|botbj>WingedBuilder</a> </code>Winged Builder <button 195/> <code><a object|botbs>LeggedBuilder</a> </code>Legged Builder
ru: <button 192/> <code><a object|botbr>WheeledBuilder</a> </code>Строитель Колёсный <button 193/> <code><a object|botbc>TrackedBuilder</a> </code>Строитель Гусеничный <button 194/> <code><a object|botbj>WingedBuilder</a> </code>Строитель Крылатый <button 195/> <code><a object|botbs>LeggedBuilder</a> </code>Строитель Лапчатый
