Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: Type of the message, that determines the background color.
ru: Тип сообщения, определяющий цвет фона.

source: In fact, a variable is made up of three parts:
ru: Фактически переменная состоит из трех частей:

source: The <a cbot|type>type</a> determines what kind of information the variable can contain. According to the type, a variable can contain a whole number, a real number, a string, the coordinates of a point, information about an object, etc. Here is a list of the most common variable types:
ru: <a cbot|type>Тип</a> определяет какой вид информации может содержать переменная. В зависимости от типа переменная может содержать целое число, дробное число, строку, координаты точки, информацию об объекте и т.д. Вот список наиболее часто используемых типов переменных:

source: The most frequent use of <code>while</code> consists in repeating a set of instructions again and again. In order to achieve this, write <code>while (true) {}</code> and put the instructions to be repeated in braces <code>{}</code>. As an example, here is a program that repeats again and again the following actions:
ru: Наиболее часто <code>while</code> используется для того, чтобы снова и снова повторять набор инструкций. Для того, чтобы добиться этого, напишите <code>while (true) {}</code> и впишите инструкции, которые нужно повторять, в скобки <code>{}</code>. Как пример здесь представлена программа, которая снова и снова повторяет следующие действия:

source: Instruction <code>acos</code>
ru: Инструкция <code>acos</code>

source: Number between -1 and 1 (including both).
ru: Число между -1 и 1 (включая эти числа).

source: Arcus cosine (in degrees) of the value.
ru: Арккосинус (в градусах) от значения.

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|expr>expressions</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|expr>выражения</a>.

source: This instruction sets the vertical and the horizontal angle of the cannon. The following robots are equipped with a cannon:
ru: Эта инструкция устанавливает вертикальный и горизонтальный угол орудия. Орудием оснащены следующие боты:

source: When controlling the robot through programming, the gun can be also turned left or right by turning the whole robot with the instruction <code><a cbot|turn>turn</a></code>.
ru: При управлении ботом программно орудие можно также повернуть влево или вправо, повернув всего бота с помощью инструкции <code><a cbot|turn>turn</a></code>.

source: x: <code><a cbot|float>float</a></code> (default value: <code>0</code>)
ru: x: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>0</code>)

source: Angle in degrees of the gun relative to the robot. A positive value orients the gun to the right. The angle must range from <code>-40</code> to <code>+40</code> degrees for all shooters.
ru: Угол орудия по отношению к боту в градусах. Положительное значение направляет орудие направо. Угол должен быть в диапазоне от <code>-40</code> до <code>+40</code> градусов для всех Стрелков.

source: Instruction <code>asin</code>
ru: Инструкция <code>asin</code>

source: Arcus sine (in degrees) of the value.
ru: Арксинус (в градусах) от значения.

source: Instruction <code>atan</code>
ru: Инструкция <code>atan</code>

source: Number.
ru: Число.

source: Arcus tangent (in degrees) of the value.
ru: Арктангенс (в градусах) от значения.

source: Instruction <code>atan2</code>
ru: Инструкция <code>atan2</code>

source: The purpose of using two arguments instead of one is to gather information on the signs of the inputs in order to return the appropriate quadrant of the computed angle, which is not possible for the single-argument <c/><a cbot|atan>atan();</a><n/> function. For example, consider a point <code>(-1, -1)</code>: <c/>atan(-1/-1);<n/> is <code>45.00</code> degrees, whereas <c/>atan2(-1, -1);<n/> is <code>-135.00</code> degrees, which is obviously more correct in this case.
ru: Цель использования двух аргументов вместо одного - собрать информацию о знаках входных данных, чтобы вернуть соответствующий квадрант вычисленного угла, что невозможно с одним аргументом для функции <c/><a cbot|atan>atan();</a><n/>. Например, рассмотрим точку <code>(-1,-1)</code>:<c/>atan(-1/-1);<n/> составляет <code>45.00</code> градусов, тогда как <c/>atan2(-1,-1);<n/> равно <code>-135.00</code> градусов, что, очевидно, более правильно в данном случае.

source: Arcus tangent (in degrees) of <code>y/x</code>.
ru: Арктангенс (в градусах) от <code>y/x</code>.

source: Instruction <code>build</code>
ru: Инструкция <code>build</code>

source: The instruction <c/>build();<n/> instructs the bot to build a building of the given <a cbot|category>category</a>. Currently works for <a object|botgc>Grabbers</a>, <a object|human>Me</a> and <a object|tech>Tech</a>.
ru: Инструкция <c/>build();<n/> приказывает боту построить здание данной <a cbot|category>категории</a>. В настоящее время работает для <a object|botgc>Погрузчиков</a>, <a object|human>Вас</a> и <a object|tech>Техно</a>.

source: This command is mostly useful in an attempt to build a fully automatised base, where an <a object|human>astronaut</a> does not need to do anything except starting a program and watching bots working. What is more, it makes beating the game by using only programming a possible task (however, it is a challenge rather for experienced gamers, who beat the whole game at least once).
ru: Эта команда в основном полезна при попытке построить полностью автоматизированную базу, где <a object|human>Космонавту</a> не нужно ничего делать кроме как щёлкать е.. семечки, кроме запуска программы и наблюдения за работой ботов. Более того, это делает возможной задачей пройти игру, используя только программирование (однако это вызов, скорее, для опытных игроков, которые хотя бы раз прошли всю игру /или знают толк в программировании/).

source: Here is an example of a program that looks for the nearest <a object|titan>titanium cube</a>, goes to the position and builds a <a object|factory>bot factory</a>.
ru: Вот пример программы, которая ищет ближайший <a object|titan>Титан</a>, переходит к позиции и строит <a object|factory>Фабрику Ботов</a>.

source: Tells the robot to build a building using a titanium cube placed on a flat ground nearby.
ru: Приказывает боту построить здание из Титана, расположенного на ровной поверхности поблизости.

source: <a cbot|category>Category</a> of a building.
ru: <a cbot|category>Категория</a> зданий.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <code>build()</code>. <code>== 0 </code>Successfully built <code>!= 0 </code>Impossible to build (for example, the nearest titanium cube is too far away or the specified building is not available in the mission)
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <code>build()</code> возвращает значение, отличное от нуля. <code>== 0 </code>Успешно построено <code>!= 0 </code>Невозможно построить (например, ближайший Титан слишком далеко или указанное здание недоступно в миссии)

source: <a cbot|canbuild>canbuild</a>, <a cbot|buildingenabled>buildingenabled</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|canbuild>canbuild</a>, <a cbot|buildingenabled>buildingenabled</a>, <a cbot|programming>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>buildingenabled</code>
ru: Инструкция <code>buildingenabled</code>

source: The instruction <c/>buildingenabled();<n/> lets you know if a building of the given <a cbot|category>category</a> can be built in the level.
ru: Инструкция <c/>buildingenabled();<n/> позволяет узнать, допустимо ли здание данной <a cbot|category>категории</a> построить на этом уровне.

source: It is similar to the <c/><a cbot|canbuild>canbuild();</a><n/> instruction. However, it does not check if a required research has been done.
ru: Это похоже на инструкцию <c/><a cbot|canbuild>canbuild();</a><n/>. Однако она не проверяет, было ли проведено необходимое исследование.

source: Return value: <code><a cbot|bool>bool</a></code>
ru: Возвращает значение: <code><a cbot|bool>bool</a></code>

source: <code>true</code> if the building can be built in the level even if required research has not been done, <code>false</code> otherwise.
ru: <code>true</code> если здание может быть построено на уровне даже если исследование не было сделано, <code>false</code> в противном случае.

source: <a cbot|build>build</a>, <a cbot|canbuild>canbuild</a>, <a object|research>ResearchCenter</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|build>build</a>, <a cbot|canbuild>canbuild</a>, <a object|research>Центр Исследований</a>, <a cbot>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>busy</code>
ru: Инструкция <code>busy</code>

source: Checks if the object is busy.
ru: Проверяет, занят ли объект.

source: <a cbot|object>object</a>
ru: <a cbot|object>объект</a>

source: Any building which can take some action (e.g. <a cbot|convert>Converter</a>).
ru: Любое здание, которое может выполнять какие-либо действия (например, <a cbot|convert>Преобразователь</a>).

source: <code><format const>true</format></code> if the object is doing something (e.g. converting) <code><format const>false</format></code> if the object is not doing anything
ru: <code><format const>true</format></code> если объект что-то делает (например, преобразует) <code><format const>false</format></code> если объект ничего не делает

source: Instruction <code>canbuild</code>
ru: Инструкция <code>canbuild</code>

source: The instruction <c/>canbuild();<n/> lets you know if <a object|botgc>Grabbers</a>, <a object|human>Me</a> or <a object|human>Tech</a> can build a building of the given <a cbot|category>category</a>.
ru: Инструкция <c/>canbuild();<n/> позволяет узнать если <a object|botgc>Погрузчики</a>, <a object|human>Вы</a> или <a object|human>Техно</a> можете построить здание данной <a cbot|category>категории</a>.

source: It helps to prevent errors in programs using the <c/><a cbot|build>build();</a><n/> instruction. Here is an example:
ru: Это помогает предотвратить ошибки в программах с помощью инструкции <c/><a cbot|build>build();</a><n/>. Например:

source: <code>true</code> if the building can be built, <code>false</code> otherwise.
ru: <code>true</code> если здание может быть построено, <code>false</code> в противном случае.

source: <a cbot|build>build</a>, <a cbot|buildingenabled>buildingenabled</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|build>build</a>, <a cbot|buildingenabled>buildingenabled</a>, <a cbot|programming>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>canresearch</code>
ru: Инструкция <code>canresearch</code>

source: Checks if the <a cbot|researches>research</a> can be done in the level.
ru: Проверяет, можно ли выполнить <a cbot|researches>исследование</a> на уровне.

source: <a cbot|researches>Research name</a>.
ru: <a cbot|researches>Исследование</a>.

source: <format const>true</format> if the research can be done (even if it is already done, to check that, use the <a cbot|researched>researched</a> instruction) <format const>false</format> if the research cannot be done
ru: <format const>true</format>если исследование можно провести (даже если оно уже выполнено, чтобы проверить это, воспользуйтесь инструкцией <a cbot|researched>researched</a>) <format const>false</format> если исследование не может быть выполнено

source: <a cbot|researches>Research names</a>, <a cbot|research>research</a>, <a cbot|researched>researched</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|researches>Исследование</a>, <a cbot|research>research</a>, <a cbot|researched>researched</a>, <a cbot>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Below are the different categories available:
ru: Ниже представлены доступные категории:

source: Buildings:
ru: Здания:

source: Portable Objects:
ru: Переносные объекты:

source: Robots:
ru: Боты:

source: Enemies:
ru: Враги:

source: Miscellaneous:
ru: Разное:

source: Flags and Other Indicators:
ru: Флаги и Другие Индикаторы:

source: Instruction <code>ceil</code>
ru: Иинструкция <code>ceil</code>

source: Rounds up a number.
ru: Округляет число.

source: Ceiling of the value, i.e. the smallest integer not less than <code>value</code>. For example, <code>ceil(2.1)</code> is <code>3.0</code>.
ru: Верхний предел значения, т.е. наименьшее целое число не меньше <code>value</code>. Например, <code>ceil(2.1)</code> - это <code>3.0</code>.

source: <a cbot|round>round</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|expr>expressions</a>.
ru: <a cbot|round>round</a>, <a cbot>программирование</a>, <a cbot|type>типы</a> и <a cbot|expr>выражения</a>.

source: Value <code>Colors</code>
ru: Значение <code>Colors</code>

source: Color names are used to define a specific color to use. They can be passed to functions like <a cbot|pendown>pendown</a> or <a cbot|pencolor>pencolor</a>.
ru: Названия цветов используются для определения конкретного цвета, который будет применён. Их можно передать таким функциям, как <a cbot|pendown>pendown</a> или <a cbot|pencolor>pencolor</a>.

source: In a program, colors are always displayed on a <format const>red background</format>. If a color isn't highlighted in red, it is misspelled. Caps and lower cases should be kept as is.
ru: В программе цвета всегда отображаются на <format const>красном фоне</format>. Если цвет не выделен красным, он написан с ошибкой. Заглавные и строчные буквы следует сохранять как есть.

source: Below are the different colors available:
ru: Ниже представлены доступные цвета:

source: You can also draw colored symbols:
ru: Также можно рисовать цветные символы:

source: Instruction <code>cos</code>
ru: Инструкция <code>cos</code>

source: Angle in degrees.
ru: Угол в градусах.

source: Cosine of the angle.
ru: Косинус угла.

source: Instruction <code>destroy</code>
ru: Инструкция <code>destroy</code>

source: Destroys an object.
ru: Разрушает объект.

source: <a object|destroy>Destroyer</a>.
ru: <a object|destroy>Разрушитель</a>.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <code>destroy()</code>. <code>== 0 </code>The operation of destroying of an object was started <code>!= 0 </code>The instruction could not be done (e.g. nothing to destroy)
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <code>destroy()</code> возвращает значение, отличное от нуля. <code>== 0 </code>Операция разрушения объекта началась <code>!= 0 </code>Невозможно выполнить (например, нечего разрушать)

source: Instruction <code>detect</code>
ru: Инструкция <code>detect</code>

source: With the instruction <c/>detect();<n/>, you can look for objects like <a object|mother>enemies</a>, bots, buildings or raw materials, which are in front of the bot. It is a simpler version of <c/><a cbot|radar>radar</a>();<n/>.
ru: С помощью инструкции <c/>detect();<n/> Вы можете искать объекты, такие как <a object|mother>враги</a>, боты, здания или сырье, которые находятся перед ботом. Это более простая версия <c/><a cbot|radar>radar</a>();<n/>.

source: Detects the nearest object of the specified <a cbot|category>category</a> being in front of the bot. It is similar to the following instruction:
ru: Обнаруживает ближайший объект указанной <a cbot|category>категории</a>, находящийся перед ботом. Это похоже на следующую инструкцию:

source: <a cbot|category>Category</a> of the objects that should be detected. For example, when you are looking for an ant, write <code>radar(AlienAnt)</code>.
ru: <a cbot|category>Категория</a> объектов, которые необходимо обнаружить. Например, если вы ищете муравья, напишите <code>radar(AlienAnt)</code>.

source: <a cbot|array>Array</a> of categories of the objects that should be detected. For example, when you are looking only for grabbers:<c/>
ru: <a cbot|array>Массив</a> категорий объектов, которые необходимо обнаружить. Например, если вы ищете только Погрузчиков:<c/>

source: Keyword <format const>Any</format> if you are looking for any object (including even plants and so on).
ru: Ключевое слово <format const>Any</format>, если вы ищете какой-либо объект (включая даже растения и т.д.).

source: <format const>true</format> if the object was found <format const>false</format> if the object was not found
ru: <format const>true</format> если объект найден <format const>false</format> если объект не найден

source: Instruction <code>factory</code>
ru: Инструкция <code>factory</code>

source: Starts a construction of a bot of the given <a cbot|category>category</a> and runs the specified program on it after the construction is finished.
ru: Запускает создание бота данной <a cbot|category>категории</a> и запускает на нем указанную программу после завершения построения.

source: <a object|factory>BotFactory</a>
ru: <a object|factory>Фабрика Ботов</a>

source: <a cbot|category>Category</a> of the robot to construct.
ru: <a cbot|category>Категория</a> создаваемого бота.

source: program: <code><a cbot|string>string</a></code> (default value: <code>""</code>)
ru: program: <code><a cbot|string>string</a></code> (значение по умолчанию: <code>""</code>)

source: Program that will be run on the bot after factory finishes the construction. This can be either a <a cbot|public>public</a> <a cbot|function>function</a>, a <a cbot|file>filename</a> or just a raw source code.
ru: Программа, которая будет запущена на боте после завершения строительства Фабрики. Это может быть либо <a cbot|public>public</a> <a cbot|function>функция</a>, либо <a cbot|file>название файла</a>, или просто исходный код.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <code>factory()</code>. <code>== 0 </code>The construction successfully started <code>!= 0 </code>The construction could not be started (e.g. no <a object|titan>Titanium</a> in the factory, the bot is not researched)
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <code>factory()</code> возвращает значение, отличное от нуля. <code>== 0 </code>Строительство успешно началось <code>!= 0 </code>Строительство не может быть начато (например, на фабрике нет <a object|titan>Титана</a>, бот не исследован)

source: <a cbot|researched>researched</a>, <a cbot|>wait</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|researched>researched</a>, <a cbot|>wait</a>, <a cbot|programming>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>flatspace</code>
ru: Инструкция <code>flatspace</code>

source: Determines the position of the nearest free space with at least <code>flatmin</code> of flat ground around a given position. Works similar to <c/><a cbot|space>space();</a><n/>. Useful for finding a place for a <a cbot|category>building</a>.
ru: Определяет положение ближайшего свободного пространства с не менее <code>flatmin</code> ровной поверхности вокруг заданной позиции. Работает аналогично <c/><a cbot|space>space();</a><n/>. Полезно для поиска места для <a cbot|category>здания</a>.

source: Minimum radius of flat ground around the desired position.
ru: Минимальный радиус ровной поверхности вокруг желаемой позиции.

source: Instruction <code>floor</code>
ru: Инструкция <code>floor</code>

source: Rounds down a number.
ru: Округляет число в меньшую сторону.

source: Floor of the value, i.e. the largest integer not greater than <code>value</code>. For example, <code>floor(2.9)</code> is <code>2.00</code>.
ru: Нижний предел значения, то есть наибольшее целое число, не превышающее <code>value</code>. Например, <code>floor(2.9)</code> - это <code>2.00</code>.

source: Example: count from 1 to 4 <c/><s/><c/>for ( i = 1 ; i <= 4 ; i++ )
ru: Например: счёт от 1 до 4 <c/><s/><c/>for ( i = 1 ; i <= 4 ; i++ )

source: Function, simply put, is an instruction created by you.
ru: Проще говоря, функция - это созданная вами инструкция.

source: Main function
ru: Функция main

source: You probably already know how to create a function. Every program in CBOT must have a main function, which looks like this:
ru: Вы, наверное, уже знаете, как создать функцию. Каждая программа в CBOT должна иметь основную функцию, которая выглядит так:

source: extern void object::ProgramName() { // instructions }
ru: extern void object::ProgramName() { // инструкции }

source: With functions you can divide your program into several parts. Each of them will execute a specific task. For example, see the following program:
ru: С помощью функций вы можете разделить вашу программу на несколько частей. Каждая из них выполняет определенную задачу. Например, смотри следующую программу:

source: <code><a cbot|send>send</a></code> and <code><a cbot|wait>wait</a></code> are repeated several times. So it would be a good thing if we created a function that executes these two instructions:
ru: <code><a cbot|send>send</a></code> и <code><a cbot|wait>wait</a></code> повторяются несколько раз. Поэтому было бы хорошо, если бы мы создали функцию, выполняющую эти две инструкции:

source: Now the program is much easier to read. It is a good practice to split the program into several functions with self-describing names.
ru: Теперь программу читать стало намного проще. Рекомендуется разделить программу на несколько функций с само-описывающимися названиями.

source: Syntax
ru: Синтаксис

source: Result <a cbot|type>type</a> should be <a cbot/void>void</a> if the function does not give any. Body is just a set of instructions. Function name must be created with the exact same rules applied to <a cbot|var>variables</a>.
ru: Результат <a cbot|type>type</a> должен иметь значение <a cbot/void>void</a>, если функция ничего не дает. Тело - это просто набор инструкций. Название функции должно быть создано с теми же правилами, которые применяются к <a cbot|var>переменным</a>.

source: Parameters
ru: Параметры

source: A function can have parameters:
ru: Функция может иметь параметры:
