Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: string s = "a" + "bc"; // returns "abc" string s = 1 + "bc"; // returns "1bc" string s = 2.5 + "bc"; // returns "2.5bc" string s = "a" + true; // returns "atrue"
ru: string s = "a" + "bc"; // возвращает "abc" string s = 1 + "bc"; // возвращает "1bc" string s = 2.5 + "bc"; // возвращает "2.5bc" string s = "a" + true; // возвращает "atrue"

source: Tip: the properties of the concatenation <code>+</code> operator is useful with the <a cbot|message>message();</a> function, because it does not work with other types than string. An empty string can be used together with a value in order to create a string, which actually can be passed to the <a cbot|message>message();</a> function:
ru: Совет: свойства оператора конкатенации <code>+</code> полезны с функцией <a cbot|message>message();</a>, потому что не работает с другими типами, кроме строки. Пустая строка может использоваться вместе со значением для создания строки, которая фактически может быть передана в функцию <a cbot|message>message();</a>:

source: Prefix and postfix increment- and decrement operators
ru: Префиксные и постфиксные операторы увеличения и уменьшения

source: For example to increment the variable <code>a</code> you can write
ru: Например, чтобы увеличить переменную <code>a</code>, вы можете написать

source: instead of
ru: вместо

source: The result of the operation <code>a++</code> is the value of the variable <code>a</code> *before* the increment. If you use the prefix operator <code>++a</code> the result of the operation is the value of the variable <code>a</code> *after* the increment. The same holds for the <code>--</code> decrement operator.
ru: Результатом операции <code>a++</code> является значение переменной <code>a</code> *перед* приращением. Если вы используете префиксный оператор <code>++a </code>, результатом операции будет значение переменной <code>a</code> *после* приращения. То же самое и с оператором декремента <code>-</code>.

source: Specifically speaking, an expression is an ordered series of operations which yield a result. Operations consist of operators, which are special <a cbot|function>functions</a> <code>T f(t1 x1, t2 x2, ..., tn xn)</code>, where <code>xi</code> is a value of type <code>ti</code>, and <code>T</code> is the result type. For example, <code>float +(float a, float b)</code> returns a sum of values <code>a</code> and <code>b</code>. Note: Operators are a part of the CBOT language and they cannot be defined in program. Also, the operators cannot be used as usual <a cbot|function>functions</a>, they need to be written using a special notation depending on the operator, for example <code>a+b</code>.
ru: В частности, выражение - это упорядоченная серия операций, которые приводят к результату. Операции состоят из операторов, которые являются специальными <a cbot|function>функциями</a> <code>T f(t1 x1, t2 x2, ..., tn xn)</code>, где <code>xi</code> - это значение типа <code>ti</code>, а <code>T</code> - это тип результата. Например, <code>float +(float a, float b)</code> возвращает сумму значений <code>a</code> и <code>b</code>. Заметьте: Операторы являются частью языка CBOT и не могут быть определены в программе. Кроме того, операторы нельзя использовать как обычные <a cbot|function>функции</a>, их нужно записать с использованием специальной записи в зависимости от оператора, например, <code>a+b</code>.

source: In nearly all operations, <a cbot>constants</a>, <a cbot|var>variables</a>, <a cbot|function>functions</a> returning non-<a cbot|void>void</a> type and also other operations can be used as values.
ru: Почти во всех операциях <a cbot>constants</a>, <a cbot|var>переменные</a>, <a cbot|function>функции</a>, возвращают не <a cbot|void>void</a> тип, а также другие операции могут использоваться как значения.

source: Note: it may be not obvious at first, but notice that <code>=</code> is an *operator* not an instruction. This mean that it can be used in the middle of an other expression! The result of <code>=</code> is the value which was assigned to the l-value - the result of the expression on the right. Example:
ru: Заметьте: сначала это может быть не очевидно, но обратите внимание, что <code>=</code> - это *оператора*, а не инструкция. Это означает, что его можно использовать в другом выражении! Результат <code>=</code> - это значение, которое было присвоено l-значению - результат выражения справа. Например:

source: int i = 12 + 3; // i == 15 int i = 2 - 5; // i == -3 float f = 3.01 * 10; // f == 30.1 int i = 5 / 3; // i == 1 (automatic conversion to int) float f = 5 / 3; // f == 1.67 float f = 5 / 0; // returns an error (division by zero) int i = 13 % 5; // i == 3 int i = -8 % 3; // i == -2 float f = sin(90) * i; // f == -2.0
ru: int i = 12 + 3; // i == 15 int i = 2 - 5; // i == -3 float f = 3.01 * 10; // f == 30.1 int i = 5 / 3; // i == 1 (автоматически преобразуется в int) float f = 5 / 3; // f == 1.67 float f = 5 / 0; // вернет ошибку (деление на ноль) int i = 13 % 5; // i == 3 int i = -8 % 3; // i == -2 float f = sin(90) * i; // f == -2.0

source: float pi = 3.14; // message(pi); // does not work message(""+pi);
ru: float pi = 3.14; // message(pi); // не работает message(""+pi);

source: a = 2; b = a++; // now b contains 2 and a contains 3
ru: a = 2; b = a++; // теперь b содержит 2 и a содержит 3

source: a = 2; b = ++a; // now b contains 3 and a contains 3
ru: a = 2; b = ++a; // теперь b содержит 3 и a содержит 3

source: Logical operators
ru: Логические операторы

source: Logical operators work with values of type <a cbot|bool>bool</a> and they always return a <a cbot|bool>bool</a>. They are mainly used in <a cbot|cond>conditions</a>.
ru: Логические операторы работают со значениями типа <a cbot|bool>bool</a> и всегда возвращают <a cbot|bool>bool</a>. В основном они используются в <a cbot|cond>условиях</a>.

source: Ternary operator
ru: Тернарный оператор

source: The ternary operator is nothing more than a syntax sugar. It is also known as "inline if". It might be confusing at first, because its syntax is a little more complicated than other operators. It can be described as follows: <code>(condition) ? (result when true) : (result when false)</code> Brackets are not needed.
ru: Тернарный оператор - это не что иное, как синтаксический сахар. Он также известен как "встроенный if". Сначала это может сбивать с толку, потому что его синтаксис немного сложнее, чем у других операторов. Его можно описать следующим образом: <code>(condition) ? (result when true) : (result when false)</code> Скобки не нужны.

source: Firstly, the condition is valued and then the first result is returned if the condition is true, otherwise the second result is returned.
ru: Сначала оценивается условие, а затем возвращается первый результат, если условие истинно, в противном случае возвращается второй результат.

source: Example
ru: Например

source: A condition is a special <a cbot|expr>expression</a> that returns a <a cbot|bool>boolean</a> value, that can only be either <code><a cbot|true>true</a></code> or <code><a cbot|false>false</a></code>. With a condition, you can choose f. ex. if the instructions in a <code><a cbot|while>while</a></code> loop must be repeated again, or if the instruction in a <code><a cbot|if>if</a></code> bloc must be executed.
ru: Условие - это специальное <a cbot|expr>выражение</a>, которое возвращает <a cbot|bool>логическое</a> значение, которое может быть только <code><a cbot|true>true</a></code> или <code><a cbot|false>false</a></code>. С условием вы можете выбирать т.е. если инструкции в цикле <code><a cbot|while>while</a></code> должны быть повторены снова, или если инструкции в блоке <code><a cbot|if>if</a></code> должны быть выполнены.

source: Comparison operators
ru: Операторы сравнения

source: Comparison operators work with values of type <a cbot|bool>float</a> and they always return a <a cbot|bool>bool</a>. They are mainly used in <a cbot|cond>conditions</a>.
ru: Операторы сравнения работают со значениями типа <a cbot|bool>float</a> и всегда возвращают <a cbot|bool>bool</a>. В основном они используются в <a cbot|cond>условиях</a>.

source: <code>!a </code>not <code>a</code> <code>a && b </code><code>a</code> and <code>b</code> <code>a || b </code><code>a</code> or <code>b</code>
ru: <code>!a </code>НЕ <code>a</code> <code>a && b </code><code>a</code> И <code>b</code> <code>a || b </code><code>a</code> ИЛИ <code>b</code>

source: <code>!false </code>returns true <code>true && false </code>returns false <code>true || false </code>returns true
ru: <code>!false </code>возвращает true <code>true && false </code>возвращает false <code>true || false </code>возвращает true

source: Bitwise operators
ru: Побитовые операторы

source: Bitwise operators are similar to the logical operator, because they are operating on bits (which can be only 0 or 1, conditions can have a value only of false or true). So in theory, they should be working with basically any type of variable, because each value in the computer must be stored as a sequence of bits.
ru: Побитовые операторы похожи на логические операторы, потому что они работают с битами (которые могут быть только 0 или 1, условия могут иметь значение только false или true). Таким образом, теоретически они должны работать практически с любыми типами переменных, потому что каждое значение в компьютере должно храниться как последовательность битов.

source: <code>a & b </code><code>a</code> AND <code>b</code> <code>a | b </code><code>a</code> OR <code>b</code> <code>a ^ b </code><code>a</code> XOR <code>b</code> <code>a >> b </code>shift bits of <code>a</code> to the right <code>b</code> times <code>a << b </code>shift bits of <code>a</code> to the left <code>b</code> times
ru: <code>a & b </code><code>a</code> AND <code>b</code> <code>a | b </code><code>a</code> OR <code>b</code> <code>a ^ b </code><code>a</code> XOR <code>b</code> <code>a >> b </code>сдвинуть биты <code>a</code> вправо <code>b</code> раз <code>a << b </code>сдвинуть биты <code>a</code> влево <code>b</code> раз

source: <code>2 & 1 </code>returns 0 <code>2 | 1 </code>returns 3 <code>2 ^ 2 </code>returns 0 <code>2 >> 1 </code>returns 1 <code>2 << 1 </code>returns 4
ru: <code>2 & 1 </code>возвращает 0 <code>2 | 1 </code>возвращает 3 <code>2 ^ 2 </code>возвращает 0 <code>2 >> 1 </code>возвращает 1 <code>2 << 1 </code>возвращает 4

source: int [ ] a; // an array of int int a [12]; // an array of int limited to 12 elements string s[3]; // an array of 3 strings float xy[][]; // a 2 dimensionnal array of floats
ru: int [ ] a; // масств int int a [12]; // масств int ограничен в 12 элементов string s[3]; // масств в 3 строки float xy[][]; // 2-ух мерный массив floats

source: Initialization syntax
ru: Синтаксис инициализации

source: You can initialize a new array using the following syntax:
ru: Вы можете инициализировать новый массив, используя следующий синтаксис:

source: With the instruction <c/>radar();<n/>, you can look for objects like <a object|mother>enemies</a>, bots, buildings or raw materials.
ru: С помощью инструкции <c/>radar();<n/> вы можете искать такие объекты, как <a object|mother>враги</a>, боты, здания или сырье.

source: <c/><a cbot|radarall>radarall</a>();<n/>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <c/><a cbot|radarall>radarall</a>();<n/>, <a cbot>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>radarall</code>
ru: Инструкция <code>radarall</code>

source: <c/>radarall();<n/> is an enhancement of the <c/><a cbot|radar>radar</a>();<n/> function -- it detects all objects matching the given criteria.
ru: <c/>radarall();<n/> является расширением функции <c/><a cbot|radar>radar</a>();<n/> - обнаруживает все объекты, соответствующие заданным критериям.

source: Example<c/>
ru: Например<c/>

source: The function works generally the same as the <c/><a cbot|radar>radar</a>();<n/> function with the only difference being that it returns an <a cbot|array>array</a> of <a cbot|object>objects</a> instead of one object. If no object is found, <code><a cbot|null>null</a></code> is returned.
ru: Функция в целом работает так же, как функция <c/><a cbot|radar>radar</a>();<n/>, с той лишь разницей, что она возвращает <a cbot|array>массив</a> <a cbot|object>объектов</a> вместо одного объекта. Если объект не найден, возвращает <code><a cbot|null>null</a></code>.

source: The order of objects in the returned array is sorted by distance and depends on the <code>sens</code> parameter. The first object in the array is the object which would be returned by the <c/>radar();<n/> function called with the exactly same parameters.
ru: Порядок объектов в возвращаемом массиве сортируется по расстоянию и зависит от параметра <code>sens</code>. Первый объект в массиве - это объект, который будет возвращён функцией <c/>radar();<n/>, вызываемой с точно такими же параметрами.

source: <c/><a cbot|radar>radar</a>();<n/>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <c/><a cbot|radar>radar</a>();<n/>, <a cbot>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: This set of instructions is executed before the first loop instance.
ru: Этот набор инструкций выполняется в начале цикла.

source: This set of instructions is executed at the end of every instance of the loop.
ru: Этот набор инструкций выполняется в конце каждого экземпляра цикла.

source: Executing more instructions
ru: Выполнение дополнительных инструкций

source: In the <code>before</code> and <code>end</code> part of a <code>for</code> loop you can specify more than one instruction by using comma. Example:
ru: В частях <code>before</code> и <code>end</code> цикла <code>for</code> вы можете указать более одной инструкции, используя запятую. Например:

source: The output of the above code is <code>1 2 2 1</code>.
ru: Вышеприведенный код выводит <code>1 2 2 1</code>.

source: <code><a object|flag>BlueFlag</a> </code>Blue Flag <code><a object|flag>RedFlag</a> </code>Red Flag <code><a object|flag>GreenFlag</a> </code>Green Flag <code><a object|flag>YellowFlag</a> </code>Yellow Flag <code><a object|flag>VioletFlag</a> </code>Violet Flag <code><a object|waypoint>WayPoint</a> </code>Checkpoint <code><a object|target2>Target2</a> </code>Flying checkpoint <code><a object|enerspot>PowerSpot</a> </code>Underground Energy Deposit <code><a object|stonspot>TitaniumSpot</a> </code>Underground Titanium Deposit <code><a object|uranspot>UraniumSpot</a> </code>Underground Uranium Deposit
ru: <code><a object|flag>BlueFlag</a> </code>Флаг Синий <code><a object|flag>RedFlag</a> </code>Флаг Красный <code><a object|flag>GreenFlag</a> </code>Флаг Зелёный <code><a object|flag>YellowFlag</a> </code>Флаг Жёлтый <code><a object|flag>VioletFlag</a> </code>Флаг Фиолетовый <code><a object|waypoint>WayPoint</a> </code>Этап <code><a object|target2>Target2</a> </code>Цель <code><a object|enerspot>PowerSpot</a> </code>Подземное Месторождение Энергии <code><a object|stonspot>TitaniumSpot</a> </code>Подземное Месторождение Титана <code><a object|uranspot>UraniumSpot</a> </code>Подземное Месторождение Урана

source: <button 176/> <code><a object|huston>Houston</a> </code>Mission Control <button 171/> <code><a object|base>SpaceShip</a> </code>Spaceship <button 160/> <code><a object|factory>BotFactory</a> </code>Robot Factory <button 163/> <code><a object|research>ResearchCenter</a> </code>Research Center <button 168/> <code><a object|radar>RadarStation</a> </code>Radar <button 172/> <code><a object|exchange>ExchangePost</a> </code>Information Exchange Post <button 169/> <code><a object|repair>RepairCenter</a> </code>Repair Center <button 165/> <code><a object|tower>DefenseTower</a> </code>Defense Tower <button 166/> <code><a object|labo>AutoLab</a> </code>Organic Matter Analyzer <button 164/> <code><a object|station>PowerStation</a> </code>Power Station <button 167/> <code><a object|energy>PowerPlant</a> </code>Power Cell Factory <button 170/> <code><a object|nuclear>NuclearPlant</a> </code>Nuclear Plant <button 162/> <code><a object|convert>Converter</a> </code>Titanium Converter <button 161/> <code><a object|derrick>Derrick</a> </code>Derrick <button 174/> <code><a object|captor>PowerCaptor</a> </code>Parabolic Lightning Conductor <button 175/> <code><a object|safe>Vault</a> </code>Vault <code><a object|start>StartArea</a> </code>Starting Pad <code><a object|goal>GoalArea</a> </code>Finishing Pad <code><a object|target1>Target1</a> </code>Flying target <code><a object|nest>AlienNest</a> </code>Alien Nest
ru: <button 176/> <code><a object|huston>Houston</a> </code>Центр Управления <button 171/> <code><a object|base>SpaceShip</a> </code>Космический Корабль <button 160/> <code><a object|factory>BotFactory</a> </code>Фабрика Ботов <button 163/> <code><a object|research>ResearchCenter</a> </code>Центр Исследований <button 168/> <code><a object|radar>RadarStation</a> </code>Радар <button 172/> <code><a object|exchange>ExchangePost</a> </code>Пункт Обмена Информацией <button 169/> <code><a object|repair>RepairCenter</a> </code>Пункт Ремонта <button 165/> <code><a object|tower>DefenseTower</a> </code>Башня Обороны <button 166/> <code><a object|labo>AutoLab</a> </code>Лаборатория <button 164/> <code><a object|station>PowerStation</a> </code>Энергозаправка <button 167/> <code><a object|energy>PowerPlant</a> </code>Энергостанция Обычная <button 170/> <code><a object|nuclear>NuclearPlant</a> </code>Энергостанция Ядерная <button 162/> <code><a object|convert>Converter</a> </code>Преобразователь <button 161/> <code><a object|derrick>Derrick</a> </code>Вышка <button 174/> <code><a object|captor>PowerCaptor</a> </code>Молниеотвод <button 175/> <code><a object|safe>Vault</a> </code>Ангар <code><a object|start>StartArea</a> </code>Старт <code><a object|goal>GoalArea</a> </code>Финиш <code><a object|target1>Target1</a> </code>Цель <code><a object|nest>AlienNest</a> </code>Гнездо Пришельцев

source: Classes can be only <a cbot|public>public</a>. This means that they can be used by all bots in a mission.
ru: Классы могут быть <a cbot|public>public</a>. Это означает что они могут использоваться всеми ботами миссии.

source: Class Members
ru: Члены Класса

source: Class members are fields (<a cbot|var>variables</a>) and methods (<a cbot|function>functions</a>).
ru: Члены класса - это поля (<a cbot|var>переменные</a>) и методы (<a cbot|function>функции</a>).

source: For example, the following class dubbed <code>MyClass</code> contains 4 fields (<code>a</code>, <code>b</code>, <code>x</code> and <code>s</code>) and one method (<code>MyFunction</code>).
ru: Например, следующий класс <code>MyClass</code> включает 4 поля (<code>a</code>, <code>b</code>, <code>x</code> и <code>s</code>) и один метод (<code>MyFunction</code>).

source: Member Initialization
ru: Инициализация Члена

source: Example:<c/>
ru: Например:<c/>

source: As the names of the parameters of the second constructor are the same as the names of the two members <code>a</code> and <code>b</code>, we must use the <code><a cbot|this>this</a></code> <a cbot|pointer>reference</a> to avoid confusion with the parameters' names.
ru: Поскольку названия параметров второго конструктора совпадают с названиями двух членов <code>a</code> и <code>b</code>, мы должны использовать <code><a cbot|this>this</a></code> <a cbot|pointer>ссылку</a>, чтобы избежать путаницы с названиями параметров.

source: Object Creation
ru: Создание Объекта

source: You can create objects of type <code>YourClass</code> using the <code><a cbot|new>new</a></code> keyword. Example:
ru: Мы можете создавать объекты типа <code>YourClass</code> используя ключевое слово <code><a cbot|new>new</a></code>. Например:

source: Object Destruction
ru: Уничтожение Объекта

source: Passing Objects to Functions
ru: Передача Объектов Функциям

source: Objects in CBOT are passed by <a cbot|pointer>reference</a>. This means that when an object is passed to a <a cbot|function>function</a>, the function receives a copy of a pointer to the instance, not a copy of the object, so any modifications on the object will be visible outside of the function.
ru: Объекты в CBOT передаются по <a cbot|pointer>ссылке</a>. Это означает, что когда объект передается в <a cbot|function>функцию</a>, функция получает копию указателя на экземпляр, а не копию объекта, поэтому любые изменения объекта будут видны вне функции.

source: Inheritance
ru: Наследование

source: A class can inherit public and protected members of another class by using the <code><a cbot|extends>extends</a></code> keyword.
ru: Класс может наследовать public и protected члены другого класса с помощью ключевого слова <code><a cbot|extends>extends</a></code>.

source: This keyword allows you to create a class definition by using the following syntax:
ru: Это ключевое слово позволяет создать определение класса, используя следующий синтаксис:

source: All Classes Are Public
ru: Все Классы Public

source: Class Members Modifiers
ru: Модификаторы Членов Класса

source: Using <code><a cbot|this>this</a></code>
ru: Используя <code><a cbot|this>this</a></code>

source: extern void object::Test() { MyClass object1(); // Call default constructor (without parameters) MyClass object2(4, 5); // Call constructor with two int parameters MyClass object3; // No constructor called, object3 == null object3 = new MyClass(); // We call constructor now, object3 != null }
ru: extern void object::Test() { MyClass object1(); // Вызов конструктора по умолчанию (без параметров) MyClass object2(4, 5); // Вызов конструктора с двумя параметрами типа int MyClass object3; // Конструктор не вызван, object3 == null object3 = new MyClass(); // Мы вызываем конструктор сейчас, object3 != null }

source: You can also define a destructor. This must be a <code><a cbot|void>void</a></code> fonction without parameters, which has the same name as the class but prefixed with the <code>~</code> character. The destructor is called automatically as soon as the class instance is no more referenced by anyone. Example:
ru: Вы также можете определить деструктор. Это должна быть функция <code><a cbot|void>void</a></code> без параметров, которая имеет то же название, что и класс, но с префиксом <code>~</code>. Деструктор вызывается автоматически, как только на экземпляр класса больше никто не ссылается. Например:

source: public class MyClass { static private int counter = 0; // instance counter void MyClass( ) { counter++; // one instance more } void ~MyClass( ) { counter--; // one instance less } } extern void object::Test() { // counter == 0 MyClass item1( ); // counter == 1 MyClass item2( ); // counter == 2 item1 = null; // counter == 1 } // counter == 0
ru: public class MyClass { static private int counter = 0; // экземпляр counter void MyClass( ) { counter++; // ещё один экземпляр } void ~MyClass( ) { counter--; // один экземпляр убавить } } extern void object::Test() { // counter == 0 MyClass item1( ); // counter == 1 MyClass item2( ); // counter == 2 item1 = null; // counter == 1 } // counter == 0

source: Accessing Class Members
ru: Доступ к Членам Класса

source: Class members can be accessed outside of the class definition by using the <code>.</code> operator. Example:
ru: Доступ к членам класса можно получить вне определения класса с помощью оператора <code>.</code>. Например:
