Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: If you write <code>position</code> alone, this gives you the position of the bot that executes the program. If you write the name of a variable followed by <code>.position</code>, this gives you the position of the object described in the variable.
ru: Если вы напишете только <code>position</code>, это даст вам позицию бота, который выполняет программу. Если вы напишете имя переменной, за которой следует <code>.position</code>, это даст вам позицию объекта, описанного в переменной.

source: Here is a program that moves forward, covering exactly the distance between the bot and the closest ant:
ru: Вот программа, которая двигает вперёд, точно покрывая расстояние между ботом и ближайшим Муравьём:

source: This is of course pure suicide. Better to stop 40 meters before, in order to be at shooting range:
ru: Это, конечно, чистое самоубийство. Лучше остановиться на 40 метров раньше, чтобы оказаться на расстоянии выстрела:

source: For specialists
ru: Для специалистов

source: Calculates the distance between two positions.
ru: Вычисляет расстояние между двумя позициями.

source: Coordinates of the two positions.
ru: Координаты двух позиций.

source: Distance between the two positions.
ru: Расстояние между двумя позициями.

source: Instruction <code>distance2d</code>
ru: Инструкция <code>distance2d</code>

source: Calculates the distance between two positions (ignores the z coordinate).
ru: Вычисляет расстояние между двумя позициями (игнорирует координату z).

source: Instruction <code>do - while</code>
ru: Инструкция <code>do - while</code>

source: <code>do { </code>Instructions ...<c/> } while ( condition );
ru: <code>do { </code>Инструкции ...<c/> } while ( условие );

source: This instruction allows you to perform several times the instructions inside the <a cbot|bloc>block</a>. The instructions are executed at least once, because the condition is tested only afterwards. Be careful not to confuse the instruction <c/>do { } while ( );<n/> with the instruction <code><a cbot|while>while</a> ( ) { }</code>; the latter tests the condition before the instructions in the block are executed.
ru: Эта инструкция позволяет вам несколько раз выполнить инструкции внутри <a cbot|bloc>блока</a>. Инструкции выполняются хотя бы один раз, потому что условие проверяется только потом. Будьте осторожны, чтобы не перепутать инструкцию <c/>do { } while ( );<n/> с инструкцией <code><a cbot|while>while</a> ( ) { }</code>; последняя проверяет условие перед выполнением инструкций в блоке.

source: The instructions in the block are performed over and over again, as long as the <a cbot|cond>condition</a> is true.
ru: Инструкции в блоке выполняются снова и снова, пока выполняемое <a cbot|cond>условие</a> истинно.

source: Here is an example :
ru: Например :

source: Attention
ru: Внимание

source: Always put a <a cbot|term>semicolon</a> at the end of the line <code>while ( )</code>.
ru: Всегда ставьте <a cbot|term>точку с запятой</a> в конце строки <code>while ( )</code>.

source: The instructions <code><a cbot|break>break</a></code> and <code><a cbot|continue>continue</a></code> can be useful inside a block following the instruction <code>do { }</code>.
ru: Инструкции <code><a cbot|break>break</a></code> и <code><a cbot|continue>continue</a></code> могут быть полезны внутри блока, следующего за инструкцией <code>do { }</code>.

source: Instruction <code>drop</code>
ru: Инструкция <code>drop</code>

source: The instruction <c/>drop();<n/> instructs the bot to drop whatever the operating arm is carrying on the ground, on the platform of a building or on the power cell location of a bot.
ru: Инструкция <c/>drop();<n/> приказывает боту поставить всё, что несёт манипулятор, на землю, на платформу здания или на место отсека Батареи бота.

source: The instruction <c/>drop();<n/> written in this form drops the object in front of the bot. Here is a short program that grabs an object in front of the bot and drops it 5 meters further:
ru: Написанная в этой форме инструкция <c/>drop();<n/> ставит объект перед ботом. Вот короткая программа, которая берёт объект перед ботом и ставит его на 5 метров дальше:

source: This instruction appeals to the operating arm of a <a object|botgr>grabber bot</a>, in order to drop what it is holding.
ru: Эта инструкция обращается к манипулятору <a object|botgr>Погрузчика</a>, чтобы он поставил то, что он держит.

source: oper: <code><a cbot|int>int</a></code> (default value<code>InFront</code>)
ru: oper: <code><a cbot|int>int</a></code> (значение по умолчанию<code>InFront</code>)

source: Oper indicates where the robot should drop the object. If no indication is given, the object is dropped in front of the bot. <code>InFront </code> Drops in front (default value). <code>Behind </code> Drops behind. <code>EnergyCell</code> Drops on the bot's own power cell location.
ru: Операция указывает, куда бот должен поставить объект. Если ничего не указано, объект ставится перед ботом. <code>InFront </code> Поставить перед ботом (значение по умолчанию). <code>Behind </code> Поставить сзади. <code>EnergyCell</code> Поставить в собственный отсек Батареи бота.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <c/>drop();<n/>. <code>== 0 </code>object was dropped <code>!= 0 </code>error, no object was dropped
ru: Обычно программа останавливается из-за ошибки. Вы можете предотвратить остановку программы при ошибках, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В случае ошибки <c/>drop();<n/> возвращает значение отличное от нуля. <code>== 0 </code>объект был поставлен <code>!= 0 </code>ошибка, объект не был поставлен

source: Instruction <code>eof</code>
ru: Инструкция <code>eof</code>

source: Test the end of file condition of an open file. This is a method of the <code><a cbot|file>file</a></code> class; therefore you cannot write <code>eof()</code> but only <code>handle.eof()</code>:
ru: Проверить окончание открытого файла. Это метод класса <code><a cbot|file>file</a></code>; поэтому вы не можете писать <code>eof()</code>, а только <code>handle.eof()</code>:

source: Example:
ru: Например:

source: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code> and <code><a cbot|writeln>writeln</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code> и <code><a cbot|writeln>writeln</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>errmode</code>
ru: Инструкция <code>errmode</code>

source: The <c/>errmode();<n/> instruction allows you to chose if the program should stop when an error occurs in one of the following instructions: <code><a cbot|goto>goto</a></code>, <code><a cbot|move>move</a></code>, <code><a cbot|grab>grab</a></code>, <code><a cbot|drop>drop</a></code>, etc.
ru: Инструкция <c/>errmode();<n/> позволяет определить, должна ли программа останавливаться при возникновении ошибки в одной из следующих инструкций: <code><a cbot|goto>goto</a></code>, <code><a cbot|move>move</a></code>, <code><a cbot|grab>grab</a></code>, <code><a cbot|drop>drop</a></code>, т.д.

source: Normally the program is stopped when an error occurs. If you use the instruction <c/>errmode(0);<n/> at the beginning of the program, the instructions listed above return a value different from zero if the instruction could not be performed.
ru: Обычно программа останавливается при возникновении ошибки. Если вы используете инструкцию <c/>errmode(0);<n/> в начале программы, перечисленные выше инструкции возвращают значение, отличное от нуля, если инструкция не может быть выполнена.

source: mode: <code><a cbot|float>float</a></code> (<code>1</code> per default)
ru: mode: <code><a cbot|float>float</a></code> (<code>1</code> по умолчанию)

source: Error treatment mode. <code>0</code> -> continues program execution and returns a non zero value <code>1</code> -> stops the program (default behavior)
ru: Режим обработки ошибок. <code>0</code> -> продолжить выполнение программы и возвращает значение отличное от нуля <code>1</code> -> остановить программу (поведение по умолчанию)

source: Example 1:
ru: Пример 1:

source: Example 2:
ru: Пример 2:

source: <c/>errmode(0); int err; err = goto(pos); if ( err != 0 ) { <n/>goto did not perform correctly ...<code> </code>take some appropriate action ...<c/> }
ru: <c/>errmode(0); int err; err = goto(pos); if ( err != 0 ) { <n/>инструкция goto была выполнена некорректно. ..<code> </code>предпримите меры ...<c/> }

source: Expressions
ru: Выражения

source: is equivalent to
ru: эквивалентно

source: <code>+=</code> addition <code>-=</code> subtraction <code>*=</code> multiplication <code>/=</code> division <code>%=</code> remainder of the division (only for the type <code><a cbot|int>int</a></code>)
ru: <code>+=</code> сложение <code>-=</code> вычитание <code>*=</code> умножение <code>/=</code> деление <code>%=</code> остаток от деления (только для типа <code><a cbot|int>int</a></code>)

source: The operators <code>++</code> and <code>--</code> allow you to increment (++) or to decrement (--) a variable in very compact and efficient manner.
ru: Операторы <code>++</code> и <code>--</code> позволяют вам делать инкремент (++) или декремент (--) переменной очень компактным и эффективным образом.

source: Instruction <code>extern</code>
ru: Инструкция <code>extern</code>

source: The <code>extern</code> instruction determines the <a cbot|function>function</a> that acts as main program of a robot. The name of the function declared with <code>extern</code> will apear in the program list in the lower left corner of the screen.
ru: Инструкция <code>extern</code> определяет <a cbot|function>функцию</a>, которая действует как основная программа бота. Название функции, объявленное с помощью <code>extern</code>, появится в списке программ в нижнем левом углу экрана.

source: If the program contains other functions, only the main function must be preceded by <code>extern</code>.
ru: Если программа содержит другие функции, только перед основной функцией должна стоять <code>extern</code>.

source: Type <code>false</code>
ru: Тип <code>false</code>

source: This value means that a condition is not true; it is one of the two values that a <a cbot|bool>boolean</a> <a cbot|var>variable</a> can take.
ru: Это значение означает, что условие не выполняется; это одно из двух значений, которые может принимать <a cbot|bool>логическая</a> <a cbot|var>переменная</a>.

source: Type <code>file</code>
ru: Тип <code>file</code>

source: This type is used for accessing files in the files/ folder.
ru: Этот тип используется для доступа к файлам/папке.

source: Use the syntax above for declaring a file handle. You must use () to create an instance of the <code>file</code> class. Without the () the handle would have the value <code><a cbot|null>null</a></code>.
ru: Используйте приведенный выше синтаксис для объявления дескриптора файла. Вы должны использовать () для создания экземпляра класса <code>file</code>. Без () дескриптор имел бы значение <code><a cbot|null>null</a></code>.

source: Files can only be created and opened in the files/ folder which is located in the folder inside Colobot save directory. You cannot not create or open files elsewhere than in the files/ folder.
ru: Файлы можно создавать и открывать только в файлах/папке, которая находится в папке Colobot. Вы не можете создавать и открывать файлы, которые находятся где-либо ещё, кроме в файлах/папке.

source: <code>file</code> is actually not a simple type but a class. <code>open</code>, <code>close</code>, <code>writeln</code> etc. are methods of the <code>file</code> class. This is the reason why we always write <code>handle.method()</code>:
ru: <code>file</code> на самом деле не просто тип, а класс. <code>open</code>, <code>close</code>, <code>writeln</code> и т.д. - это все методы класса <code>file</code>. Это причина, почему мы всегда пишем <code>handle.method()</code>:

source: <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code>, <code><a cbot|writeln>writeln</a></code> and <code><a cbot|eof>eof</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code>, <code><a cbot|writeln>writeln</a></code> и <code><a cbot|eof>eof</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>fire</code>
ru: Инструкция <code>fire</code>

source: The instruction <c/>fire();<n/> fires the bot's onboard cannon.
ru: Инструкция <c/>fire();<n/> стреляет бортовым орудием бота.

source: Generally this instruction is used to shoot one-second bursts:
ru: Обычно эта инструкция используется для стрельбы одно-секундной длительности:

source: In order to move the gun upward or downward, use the instruction <code><a cbot|aim>aim</a></code>.
ru: Чтобы переместить орудие вверх или вниз, используйте инструкцию <code><a cbot|aim>aim</a></code>.

source: Duration of the burst. Generally, the value given is 1. Shorter bursts can also be performed in order to spare time and energy.
ru: Продолжительность выстрела. Обычно указывается значение 1. Более короткие выстрелы также могут выполняться для экономии времени и энергии.

source: Zero if OK, or a value different from zero if an error occurred. <code>== 0 </code>the cannon has been fired <code>!= 0 </code>error, the cannon could not be fired
ru: Если все нормально, то возвращает ноль, если же возникла ошибка, то какое-то число. <code>== 0 </code>орудие выстрелило <code>!= 0 </code>ошибка, орудие не выстрелило

source: Instruction <code>flatground</code>
ru: Инструкция <code>flatground</code>

source: Calculates the maximal radius of a flat zone on which a building ca be built.
ru: Вычисляет максимальный радиус ровной зоны, на которой может быть построено здание.

source: Center of the circlular zone.
ru: Центр круговой зоны.

source: Maximal radius.
ru: Максимальный радиус.

source: Radius of the flat zone (always between 0 and rmax).
ru: Радиус ровной зоны (всегда от 0 до rmax).

source: Type <code>float</code>
ru: Тип <code>float</code>

source: Use this type for most variables that contains numbers. Variables of this type can contain positive and negative numbers, whole or real numbers, for example:
ru: Используйте этот тип для большинства переменных, содержащих числа. Переменные этого типа могут содержать положительные и отрицательные числа, целые или действительные числа, например:

source: If you need only whole numbers (f. ex. 12 or -5000), you should rather use the type <code><a cbot|int>int</a></code>.
ru: Если вам нужны только целые числа (например, 12 или -5000), лучше используйте тип <code><a cbot|int>int</a></code>.

source: Do not insert space or colon characters into a number. To separate the whole part from the fractional part, use a dot.
ru: Не вставляйте в число пробелы или двоеточия. Чтобы отделить целую часть от дробной, используйте точку.

source: Write and not 12.56 12 . 56 -54.34 -54,34 12895.69 12,895.69
ru: Писать но не 12.56 12 . 56 -54.34 -54,34 12895.69 12,895.69

source: Floating point numbers are represented in Colobot with 32 bits. The highest value that can be represented is 3.4E+38. The smallest value that can be represented is 3.4E-38.
ru: Числа с плавающей запятой представлены в Colobot 32-битными. Наибольшее значение, которое можно представить 3,4E+38. Наименьшее значение, которое можно представить 3,4E-38.

source: Instruction <code>for</code>
ru: Инструкция <code>for</code>

source: <c/>for ( before ; condition ; end ) { <n/>Instructions ...<c/> }
ru: <c/>for ( before ; условие ; end ) { <n/>Инструкции ...<c/> }

source: This instruction allows you to execute a certain number of times the instructions contained in the <a cbot|bloc>block</a>.
ru: Эта инструкция позволяет вам выполнить определенное количество раз инструкции, содержащиеся в <a cbot|bloc>блоке</a>.

source: This <a cbot|cond>condition</a> determines if another instance of the loop must be executed. It is tested before every instance of the loop.
ru: Это <a cbot|cond>условие</a> определяет, должен ли выполняться другой экземпляр цикла. Оно проверяется перед каждым экземпляром цикла.

source: The following example is strictly equivalent to a <code>for</code>-loop, but it uses the instruction <code><a cbot|while>while</a></code>:
ru: Следующий пример строго эквивалентен циклу <code>for</code>, но в нём используется инструкция <code> <a cbot|while>while</a></code>:

source: <c/>before; while ( condition ) { <n/>Instructions ...<c/> end; }
ru: <c/>before; while ( условие ) { <n/>Инструкции ...<c/> end; }

source: Do not put a <a cbot|term>semicolon</a> at the end of the line <code>for ( )</code>.
ru: Не ставьте <a cbot|term>точку с запятой</a> в конце строки <code>for ( )</code>.

source: The instructions <code><a cbot|break>break</a></code> and <code><a cbot|continue>continue</a></code> can be useful inside a block following the instruction <code>for </code>.
ru: Инструкции <code><a cbot|break>break</a></code> и <code><a cbot|continue>continue</a></code> могут быть полезны внутри блока, следующего за инструкцией <code>for</code>.

source: Functions
ru: Функции

source: You can also declare a function <a cbot|public>public</a> so it can be used by other bots.
ru: Вы также можете объявить функцию <a cbot|public>публичной</a>, чтобы её могли использовать другие боты.

source: Instruction <code>goto</code>
ru: Инструкция <code>goto</code>

source: The instruction <c/>goto();<n/> instructs the bot to reach a given position.
ru: Инструкция <c/>goto();<n/> приказывает боту достичь заданной позиции.

source: The most current use consists in moving the bot to an object located with the instruction <c/><a cbot|radar>radar</a>();<n/>. If the information returned by the <c/><a cbot|radar>radar</a>();<n/> has been stored in a certain variable, write the name of the variable followed by <code>.position</code> in order to get the position of the object. Here is an example of a program that looks for a <a object|titan>titanium cube</a>, goes to the position and grabs it:
ru: Чаще всего используется для перемещения бота к объекту, обнаруженному с помощью инструкции <c/><a cbot|radar>radar</a>();<n/>. Если информация, возвращаемая <c/><a cbot|radar>radar</a>();<n/>, была сохранена в определённой переменной, напишите название переменной, за которой следует <code>.position</code>, чтобы получить позицию объекта. Вот пример программы, которая ищет <a object|titan>Титан</a>, идёт к позиции и берёт его:

source: Tells the robot to go to the given position, avoiding all the obstacles if this is possible.
ru: Говорит боту перейти в заданную позицию, избегая все препятствия, если это возможно.

source: Coordinates of the goal position.
ru: Координаты позиции цели.

source: Flight altitude for <a object|botgj>winged bots</a>. The altitude is useful only for <a object|botgj>winged bots</a>. From the initial altitude, the bot climbs higher until it reaches the specified hight. When arriving close to destination, it goes down to touch the ground at the given position. If no value is given, an altitude of 10 meters is the default value. On very short moves, even winged bot stay on the ground. For all bot except winged bots, this parameter is ignored.
ru: Высота полёта <a object|botgj>Ботов Крылатых</a>. Высота полезна только для <a object|botgj>Ботов Крылатых</a>. С начальной высоты бот поднимается, пока не достигнет указанной высоты. Приближаясь к месту назначения, он опускается, чтобы коснуться земли в заданном месте. Если значение не указано, по умолчанию используется высота 10 метров. На очень коротких передвижения даже Бот Крылатый остается на земле. Для всех ботов, кроме крылатых, этот параметр игнорируется.

source: goal: <code><a cbot|int>int</a></code> (default value <code>0</code>)
ru: goal: <code><a cbot|int>int</a></code> (по умолчанию <code>0</code>)

source: This parameter tells the bot how it must reach the goal: <code>0</code> stops exactly at the goal position <code>1</code> goes close to the goal position, without stopping. If no value is given, <code>0</code> (precision) is the default value.
ru: Этот параметр сообщает боту, как он должен достичь цели: <code>0</code> остановится точно в позиции цели <code>1</code> подойти близко к позиции цели, не останавливаясь. Если значение не указано, по умолчанию используется <code>0</code> (точность).

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <code>goto()</code>. <code>== 0 </code>Goal position reached <code>!= 0 </code>Goal position impossible to reach
ru: Обычно программа останавливается из-за ошибки. Вы можете предотвратить остановку программы при ошибках, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В случае ошибки <code>goto()</code> возвращает значение отличное от нуля. <code>== 0 </code>Достиг позиции цели <code>!= 0 </code>Невозможно достичь позиции цели

source: Instruction <code>grab</code>
ru: Инструкция <code>grab</code>

source: The instruction <c/>grab();<n/> instructs the bot to use the operating arm to grab an object located on the ground, on the platform of a building or on the power cell location of a bot.
ru: Инструкция <c/>grab();<n/> приказывает боту использовать манипулятор, чтобы брать объект, расположенный на земле, на платформе здания или в отсеке Батареи бота.

source: The instruction <c/>grab();<n/> written in this form grabs the object located in front of the bot. Here is a short program that grabs an object in front of the bot and drops it 5 meters further:
ru: Написанная в этой форме инструкция <c/>grab();<n/> берёт объект, расположенный перед ботом. Вот короткая программа, которая берёт объект перед ботом и ставит его на 5 метров дальше:

source: This instruction appeals to the operating arm of a <a object|botgr>grabber bot</a>, in order to grab the closest object.
ru: Эта инструкция обращается к манипулятору <a object|botgr>Погрузчика</a>, чтобы он брал ближайший объект.

source: Oper indicates where the bot should look for an object to grab. If no indication is given, the object is picked up in front of the bot. <code>InFront </code> Grabs in front (default value). <code>Behind </code> Grabs behind. <code>EnergyCell</code> Grabs the bot's own power cell.
ru: Операция указывает, где бот должен искать объект, который нужно брать. Если не указано иное, объект берётся перед ботом. <code>InFront </code> Берёт спереди (по умолчанию). <code>Behind </code> Берёт сзади. <code>EnergyCell</code> Берёт свою собственную Батарею.
