Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: Instruction <code>abstime</code>
ru: Инструкция <code>abstime</code>

source: Syntax:
ru: Синтаксис:

source: Return the time in seconds elapsed since the beginning of the mission.
ru: Возвращает время в секундах, прошедшее с начала миссии.

source: Return: <code><a cbot|float>float</a></code>
ru: Возвращает значение: <code><a cbot|float>float</a></code>

source: Time in seconds.
ru: Время в секундах.

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>aim</code>
ru: Инструкция <code>aim</code>

source: Syntax :
ru: Синтаксис :

source: <a object|botfr>Shooter</a>
ru: <a object|botfr>Стрелок</a>

source: <a object|botor>Orga shooter</a>
ru: <a object|botor>Био-Стрелок</a>

source: <a object|botphaz>Phazer shooter</a>
ru: <a object|botphaz>Стрелок Ферзь</a>

source: When controlling the robot through programming, the only way to turn the gun left or right is to turn the whole robot with the instruction <code><a cbot|turn>turn</a></code>.
ru: При управлении ботом через программу,единственный способ повернуть орудие влево или вправо - это повернуть весь бот с помощью инструкции <code><a cbot|turn>turn</a></code>.

source: Angle in degrees of the gun relative to the robot. A positive value orients the gun upward. For shooters and orga shooters, the angle must range from <code>-20</code> to <code>+20</code> degrees. For phazer shooters, the angle must range from <code>-20</code> to <code>45</code> degrees.
ru: Угол орудия относительно бота в градусах. Положительное значение ориентирует орудие вверх. Для Стрелков и Био-Стрелков, угол должен быть от <code>-20</code> до <code>+20</code> градусов. Для Стрелка Ферзь, угол должен быть в пределах от <code>-20</code> до <code>45</code> градусов.

source: Return value: <code><a cbot|int>int</a></code>
ru: Возвращает значение: <code><a cbot|int>int</a></code>

source: Zero if everything is OK, a value different from zero if the rotation could not be performed: <code>== 0 </code>The gun has now got the desired orientation <code>!= 0 </code>rotation impossible
ru: Ноль, если все в порядке, значение, отличное от нуля, если поворот не может быть выполнен: <code>== 0 </code>орудие сейчас сориентировано <code>!= 0 </code>поворот невозможен

source: Arrays
ru: Массивы

source: An array is basically a collection of variables of the same type or class. You can use N dimensionnal arrays in the CBOT language. Each dimension is limited to 9999 elements. You must use square brackets <code>[]</code> after the type name or the variable name to declare an array.
ru: Массив - это в основном набор переменных одного типа или класса. Вы можете использовать N-мерные массивы на языке CBOT. Однако размер массива ограничен 9999 элементами. Для объявления массива необходимо использовать квадратные скобки <code>[]</code> после имени типа или имени переменной.

source: Actually when the CBOT interpreter encounters an array declaration, it just creates a <code><a cbot|null>null</a></code> <a cbot|pointer>reference</a>:
ru: На самом деле, когда интерпретатор CBOT встречает объявление массива, он просто создает <code><a cbot|null>null</a></code> <a cbot|pointer>ссылку</a>:

source: int a[5]; // a is now a null reference
ru: int a[5]; // просто пустая ссылка

source: As soon as you put values into the array, the elements are created and the reference is initialized:
ru: Как только вы помещаете значения в массив, создаются элементы и инициализируется ссылка:

source: a[2] = 213; // a points to // 3 elements [0], [1] et [2]
ru: a[2] = 213; // указывает на // три элемента [0], [1] и [2]

source: After this operation, <code>a</code> contains a reference to the elements of the array. Elements <code>[0]</code> and <code>[1]</code> are created but not initialized because an array cannot contain empty elements. The <code><a cbot|sizeof>sizeof</a></code> instruction allows you to obtain the number of elements contained in an array.
ru: После этой операции <code>a</code> содержит ссылку на элементы массива. Элементы <code>[0]</code> и <code>[1]</code> создаются, но не инициализируются, поскольку массив не может содержать пустые элементы. Инструкция <code><a cbot|sizeof>sizeof</a></code> позволяет вам получить количество элементов, содержащихся в массиве.

source: When an array is declared with a maximum size, the program will stop as soon as there is an access beyond the maximum array size. No error is signalled during compilation even if the error is obvious:
ru: Когда массив объявлен с максимальным размером, программа остановится, как только произойдет доступ, превышающий максимальный размер массива. Во время компиляции нет сообщений об ошибках, даже если ошибка очевидна:

source: { int a[5]; a[7] = 123; // no error at compile time // but error at run time }
ru: { int a[5]; a[7] = 123; // нет ошибки при компиляции // однако ошибка при выполнении }

source: If you pass an array as parameter to a <a cbot|function>function</a>, the function only receives a <a cbot|pointer>reference</a> to the array. That means if you modify an array element in the function, the element of the array that has been passed the function will be actuallay modified.
ru: Если вы передаёте массив в качестве параметра <a cbot|function>функции</a>, функция получает только <a cbot|pointer>ссылку</a> на массив. Это означает, что если вы изменяете элемент массива в функции, элемент массива, который был передан функции, будет фактически изменён.

source: Blocks
ru: Блоки

source: You can use braces <code>{ }</code> to group a number of instructions together in order to make one single block out of them, for example:
ru: Вы можете использовать фигурные скобки <code>{ }</code>, для группировки нескольких инструкций вместе, чтобы сделать из них один блок, например:

source: { float t; t = a; a = b; b = t; // switches round a and b }
ru: { float t; t = a; a = b; b = t; // переключает между a и b }

source: Every instruction in the block is followed by a <a cbot|term>semicolon</a>, but the block itself is not. Let us take the following example with the instruction <code><a cbot|if>if</a></code> to illustrate the use of blocks in a program:
ru: За каждой инструкцией в блоке следует <a cbot|term>точка с запятой</a>, но не за самим блоком. Давайте рассмотрим следующий пример с инструкцией <code><a cbot|if>if</a></code>, чтобы проиллюстрировать использование блоков в программе:

source: if ( a < b ) <n/>instruction 1<c/>; <n/>instruction 2<c/>; <n/>instruction 3<c/>;
ru: if ( a < b ) <n/>инструкция 1<c/>; <n/>инструкция 2<c/>; <n/>инструкция 3<c/>;

source: If the <a cbot|cond>condition</a> is true, instructions 1, 2 and 3 are performed. If the condition is false, only instruction 1 is ignored, instructions 2 and 3 are performed. The fact that instruction 2 is lined up with instruction 1 does not matter. If you want to perform instructions 1 and 2 only if the condition is true, you have to bracket them together in a block:
ru: Если <a cbot|cond>условие</a> истинно, выполняются инструкции 1, 2 и 3. Если условие ложно, игнорируется только инструкция 1, выполняются инструкции 2 и 3. То, что инструкция 2 совмещена с инструкцией 1, не имеет значения. Если вы хотите выполнять инструкции 1 и 2 только в том случае, если условие истинно, вы должны объединить их скобками в блок:

source: if ( a < b ) { <n/>instruction 1<c/>; <n/>instruction 2<c/>; } <n/>instruction 3<c/>;
ru: if ( a < b ) { <n/>инструкция 1<c/>; <n/>инструкция 2<c/>; } <n/>инструкция 3<c/>;

source: Blocks may be needed with instructions <code><a cbot|if>if</a></code>, <code><a cbot|while>while</a></code> and <code><a cbot|for>for</a></code>, in order to group several instructions that should be performed only if a condition is true, or repeated several times. You can fit blocks into other blocks, on as many levels as you need. Here is an example of imbrication on two levels :
ru: Могут потребоваться блоки с инструкциями <code><a cbot|if>if</a></code>, <code><a cbot|while>while</a></code> и <code><a cbot|for>for</a></code>, чтобы сгруппировать несколько инструкций, которые должны выполняться, только если условие истинно, или повторяться несколько раз. Вы можете вставлять блоки в другие блоки на любом количестве уровней. Вот пример разделения на двух уровнях :

source: You had better line up the open brace <code>{</code> with the closing brace <code>}</code> in order to improve readability, but it is not compulsory. The following example takes less space, is equivalent to the previous example, but it is not advisable to write your programs in the following style :
ru: Вам лучше выровнять открывающую скобку <code>{</code> с закрывающей скобкой <code>}</code>, чтобы улучшить читаемость, но это не обязательно. Следующий пример занимает меньше места, эквивалентен предыдущему примеру, но не рекомендуется писать свои программы в следующем стиле:

source: <a cbot>Instructions</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Инструкции</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Type <code>bool</code>
ru: Тип <code>bool</code>

source: In a variable of this type you can put a boolean value, that is a value that can take only two states: true or false.
ru: В переменную этого типа можно поместить логическое значение, то есть значение, которое может принимать только два состояния: true (истина) или false (ложь).

source: Instruction <code>break</code>
ru: Инструкция <code>break</code>

source: <c/>while ( condition ) { break; }
ru: <c/>while ( условие ) { break; }

source: With this instruction, you can get out immediately of a <code><a cbot|while>while</a></code> or <code><a cbot|for>for</a></code> loop.
ru: С помощью этой инструкции вы можете немедленно выйти из цикла <code><a cbot|while>while</a></code> или <code><a cbot|for>for</a></code>.

source: Here is an example:
ru: Например:

source: <c/>int i = 0; while ( true ) { <n/>Instructions ...<c/> i = i+1; if ( i >= 10 ) { break; } <n/>more instructions ...<c/> }
ru: <c/>int i = 0; while ( true ) { <n/>Инструкции ...<c/> i = i+1; if ( i >= 10 ) { break; } <n/>ещё инструкции ...<c/> }

source: Value <code>Categories</code>
ru: Значение <code>Categories</code>

source: Categories represent the names of objects in the CBOT language. Everything in COLOBOT is an object: robots, buildings, raw materials, etc., even yourself.
ru: Категории представляют собой названия объектов на языке CBOT. Все в COLOBOT - это объект: боты, здания, сырье и т.д., даже Вы сами.

source: <code><a object|titanore>TitaniumOre</a> </code>Titanium Ore <code><a object|uranore>UraniumOre</a> </code>Uranium Ore <code><a object|titan>Titanium</a> </code>Cube of converted Titanium <code><a object|power>PowerCell</a> </code>Regular Power Cell <code><a object|atomic>NuclearCell</a> </code>Nuclear Power Cell <code><a object|bullet>OrgaMatter</a> </code>Organic Matter <code><a object|bbox>BlackBox</a> </code>Black Box <code><a object|tnt>TNT</a> </code>Explosive device <code><a object|key>KeyA..D</a> </code>Keys A, B, C and D
ru: <code><a object|titanore>TitaniumOre</a> </code>Руда Титановая <code><a object|uranore>UraniumOre</a> </code>Руда Урановая <code><a object|titan>Titanium</a> </code>Титан <code><a object|power>PowerCell</a> </code>Батарея Обычная <code><a object|atomic>NuclearCell</a> </code>Батарея Ядерная <code><a object|bullet>OrgaMatter</a> </code>Био-Материя <code><a object|bbox>BlackBox</a> </code>Чёрный Ящик <code><a object|tnt>TNT</a> </code>Заряд (ТНТ) <code><a object|key>KeyA..D</a> </code>Ключи A, B, C, и D

source: <button 158/> <code><a object|bottr>PracticeBot</a> </code>Practice Bot <button 173/> <code><a object|bottarg>TargetBot</a> </code>Target Bot
ru: <button 158/> <code><a object|bottr>PracticeBot</a> </code>Бот Учебный <button 173/> <code><a object|bottarg>TargetBot</a> </code>Бот Цель

source: <button 137/> <code><a object|botgr>WheeledGrabber</a> </code>Wheeled Grabber <button 138/> <code><a object|botgc>TrackedGrabber</a> </code>Tracked Grabber <button 139/> <code><a object|botgj>WingedGrabber</a> </code>Winged Grabber <button 150/> <code><a object|botgs>LeggedGrabber</a> </code>Legged Grabber
ru: <button 137/> <code><a object|botgr>WheeledGrabber</a> </code>Погрузчик Колёсный <button 138/> <code><a object|botgc>TrackedGrabber</a> </code>Погрузчик Гусеничный <button 139/> <code><a object|botgj>WingedGrabber</a> </code>Погрузчик Крылатый <button 150/> <code><a object|botgs>LeggedGrabber</a> </code>Погрузчик Лапчатый

source: <button 140/> <code><a object|botsr>WheeledSniffer</a> </code>Wheeled Sniffer <button 141/> <code><a object|botsc>TrackedSniffer</a> </code>Tracked Sniffer <button 142/> <code><a object|botsj>WingedSniffer</a> </code>Winged Sniffer <button 152/> <code><a object|botss>LeggedSniffer</a> </code>Legged Sniffer
ru: <button 140/> <code><a object|botsr>WheeledSniffer</a> </code>Разведчик Колёсный <button 141/> <code><a object|botsc>TrackedSniffer</a> </code>Разведчик Гусеничный <button 142/> <code><a object|botsj>WingedSniffer</a> </code>Разведчик Крылатый <button 152/> <code><a object|botss>LeggedSniffer</a> </code>Разведчик Лапчатый

source: <button 143/> <code><a object|botfr>WheeledShooter</a> </code>Wheeled Shooter <button 144/> <code><a object|botfc>TrackedShooter</a> </code>Tracked Shooter <button 145/> <code><a object|botfj>WingedShooter</a> </code>Winged Shooter <button 151/> <code><a object|botfs>LeggedShooter</a> </code>Legged Shooter
ru: <button 143/> <code><a object|botfr>WheeledShooter</a> </code>Стрелок Колёсный <button 144/> <code><a object|botfc>TrackedShooter</a> </code>Стрелок Гусеничный <button 145/> <code><a object|botfj>WingedShooter</a> </code>Стрелок Крылатый <button 151/> <code><a object|botfs>LeggedShooter</a> </code>Стрелок Лапчатый

source: <button 153/> <code><a object|botor>WheeledOrgaShooter</a> </code>Wheeled Orga Shooter <button 154/> <code><a object|botoc>TrackedOrgaShooter</a> </code>Tracked Orga Shooter <button 155/> <code><a object|botoj>WingedOrgaShooter</a> </code>Winged Orga Shooter <button 156/> <code><a object|botos>LeggedOrgaShooter</a> </code>Legged Orga Shooter
ru: <button 153/> <code><a object|botor>WheeledOrgaShooter</a> </code>Био-Стрелок Колёсный <button 154/> <code><a object|botoc>TrackedOrgaShooter</a> </code>Био-Стрелок Гусеничный <button 155/> <code><a object|botoj>WingedOrgaShooter</a> </code>Био-Стрелок Крылатый <button 156/> <code><a object|botos>LeggedOrgaShooter</a> </code>Био-Стрелок Лапчатый

source: <button 149/> <code><a object|botsub>Subber</a> </code>Subber <button 148/> <code><a object|botrecy>Recycler</a> </code>Recycler <button 157/> <code><a object|botshld>Shielder</a> </code>Shielder <button 146/> <code><a object|bottump>Thumper</a> </code>Thumper <button 147/> <code><a object|botphaz>PhazerShooter</a> </code>Phazer Shooter
ru: <button 149/> <code><a object|botsub>Subber</a> </code>Амфибия <button 148/> <code><a object|botrecy>Recycler</a> </code>Утилизатор <button 157/> <code><a object|botshld>Shielder</a> </code>Защитник <button 146/> <code><a object|bottump>Thumper</a> </code>Кувалдник <button 147/> <code><a object|botphaz>PhazerShooter</a> </code>Стрелок Ферзь

source: <code><a object|mother>AlienQueen</a> </code>Alien Queen <code><a object|egg>AlienEgg</a> </code>Alien Egg <code><a object|ant>AlienAnt</a> </code>Ant <code><a object|spider>AlienSpider</a> </code>Spider <code><a object|wasp>AlienWasp</a> </code>Wasp <code><a object|worm>AlienWorm</a> </code>Worm
ru: <code><a object|mother>AlienQueen</a> </code>Королева Пришельцев <code><a object|egg>AlienEgg</a> </code>Яйцо Пришельцев <code><a object|ant>AlienAnt</a> </code>Муравей <code><a object|spider>AlienSpider</a> </code>Паук <code><a object|wasp>AlienWasp</a> </code>Оса <code><a object|worm>AlienWorm</a> </code>Червь

source: <button 136/> <code><a object|human>Me</a> </code>You! <code><a object|mine>Mine</a> </code>Mine <code><a object|barrier>Barrier</a> </code>Barrier <code><a object|wreck>Wreck</a> </code>Derelict bot <code><a object|ruin>Ruin</a> </code>Derelict building
ru: <button 136/> <code><a object|human>Me</a> </code>Вы! <code><a object|mine>Mine</a> </code>Мина <code><a object|barrier>Barrier</a> </code>Барьер <code><a object|wreck>Wreck</a> </code>Обломки <code><a object|ruin>Ruin</a> </code>Руины

source: <a cbot>CBOT Language</a> and <a cbot|type>Variables</a>.
ru: <a cbot>Язык CBOT</a> и <a cbot|type>Переменные</a>.

source: Instruction <code>class</code>
ru: Инструкция <code>class</code>

source: Instruction <code>close</code>
ru: Инструкция <code>close</code>

source: Close a file opened previously with <code><a cbot|open>open</a></code>. This is a method of the <code><a cbot|file>file</a></code> class; therefore you cannot write <code>close()</code> but only <code>handle.close()</code>:
ru: Закрывает файл, открытый ранее функцией<code><a cbot|open>open</a></code>. Это метод класса <code><a cbot|file>file</a></code>; поэтому вы не можете писать <code>close()</code>, только <code>handle.close()</code>:

source: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|readln>readln</a></code>, <code><a cbot|writeln>writeln</a></code> and <code><a cbot|eof>eof</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|readln>readln</a></code>, <code><a cbot|writeln>writeln</a></code> and <code><a cbot|eof>eof</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Conditions
ru: Условия

source: <code>a == b </code><code>a</code> equals <code>b</code> <code>a != b </code><code>a</code> is different from <code>b</code> <code>a < b </code><code>a</code> smaller than <code>b</code> <code>a <= b </code><code>a</code> smaller than or equal to <code>b</code> <code>a > b </code><code>a</code> greater than <code>b</code> <code>a >= b </code><code>a</code> greater than or equal to <code>b</code>
ru: <code>a == b </code><code>a</code> равно <code>b</code> <code>a != b </code><code>a</code> не равно <code>b</code> <code>a < b </code><code>a</code> меньше чем <code>b</code> <code>a <= b </code><code>a</code> меньше или равно <code>b</code> <code>a > b </code><code>a</code> больше чем <code>b</code> <code>a >= b </code><code>a</code> больше или равно <code>b</code>

source: <code>12 == 12 </code>returns true <code>45 != 47 </code>returns true <code>99 == 98 </code>returns false <code>12 < -1 </code>returns false <code>12 >= 10 </code>returns true <code>12 >= 12 </code>returns true
ru: <code>12 == 12 </code>возвращает истина <code>45 != 47 </code>возвращает истина <code>99 == 98 </code>возвращает ложь <code>12 < -1 </code>возвращает ложь <code>12 >= 10 </code>возвращает истина <code>12 >= 12 </code>возвращает истина

source: Be careful not to confuse the equality comparison <code>==</code> with the assignment of a <a cbot|var>variable</a> <code>=</code>.
ru: Будьте внимательны и не путайте сравнение равенства <code>==</code> с присвоением <a cbot|var>переменной</a> <code>=</code>.

source: <code>a == b</code> is an expression that compares <code>a</code> with <code>b</code>. <code>a = b</code> is an expression that copies the value of <code>b</code> into <code>a</code>.
ru: <code>a == b</code> выражение, которое сравнивает <code>a</code> с <code>b</code>. <code>a = b</code> выражение, которое копирует значение <code>b</code> в <code>a</code>.

source: Instruction <code>continue</code>
ru: Инструкция <code>continue</code>

source: <c/>while ( condition ) { continue; }
ru: <c/>while ( условие ) { continue; }

source: With this instruction, you can jump over the rest of instructions in the <code><a cbot|bloc>bloc</a></code> of a <code><a cbot|while>while</a></code> or <code><a cbot|for>for</a></code> loop: The execution will resume at the beginning of the bloc, the next time the loop is repeated.
ru: С помощью этой инструкции вы можете перепрыгнуть через остальные инструкции в <code><a cbot|bloc>блоке</a></code> <code><a cbot|while>while</a></code> или <code><a cbot|for>for</a></code> цикле: Выполнение возобновится в начале блока при следующем повторении цикла.

source: <c/>int i = 0; while ( i < 5 ) { i = i+1; if ( i == 3 ) { continue; } <n/>Instructions ...<c/> }
ru: <c/>int i = 0; while ( i < 5 ) { i = i+1; if ( i == 3 ) { continue; } <n/>Инструкции ...<c/> }

source: The instructions will only be executed for the values of <code>i</code> 1, 2, 4 and 5.
ru: Инструкции будут выполняться только для значений <code>i</code> 1, 2, 4 и 5.

source: Instruction <code>deletefile</code>
ru: Инструкция <code>deletefile</code>

source: The deletefile instruction deletes an existing file in the files/ folder.
ru: Инструкция deletefile удаляет существующий файл в файлах/папке.

source: Files can only be deleted in the files/ folder which is located in the folder inside Colobot save directory. You cannot not delete files that are located elsewhere than in the files/ folder.
ru: Файлы могут быть удалены только в файлах/папке, которая находится в папке Colobot. Вы не можете удалить файлы, которые находятся где-либо ещё, кроме в файлах/папке.

source: Instruction <code>deleteinfo</code>
ru: Инструкция <code>deleteinfo</code>

source: Delete an existing information in the closest <a object|exchange>information exchange post</a>.
ru: Удаляет существующую информацию в ближайшем <a object|exchange>Пункте Обмена Информацией</a>.

source: Name of the information to be deleted. This name is a string: it must be written in quotation marks "".
ru: Название удаляемой информации. Это название является строкой: его нужно писать в кавычках "".

source: Power of the transmitter, which corresponds to the maximal distance between the sender and the exchange post. If the distance is longer, the information won't be deleted. Default value is 10 metres.
ru: Мощность передатчика, соответствующая максимальному расстоянию между отправителем и Пунктом Обмена Информацией. Если расстояние слишком большое, информация не будет удалена. Значение по умолчанию - 10 метров.

source: <code><a cbot|receive>receive</a></code>, <code><a cbot|send>send</a></code> and <code><a cbot|testinfo>testinfo</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|receive>receive</a></code>, <code><a cbot|send>send</a></code> и <code><a cbot|testinfo>testinfo</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>direction</code>
ru: Инструкция <code>direction</code>

source: Calculates the rotation that a robot must perform in order to point towards a given position.
ru: Вычисляет поворот, который должен выполнить бот, чтобы указать на заданную позицию.

source: Position towards which the robot must point.
ru: Позиция, на которую должен указывать бот.

source: Return value: <code><a cbot|float>float</a></code>
ru: Возвращает значение: <code><a cbot|float>float</a></code>

source: Angle of the rotation that must be performed. -90 means f. ex. a rotation of 90 degrees to the right.
ru: Угол поворота, который необходимо выполнить. -90 означает поворот на 90 градусов вправо.

source: Instruction <code>distance</code>
ru: Инструкция <code>distance</code>

source: With the instruction <code>distance( , )</code> you can calculate the distance between two positions.
ru: С помощью инструкции <code>distance( , )</code> вы можете рассчитать расстояние между двумя позициями.

source: Basic use
ru: Основное использование
