Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: With multidimensionnal arrays you can get the size of a sub array:
ru: С многомерными массивами вы можете получить размер подмассива:

source: float xy[][]; // 2 dimensionnal array xy[5][10] = 67; message( sizeof(xy) ); // will display 6 message( sizeof(xy[5]) ); // will display 11
ru: float xy[][]; // 2 одномерных массива xy[5][10] = 67; message( sizeof(xy) ); // покажет 6 message( sizeof(xy[5]) ); // покажет 11

source: Instruction <code>sniff</code>
ru: Инструкция <code>sniff</code>

source: Sounds the underground in front of the <a object|botsr>sniffer</a>. According to what raw materials were detected, the following objects will be created:
ru: Поиск перед <a object|botsr>Разведчиклм</a>. В зависимости от того, какое сырье было обнаружено, будут созданы следующие объекты:

source: <code>TitaniumSpot</code> -> <a object|stonspot>Red cross</a> <code>UraniumSpot </code> -> <a object|uranspot>Yellow circle</a> <code>PowerSpot </code> -> <a object|enerspot>Green cross</a>
ru: <code>TitaniumSpot</code> -> <a object|stonspot>Крест Красный</a> <code>UraniumSpot </code> -> <a object|uranspot>Круг Жёлтый</a> <code>PowerSpot </code> -> <a object|enerspot>Крест Зелёный</a>

source: Zero if everything is OK, or a value different from zero if an error occurred. <code>== 0 </code>sounding performed <code>!= 0 </code>sounding impossible
ru: Если все нормально, то возвращает ноль, если же возникла ошибка, то какое-то число. <code>== 0 </code>разведка выполнена <code>!= 0 </code>разведка невозможна

source: Instruction <code>space</code>
ru: Инструкция <code>space</code>

source: Determines the position of the nearest free space around a given position.
ru: Определяет положение ближайшего свободного пространства вокруг заданной позиции.

source: center: <code><a cbot|point>point</a></code> (default: bot position)
ru: center: <code><a cbot|point>point</a></code> (по умолчанию: положение бота)

source: Desired position of the free space.
ru: Желаемое положение свободного пространства.

source: rmin: <code><a cbot|float>float</a></code> (default value: <code>8</code>)
ru: rmin: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>8</code>)

source: Minimum distance from the desired position.
ru: Минимальное расстояние от желаемой позиции.

source: rmax: <code><a cbot|float>float</a></code> (default value: <code>50</code>)
ru: rmax: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>50</code>)

source: Maximum distance from the desired position.
ru: Максимальное расстояние от интересующей точки.

source: dist: <code><a cbot|float>float</a></code> (default value: <code>4</code>)
ru: dist: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>4</code>)

source: Required distance between two free spaces.
ru: Расстояние рекомендуемое между двумя свободными пространствами.

source: Return: <code><a cbot|point>point</a></code>
ru: Возвращает значение: <code><a cbot|point>point</a></code>

source: Position of the free space.
ru: Позиция свободного места.

source: Instruction <code>static</code> (for specialists)
ru: Инструкция <code>static</code> (для специалистов)

source: <a cbot|class>Class</a> members declared with <code>static</code> are shared between all instances of the class.
ru: Члены <a cbot|class>класса</a>, объявленные как <code>static</code>, являются общими для всех экземпляров класса.

source: public class MyClass { static int nb = 1; static string [ ] list = null; } void Test () { MyClasse item1(); MyClasse item2(); item1.nb = 3; item1.list[item1.nb] = "Hello"; message( item2.list[item2.nb] ); // display "Hello" }
ru: public class MyClass { static int nb = 1; static string [ ] list = null; } void Test () { MyClasse item1(); MyClasse item2(); item1.nb = 3; item1.list[item1.nb] = "Hello"; message( item2.list[item2.nb] ); // вывести "Hello" }

source: <code>Static</code> members can be declared <code><a cbot|private>private</a></code> so they will be only acessible from within class members (including constructors and destructors).
ru: <code>Static</code> члены могут быть объявлены как <code><a cbot|private>private</a></code>, таким образов они будут доступны только внутри членов класса (включая конструкторы и деструкторы).

source: <code><a cbot|class>class</a></code>, <code><a cbot|synchro>synchronized</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|synchro>synchronized</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>strfind</code>
ru: Инструкция <code>strfind</code>

source: Find a substring in a string and returns the position of the first substring found or <a cbot|nan>nan</a> if the substring has not been found.
ru: Находит подстроку в строке и возвращает позицию первой найденной подстроки или <a cbot|nan>nan</a>, если подстрока не была найдена.

source: String we are searching in.
ru: Строка, в которой мы ищем.

source: Substring we are searching for.
ru: Подстрока, которую мы ищем.

source: Examples:
ru: Примеры:

source: <c/> int pos = strfind("abcdef", "ab"); // pos will be 0 int pos = strfind("abcdef", "de"); // pos will be 3 int pos = strfind("abcdef", "xy"); // pos will be <a cbot|nan>nan</a>
ru: <c/> int pos = strfind("abcdef", "ab"); // позиция будет 0 int pos = strfind("abcdef", "de"); // позиция будет 3 int pos = strfind("abcdef", "xy"); // позиция будет <a cbot|nan>nan</a>

source: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Type <code>string</code>
ru: Тип <code>string</code>

source: Use a variable of this type for storing characters or strings.
ru: Используйте переменную этого типа для хранения символов или строк.

source: For example:
ru: Например:

source: <c/> "Hello!" "This is a string" "x" "" // empty string
ru: <c/> "Привет!" "Это строка" "х" "" // пустая строка

source: You can append two strings with the <code>+</code> operator :
ru: Вы можете соединить две строки с помощью оператора <code>+</code> :

source: <c/> "Good morning," + " " + "Sir"
ru: <c/> "Доброе утро," + " " + "сударь"

source: Returns the string:
ru: Получится строка:

source: <c/> "Good morning, Sir"
ru: <c/> "Доброе утро, сударь"

source: If you want to put a quotation mark (") or a backslash (\) in a string you must write:
ru: Если вы хотите поместить в строку кавычку (") или обратную косую черту (\), вы должны написать:

source: <c/>"This is \"very\" important"
ru: <c/>"Это \"очень\" важно"

source: <n/>which will result in the string <c/> This is "very" important.
ru: <n/>в результате приведет к строке <c/> Это "очень" важно.

source: <n/>will result in <c/>%user%\ant.txt
ru: <n/>приведет к <c/>%user%\ant.txt

source: Following instructions can be used with strings: <code><a cbot|strlen>strlen</a> </code>Get string length <code><a cbot|strleft>strleft</a> </code>Extract left part <code><a cbot|strright>strright</a> </code>Extract right part <code><a cbot|strmid>strmid</a> </code>Extract center part <code><a cbot|strfind>strfind</a> </code>Find a substring. <code><a cbot|strval>strval</a> </code>Convert string to number <code><a cbot|strupper>strupper</a> </code>Convert to upper case <code><a cbot|strlower>strlower</a> </code>Convert to lower case
ru: Following instructions can be used with strings: <code><a cbot|strlen>strlen</a> </code>Получить длину строки <code><a cbot|strleft>strleft</a> </code>Извлечь левую часть <code><a cbot|strright>strright</a> </code>Извлечь правую часть <code><a cbot|strmid>strmid</a> </code>Извлечь центральную часть <code><a cbot|strfind>strfind</a> </code>Найти подстроку. <code><a cbot|strval>strval</a> </code>Преобразовать строку в число. <code><a cbot|strupper>strupper</a> </code>Преобразовать в верхний регистр. <code><a cbot|strlower>strlower</a> </code>Преобразовать в нижний регистр

source: Instruction <code>strleft</code>
ru: Инструкция <code>strleft</code>

source: Extracts the first (that is, leftmost) characters from a string.
ru: Извлекает первые (то есть крайние левые) символы из строки.

source: Number of characters to be extracted.
ru: Количество извлекаемых символов.

source: <c/> string s = strleft("abcdef", 2); // s is "ab" string s = strleft("abc", 10); // s is "abc"
ru: <c/> string s = strleft("abcdef", 2); // s == "ab" string s = strleft("abc", 10); // s == "abc"

source: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>strlen</code>
ru: Инструкция <code>strlen</code>

source: Get the length of a string.
ru: Получает длину строки.

source: <c/> int len = strlen("abc"); // len is 3 int len = strlen(""); // len is 0 if ( strlen(s) == 0 ) // is string empty ?
ru: <c/> int len = strlen("abc"); // длина = 3 int len = strlen(""); // длина = 0 if ( strlen(s) == 0 ) // строка пуста ?

source: <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>strlower</code>
ru: Инструкция <code>strlower</code>

source: Convert all characters in a string to lowercase.
ru: Преобразует все символы в строке в нижний регистр.

source: <c/> string s = strlower("Abc"); // s is "abc"
ru: <c/> string s = strlower("Abc"); // s == "abc"

source: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>strmid</code>
ru: Инструкция <code>strmid</code>

source: Extracts a substring of a given length starting at a given position from a string.
ru: Извлекает из строки подстроку заданной длины, начиная с заданной позиции.

source: The index of the first character that is to be included in the extracted substring.
ru: Индекс первого символа, который должен быть включён в извлечённую подстроку.

source: <c/> string s = strmid("abcdef", 1, 2); // s is "bc" string s = strmid("abcdef", 4, 5); // s is "ef" string s = strmid("abcdef", 9, 2); // s is ""
ru: <c/> string s = strmid("abcdef", 1, 2); // s == "bc" string s = strmid("abcdef", 4, 5); // s == "ef" string s = strmid("abcdef", 9, 2); // s == ""

source: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>strright</code>
ru: Инструкция <code>strright</code>

source: Extracts the last (that is, rightmost) characters from a string.
ru: Извлекает последние (то есть крайние правые) символы из строки.

source: <c/> string s = strright("abcdef", 2); // s is "ef" string s = strright("abc", 10); // s is "abc"
ru: <c/> string s = strright("abcdef", 2); // s == "ef" string s = strright("abc", 10); // s == "abc"

source: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>strupper</code>
ru: Инструкция <code>strupper</code>

source: Convert all characters in a string to uppercase.
ru: Преобразует все символы в строке в верхний регистр.

source: <c/> string s = strupper("Abc"); // s is "ABC"
ru: <c/> string s = strupper("Abc"); // s == "ABC"

source: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strval>strval</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>strval</code>
ru: Инструкция <code>strval</code>

source: Convert a string to a number. Don't confuse the string <code>"45"</code> that contains actually the two characters <code>4</code> and <code>5</code> and the number <code>45</code>.
ru: Преобразует строку в число. Не путайте строку <code>"45"</code>, которая содержит в себе на самом деле два символа - <code>4</code> и <code>5</code>, и число <code>45</code>.

source: <c/> string s = "45"+"12"; // s contains "4512" float n = 45 + 12; // n contains 67
ru: <c/> string s = "45"+"12"; // s содержит "4512" float n = 45 + 12; // n содержит 67

source: <c/> float n = strval("1.23"); // n is 1.23 float n = strval("12abc45"); // n is 12 float n = strval("abc"); // n is 0 float n = strval("100")+2; // n is 102
ru: <c/> float n = strval("1.23"); // n == 1.23 float n = strval("12abc45"); // n == 12 float n = strval("abc"); // n == 0 float n = strval("100")+2; // n == 102

source: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|strlen>strlen</a></code>, <code><a cbot|strleft>strleft</a></code>, <code><a cbot|strright>strright</a></code>, <code><a cbot|strmid>strmid</a></code>, <code><a cbot|strfind>strfind</a></code>, <code><a cbot|strupper>strupper</a></code>, <code><a cbot|strlower>strlower</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>synchronized</code> (for specialists)
ru: Инструкция <code>synchronized</code> (для специалистов)

source: A <a cbot|class>class</a> method can be declared <code>synchronized</code>. This is to make sure that the method is never being executed by more than one bot at the same time.
ru: Метод <a cbot|class>класс</a> может быть объявлен с помощью <code>synchronized</code>. Это сделано для того, чтобы метод никогда не выполнялся более чем одним ботом одновременно.

source: The following example illustrates the problem:
ru: Следующий пример иллюстрирует проблему:

source: class blocking { static int nb = 33; synchronized int inc( ) { int val = nb; wait ( 2 ); // wait 2 sec. nb = nb + 1; return val; } }
ru: class blocking { static int nb = 33; synchronized int inc( ) { int val = nb; wait ( 2 ); // ждать 2 секунды. nb = nb + 1; return val; } }

source: What happens if two bots execute the <code>inc</code> method at the same time? Both of them will execute <code>val=nb</code> and wait 2 seconds so both of them will have <code>val=33</code>. With <code>synchronized</code> the first bot starts execution with <code>val=33</code> and then waits 2 seconds and returns. Only once the first bot has returned from the <code>inc</code> method, the second bot will be allowed to enter the <code>inc</code> method and therefore the second bot will always have <code>val=34</code>.
ru: Что произойдёт если два бота будут выполнять метод <code>inc</code> в одно время? Оба они будут выполнять <code>val=nb</code> и ждать две секунды, так что один из них будет иметь <code>val=33</code>. С помощью <code>synchronized</code> первый бот начнет выполнение с <code>val=33</code> и подождет 2 секунды, а затем вернет значение. Только после того, как первый бот вернет значение из метода <code>inc</code>, второй бот начнет выполнять метод <code>inc</code> и, следовательно, второй бот будет всегда иметь <code>val=34</code>.

source: You can have more than one synchronized method in your <a cbot|class>class</a> in order to prevent simultaneous execution across more than one method. In other words: as long as a bot's program is inside a synchronized method, no other bot can enter any synchronized method of the same class.
ru: У вас может быть более одного синхронизированного метода в вашем <a cbot|class>классе</a>, чтобы предотвратить одновременное выполнение более чем одного метода. Другими словами: пока программа бота находится внутри синхронизированного метода, никакой другой бот не может вводить какой-либо синхронизированный метод того же класса.

source: <code><a cbot|class>class</a></code>, <code><a cbot|static>static</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|static>static</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Semicolon
ru: Точка с запятой

source: Always use a semicolon <c/>;<n/> after a simple expression. For example:
ru: Всегда используйте точку с запятой <c/>;<n /> после простого выражения. Например:

source: However, after a <a cbot|bloc>bloc</a>, never put a semicolon:
ru: Однако после <a cbot|bloc>блока</a> никогда не ставьте точку с запятой:

source: { float dist; dist = distance(p1, p2); } <n/>// no semicolon here!<c/>
ru: { float dist; dist = distance(p1, p2); } <n/>// здесь точки с запятой нет!<c/>

source: Do not use a semicolon either immediately after the instructions <code><a cbot|while>while</a></code>, <code><a cbot|if>if</a></code> or <code><a cbot|for>for</a></code>:
ru: Не ставьте точку с запятой сразу после инструкций <code><a cbot|while>while</a></code>, <code><a cbot|if>if</a></code> и <code><a cbot|for>for</a></code>:

source: if ( a < b ) <n/>// no semicolon here!<c/> { b = 100-a; }
ru: if ( a < b ) <n/>// здесь нет точки с запятой!<c/> { b = 100-a; }

source: An instruction is always ended by a semicolon, and not by the end of the line. So you can very well put several instructions on the same line:
ru: Инструкция всегда заканчивается точкой с запятой, а не концом строки. Так что вы вполне можете поместить несколько инструкций в одну строку:

source: Is equivalent to:
ru: Это эквивалентно:

source: Instruction <code>testinfo</code>
ru: Инструкция <code>testinfo</code>

source: Tests if an information exists in the closest <a object|exchange>information exchange post</a>.
ru: Проверяет, существует ли информация в ближайшем <a object|exchange>Пункте Обмена Информацией</a>.

source: Name of the information to be tested in the exchange post. This name is a string: it must be written in quotation marks "".
ru: Название информации для проверки в Пункте Обмена Информацией. Это название является строкой: его нужно писать в кавычках "".

source: Power of the transmitter, which corresponds to the maximal distance between the transmitter and the exchange post. If the distance is longer, the function returns <code>false</code>. Default value is 10 metres.
ru: Мощность передатчика, соответствующая максимальному расстоянию между передатчиком и Пунктом Обмена Информацией. Если расстояние больше, функция возвращает <code>false</code>. Значение по умолчанию - 10 метров.

source: Return: <code><a cbot|bool>bool</a></code>
ru: Возвращает значение: <code><a cbot|bool>bool</a></code>

source: Return <code>true</code> if the information exists. Return and <code>false</code> if the information does not exist or if the receiver is too far away from the exchange post.
ru: Возвращает <code>true</code>, если информация существует. Возвращает и <code>false</code>, если информация не существует или если получатель находится слишком далеко от Пункта Обмена Информацией.

source: <code><a cbot|receive>receive</a></code>, <code><a cbot|send>send</a></code> and <code><a cbot|delinfo>deleteinfo</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|receive>receive</a></code>, <code><a cbot|send>send</a></code> и <code><a cbot|delinfo>deleteinfo</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>this</code>
ru: Инструкция <code>this</code>
