Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: Files can only be created and opened in the files/ folder which is located in the folder inside Colobot save directory. You cannot not create or open files that are located elsewhere than in the files/ folder.
ru: Файлы можно создавать и открывать только в файлах/папке, которая находится в папке Colobot. Вы не можете создавать и открывать файлы, которые находятся где-либо еще, кроме в файлах/папке.

source: <code><a cbot|file>file</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code>, <code><a cbot|writeln>writeln</a></code> and <code><a cbot|eof>eof</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|file>file</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code>, <code><a cbot|writeln>writeln</a></code> и <code><a cbot|eof>eof</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>openfile</code>
ru: Инструкция <code>openfile</code>

source: Type <code>point</code>
ru: Тип <code>point</code>

source: Variables of this type contain the coordinates of a point in space. This type is made of three values that represent the <code>x</code>, <code>y</code> and <code>z</code> coordinates. <code>x</code> and <code>y</code> correspond to the place on the ground. The positive <code>x</code> axis faces towards east, the positive <code>y</code> axis faces towards north. The <code>z</code> value corresponds to the altitude above sea level.
ru: Переменные этого типа содержат координаты точки в пространстве. Этот тип состоит из трех значений, которые представляют координаты <code>x</code>, <code>y</code> и <code>z</code>. <code>x</code> и <code>y</code> соответствуют месту на земле. Положительная ось <code>x</code> направлена на восток, положительная ось <code>y</code> направлена на север. Значение <code>z</code> соответствует высоте над уровнем моря.

source: If you want to declare a variable of type point, you can write:
ru: Если вы хотите объявить переменную типа point, вы можете написать:

source: You can also set the variable taking one value after another:
ru: Вы также можете установить переменную, принимающую одно значение за другим:

source: With these examples, the following <a cbot|cond>condition</a> is true:
ru: В этих примерах, следующее <a cbot|cond>условие</a> будет истинным:

source: <n/> The following declaration :
ru: <n/> Следующее объявление :

source: Is equivalent to :
ru: Эквивалентно :

source: References (for specialists)
ru: Ссылки (для специалистов)

source: CBOT uses references for <a cbot|class>classes</a> and <a cbot|array>arrays</a>. Any class variable actually contains a reference to the instance. The instance actually contains the class fields. Several references can reference the same instance. A <code><a cbot|null>null</a></code> reference references nothing. You can compare an instance to a suitcase and a reference to a carrier. Each time we need a new suitcase we create a new instance with a carrier. But a suitcase can be carried by more than one carrier. A carrier who carries no suitcase is a <code><a cbot|null>null</a></code> reference.
ru: CBOT использует ссылки для <a cbot|class>классов</a> и <a cbot|array>массивов</a>. Любой класс содержит в себе ссылку на данный экземпляр. Экземпляр на самом деле содержит в себе ячейки классов. Некоторые ссылки могут ссылаться на ту же функцию. <code><a cbot|null>null</a></code> ссылка ссылается ни на что. Вы можете сравнить экземпляр с чемоданом и ссылку с перевозчиком. Каждый раз, когда нам нужен новый чемодан, мы создаем новый экземпляр с перевозчиком. Но чемодан может перевозить не один перевозчик. Перевозчик, который не несёт чемодана, является <code><a cbot|null>null</a></code> ссылкой.

source: Example: <c/><s/>{
ru: Например: <c/><s/>{

source: MyClass item1(); // create a new instance // referenced by item1 MyClass item2; // create a null reference item2 = item1; // copy the reference, // item2 and item1 now reference // the same instance item1.a = 12; // modifies the instance // referenced by item1 (and item2) message(item2.a);// displays 12 }
ru: MyClass item1(); // создаёт новый экземпляр // ссылающийся на item1 MyClass item2; // создаём нулевую ссылку item2 = item1; // копируем ссылку, // item2 and item1 теперь ссылки // какого-то экземпляра item1.a = 12; // изменяем экземпляр // ссылающийся на item1 (и item2) message(item2.a);// выводим 12 }

source: If you pass a <a cbot|class>class</a> instance as parameter to a function, the function only receives a reference to the instance. That means if you modify the instance in the function, the instance that has been specified by the caller will be actuallay modified.
ru: Если вы передадите экземпляр <a cbot|class>класс</a> в качестве параметра функции, функция получит только ссылку на этот экземпляр. Это означает, что если вы измените экземпляр в функции, экземпляр, указанный вызывающей стороной, будет фактически изменён.

source: { item.a = 12; // modify the original instance item = new MyClass(); // new local instance item.a = 33; // modifie the local instance }
ru: { item.a = 12; // изменяем локальный экземпляр item = new MyClass(); // создаём новый item.a = 33; // изменяем локальный экземпляр }

source: Calling the fucntion <code>Test()</code>: <c/><s/>{
ru: Вызов функции <code>Test()</code>: <c/><s/>{

source: MyClass toto(); Test(toto); message(toto.a); // displays 12 }
ru: MyClass toto(); Test(toto); message(toto.a); // выводим 12 }

source: The instance containing the field <code>a = 33</code> is referenced only by the newly created instance <code>item</code> inside the fucntion <code>Test</code>. At the end of <code>Test</code> this newly created instance referenced by <code>item</code> is automatically deleted.
ru: Экземпляр, содержащий поле <code>a = 33</code> ссылается на более новый экземпляр <code>item</code> внутри функции <code>Test</code>. В конце функции <code>Test</code> недавно созданная ссылка <code>item</code> будет автоматически удалена.

source: A function can return an instance: <c/><s/>MyClass Test2( )
ru: Функция может возвратить экземпляр: <c/><s/>MyClass Test2( )

source: Call the function like this: <c/><s/>{
ru: Вызов функции, как здесь: <c/><s/>{

source: MyClass toto; toto = Test2(); // toto will contain a reference to // the instance created by Test2() message(toto.a); // displays 33 }
ru: MyClass toto; toto = Test2(); // toto содержит ссылку на // созданный экземпляр Test2() message(toto.a); // выводим 33 }

source: <code><a cbot|class>class</a></code>, <code><a cbot|new>new</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|new>new</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>private</code> (for specialists)
ru: Инструкция <code>private</code> (для специалистов)

source: public class MyClass { int b; // public by default public int a; // also public private point position; // private } void Test() { MyClass item; item.a = item.b = 12; // ok message( item.position ); // this is an error }
ru: public class MyClass { int b; // доступная по-умолчанию public int a; // также доступная private point position; // локальная/личная } void Test() { MyClass item; item.a = item.b = 12; // ок message( item.position ); // это ошибка }

source: Instruction <code>public</code> (for specialists)
ru: Инструкция <code>public</code> (для специалистов)

source: This instruction has two distinct purposes:
ru: Эта команда имеет две различные цели:

source: Make a function available to other bots.
ru: Сделать функцию доступной для других ботов.

source: Make a class member accessible from outside the class definition.
ru: Сделать член класса доступным извне для других классов.

source: Instruction <code>public</code> for functions
ru: Инструкция <code>public</code> для функций

source: If you put <code>public</code> before a <a cbot|function>function</a> definition, you can make the function available to programs in other bots in the same mission.
ru: Если вы напишете <code>public</code> перед определением <a cbot|function>функции</a>, то вы сможете сделать эту программу доступной для других ботов.

source: For example in the first bot we would have:
ru: Например, вот программа первого бота:

source: And in another bot we would have:
ru: А в другом боте мы имеем:

source: If you have declared a function <code>public</code>, you cannot define a function with the same name and arguments in another bot of the same mission.
ru: Если вы объявили функцию <code>public</code>, вы не можете определить функцию с тем же именем и аргументами в другом боте в той же миссии.

source: If a bot containing a <code>public</code> function is destroyed, the other bots that make use of this function will be stopped with an error.
ru: Если бот, содержащий <code>public</code> функцию будет уничтожен, другие боты, использующие эту функцию, будут остановлены с ошибкой.

source: Instruction <code>public</code> for classes
ru: Инструкция <code>public</code> для классов

source: public class MyClass { int b; // public by default public int a; // also public private point position; // privat } void Test() { MyClass item; item.a = item.b = 12; // ok message( item.position ); // this is an error }
ru: public class MyClass { int b; // доступная по умолчанию public int a; // также доступная private point position; // личная } void Test() { MyClass item; item.a = item.b = 12; // ок message( item.position ); // это ошибка }

source: Instruction <code>radar</code>
ru: Инструкция <code>radar</code>

source: Write in brackets the <a cbot|category>name of the object</a> that you look for. Put the result in a variable of the <a cbot|type>type</a> <code>object</code>. Here is an example that looks for the closest ant:
ru: Напишите в скобках <a cbot|category>название объекта</a>, который Вы ищете. Поместите результат в переменную <a cbot|type>типа</a> <code>object</code>. Вот пример, который ищет ближайшего муравья:

source: // At the beginning of the program: object item; // variable declaration // Look for the closest ant item = radar(AlienAnt);
ru: // В начале программы: object item; // объявление переменной // Поиск ближайшего муравья item = radar(AlienAnt);

source: Detects an object according to several parameters.
ru: Обнаруживает объект по нескольким параметрам.

source: Seen from above, the purple zone corresponds to the zone where objects will be detected.
ru: При взгляде сверху фиолетовая зона соответствует зоне обнаружения объектов.

source: Direction that the radar is facing, in degrees. <code> 0</code> -> radar is facing straight ahead <code>-90</code> -> radar is facing a quarter turn right <code> 90</code> -> radar is facing a quarter turn left
ru: Направление, в котором смотрит радар, в градусах. <code> 0</code> -> радар смотрит прямо вперед <code>-90</code> -> радар смотрит на четверть круга вправо <code> 90</code> -> радар смотрит на четверть круга влево

source: Opening angle of the radar, in degrees.
ru: Угол раскрытия радара в градусах.

source: Minimum detection distance, in meters. Objects that are closer than the minimum distance will not be detected.
ru: Минимальная дальность обнаружения в метрах. Объекты, расположенные ближе минимального расстояния, обнаруживаться не будут.

source: Maximum detection distance, in meters. Objects that are farther away than the maximum distance will not be detected.
ru: Максимальное расстояние обнаружения в метрах. Объекты, которые находятся дальше максимального расстояния, не будут обнаружены.

source: Determines which way the objects are detected. With value <code>1</code>, returns the closest object found in the specified zone. With value <code>-1</code>, the farthest object in the zone will be returned.
ru: Определяет способ обнаружения объектов. При значении <code>1</code> возвращает ближайший объект, найденный в указанной зоне. При значении <code>-1</code> будет возвращен самый дальний объект в зоне.

source: Return value: <code><a cbot|object>object</a></code>
ru: Возвращает значение: <code><a cbot|object>object</a></code>

source: Returns the first object found that corresponds to the specified category in the specified zone. If no object was found, returns the value <code><a cbot|null>null</a></code>.
ru: Возвращает первый найденный объект, соответствующий указанной категории в указанной зоне. Если объект не найден, возвращает значение <code><a cbot|null>null</a></code>.

source: Remark
ru: Примечание

source: You do not have to give all the parameters. Here are two examples of instructions that are equivalent:
ru: Необязательно указывать все параметры. Вот два примера эквивалентных инструкций:

source: radar(Titanium, 0, 360, 0, 1000); radar(Titanium); // equivalent
ru: radar(Titanium, 0, 360, 0, 1000); radar(Titanium); // эквивалентна

source: radar(Titanium, 0, 90, 0, 1000); radar(Titanium, 0, 90); // equivalent
ru: radar(Titanium, 0, 90, 0, 1000); radar(Titanium, 0, 90); // эквивалентна

source: When one or more parameters are not specified, the default values indicated above are used instead; only the first parameter is compulsory. Generally, only the first parameter is specified: f. ex. <code>radar (AlienAnt)</code> detects the closest ant, wherever it may be.
ru: Если один или несколько параметров не указаны, вместо них используются значения по умолчанию, указанные выше; только первый параметр является обязательным. Обычно указывается только первый параметр: <code>радар(AlienAnt)</code> обнаруживает ближайшего муравья, где бы он ни находился.

source: Instruction <code>readln</code>
ru: Инструкция <code>readln</code>

source: Read one line from an open file in the files/ folder. This is a method of the <code><a cbot|file>file</a></code> class. This is the reason why we always write <code>handle.readln()</code>:
ru: Читает одну строку из открытого файла в файлах/папке. Это метод класса <code><a cbot|file>file</a></code>. Вот почему мы всегда пишем <code>handle.readln()</code>:

source: The file must have been opened for reading (<code>"r"</code>) with the <code><a cbot|open>open</a></code> instruction. <code>readln</code> returns the string containing the whole line but without the end of line characters 0x0D (CR) and 0x0A (LF).
ru: Файл должен быть открыт для чтения (<code>"r"</code>) с помощью инструкции <code><a cbot|open>open</a></code>. <code>readln</code> возвращает строку, содержащую всю строку, но без символов конца строки 0x0D (CR) и 0x0A (LF).

source: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|writeln>writeln</a></code> and <code><a cbot|eof>eof</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|writeln>writeln</a></code> и <code><a cbot|eof>eof</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>receive</code>
ru: Инструкция <code>receive</code>

source: Retrieves an information from the closest <a object|exchange>information exchange post</a>.
ru: Получает информацию из ближайшего <a object|exchange>Пункта Обмена Информацией</a>.

source: Name of the information required from the exchange post. This name is a string: it must be written in quotation marks "".
ru: Название информации, необходимое для обмена. Это название является строкой: его нужно писать в кавычках "".

source: Power of the receiver, which corresponds to maximal distance between the receiver and the exchange post. If the distance is longer, no information is received. Default value is 10 metres.
ru: Мощность приёмника, соответствующая максимальному расстоянию между приёмником и Пунктом Обмена Информацией. Если расстояние больше, информация не поступает. Значение по умолчанию - 10 метров.

source: Value of the retrieved information. If no exchange post is close enough, or if the name of the requested information does not exist in the exchange post, the value <code>nan</code> is returned.
ru: Значение полученной информации. Если вблизи нет Пункта Обмена Информацией или если название запрошенной информации не существует на Пункте Обмена Информацией, возвращается значение <code>nan</code>.

source: <code><a cbot|send>send</a></code>, <code><a cbot|testinfo>testinfo</a></code> and <code><a cbot|delinfo>deleteinfo</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|send>send</a></code>, <code><a cbot|testinfo>testinfo</a></code> и <code><a cbot|delinfo>deleteinfo</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>recycle</code>
ru: Инструкция <code>recycle</code>

source: Recycles the derelict bot in front of the <a object|botrecy>recycler</a> into a <a object|titan>titanium cube</a>.
ru: Перерабатывает брошенного бота перед <a object|botrecy>Утилизатором</a> в <a object|titan>Титан</a>.

source: Zero if OK, or a value different from zero if an error occurred. <code>== 0 </code>the derelict bot has been recycled <code>!= 0 </code>error, no derelict bot could be recycled
ru: Если все нормально, то возвращает ноль, если же возникла ошибка, то какое-то число. <code>== 0 </code>брошенный бот был переработан <code>!= 0 </code>ошибка, брошенного бота нельзя переработать

source: Instruction <code>retobject</code>
ru: Инструкция <code>retobject</code>

source: Returns the object corresponding to the given number.
ru: Возвращает объект, соответствующий заданному числу.

source: Number of the object, between 0 and n. "n" represents the total number of objects in the scene.
ru: Номер объекта от 0 до n. "n" представляет общее количество объектов в сцене.

source: Object corresponding to the number. The return value <code><a cbot|null>null</a></code> means that no object corresponds to this number, because the number was too high, and there are not so many objects in the scene.
ru: Объект привязывается к номеру. Возвращаемое значение <code><a cbot|null>null</a></code> означает, что ни один объект не соответствует этому номеру, потому что это число было слишком большим, и в сцене не так много объектов.

source: Instruction <code>return</code>
ru: Инструкция <code>return</code>

source: Returns from a function. Syntax:
ru: Возврат из функции. Синтаксис:

source: void function ( ) { return; }
ru: <c/>void function ( ) { return; }

source: If the <a cbot|function>function</a> has a return type, the <code>return</code> instruction must be followed by the value to be returned:
ru: Если <a cbot|function>функция</a> имеет возвращаемый тип, за инструкцией <code>return</code> должно следовать возвращаемое значение:

source: string Sign (float a) { if ( a > 0 ) return "positive"; if ( a < 0 ) return "negative"; return "null"; }
ru: string Sign (float a) { if ( a > 0 ) return "положительное"; if ( a < 0 ) return "отрицательное"; return "null"; }

source: Instruction <code>search</code>
ru: Инструкция <code>search</code>

source: <code>search</code> returns the object of the given category that is closest to the position indicated here.
ru: <code>search</code> возвращает объект данной категории, ближайший к указанной позиции.

source: Characteristics of the object that has been found. The value <code><a cbot|null>null</a></code> means that no object of this category has been found.
ru: Характеристики найденного объекта. Значение <code><a cbot|null>null</a></code> означает, что ни один объект этой категории не был найден.

source: Instruction <code>send</code>
ru: Инструкция <code>send</code>

source: Sends an information to the closest <a object|exchange>information exchange post</a>.
ru: Отправляет информацию на ближайший <a object|exchange>Пункт Обмена Информацией</a>.

source: Name of the information to be sent to the exchange post. This name is a string: it must be written in quotation marks "". If there is any information having this name, a new entry is created, as far as the total number of entries does not exceed 10. If there is already an information having this name, value is simply replaced by the new.
ru: Название информации, которая будет отправлена на Пункт Обмена Информацией. Это название является строкой: его нужно писать в кавычках "". Если есть какая-либо информация с таким названием, создаётся новая запись, если общее количество записей не превышает 10. Если уже существует информация с таким названием, значение просто обновится.

source: Value of the information to be sent.
ru: Значение отправляемой информации.

source: Power of the transmitter, which corresponds to the maximal distance to where information can be the sent. Default value is 10 metres.
ru: Мощность передатчика, соответствующая максимальному расстоянию, на которое может быть отправлена информация. Значение по умолчанию - 10 метров.

source: <code><a cbot|receive>receive</a></code>, <code><a cbot|testinfo>testinfo</a></code> and <code><a cbot|delinfo>deleteinfo</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|receive>receive</a></code>, <code><a cbot|testinfo>testinfo</a></code> и <code><a cbot|delinfo>deleteinfo</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>shield</code>
ru: Инструкция <code>shield</code>

source: Activates or deactivates the shield of the <a object|botshld>ahielder</a>. You can of course move the shielder when the shield is active. It protects all objects that are inside the shielded sphere from enemy fire. The radius of the sphere can range between 10 and 25 meters.
ru: Разворачивает или сворачивает щит <a object|botshld>Защитника</a>. Конечно, вы можете перемещать Защитника, когда щит развёрнут. Он защищает все объекты, находящиеся внутри сферы щита, от вражеского огня. Радиус сферы может составлять от 10 до 25 метров.

source: <code>1</code> activates the shield. <code>0</code> deactivates the shield A normal <a object|power>power cell</a> fully charged can maintain the shield active during 20 seconds. When the cell is empty, the shield deactivates.
ru: <code>1</code> развернуть щит. <code>0</code> свернуть щит Полностью заряженная <a object|power>Батарея Обычная</a> может поддерживать щит в развёрнутом состоянии в течение 20 секунд. Когда Батарея опустеет, щит свернётся.

source: Radius of the shield, ranging between 10 and 25 meters.
ru: Радиус действия щита от 10 до 25 метров.

source: Instruction <code>sizeof</code>
ru: Инструкция <code>sizeof</code>

source: The sizeof function lets you know the number of elements contained in an <a cbot|array>array</a>. That is the index of the last element plus one ("empty" elements are counted).
ru: Функция sizeof позволяет узнать количество элементов, содержащихся в <a cbot|array>массиве</a>. Это индекс последнего элемента плюс один («пустые» элементы подсчитываются).

source: { int a[12]; a[5] = 345; message( sizeof(a) ); // will display 6 }
ru: { int a[12]; a[5] = 345; message( sizeof(a) ); // покажет 6 }

source: In this example we have 6 elements in the array after <code>a[5]=345</code>. The non initialized elements <code>[0]</code>, <code>[1]</code>, <code>[2]</code>, <code>[3]</code> and <code>[4]</code> will be counted.
ru: В этом примере мы имеем 6 элементов в массиве после <code>a[5]=345</code>. Не инициализированные элементы - <code>[0]</code>, <code>[1]</code>, <code>[2]</code>, <code>[3]</code> и <code>[4]</code> будут посчитаны.
