Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <c/>grab();<n/>. <code>== 0 </code>an object was grabbed <code>!= 0 </code>error, no object was grabbed
ru: Обычно программа останавливается из-за ошибки. Вы можете предотвратить остановку программы при ошибках, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В случае ошибки <c/>grab();<n/> возвращает значение отличное от нуля. <code>== 0 </code>объект подобран <code>!= 0 </code>ошибка, объект не подобран

source: Instructions <code>if</code> and <code>else</code>
ru: Инструкции <code>if</code> и <code>else</code>

source: With the instruction <code>if() {}</code> you can execute a set of instructions only if a certain condition is true. Write the condition in brackets <code>()</code>, and the instructions in braces <code>{}</code>.
ru: С помощью инструкции <code>if() {}</code> вы можете выполнить набор инструкций, только если выполняется определённое условие. Пишите условие в круглых скобках <code>()</code>, а инструкции в фигурных скобках <code>{}</code>.

source: Here is a concrete example: The bot will shoot only if the target is closer than 40 meters:
ru: Вот конкретный пример: бот будет стрелять, только если цель находится ближе 40 метров:

source: You can also test if an object exists at all. If the instruction <c/><a cbot|radar>radar</a>();<n/> does not find the requested object, it returns the value <code>null</code>. So you can test if an object does not exists with the condition <code>(item == null)</code>, or test if it exists with <code>(item != null)</code>. Two equal signs <code>==</code> test equality, an exclamation mark followed by an equal sign <code>!=</code> test inequality. Here is a test that will go to rechage the <a object|power>power cell</a> only if there is a <a object|station>power station</a>:
ru: Вы также можете проверить, существует ли вообще объект. Если инструкция <c/><a cbot|radar>radar</a>();<n/> не находит запрошенный объект, она возвращает значение <code>null</code>. Таким образом, вы можете проверить, существует ли объект с условием <code>(item == null)</code>, или проверить, существует ли он с помощью <code>(item != null)</code>. Два знака равенства <code>==</code> проверяют равенство, восклицательный знак, за которым следует знак равенства <code>!=</code> проверяют неравенство. Вот тест, который будет выполняться для повторной замены <a object|power>Батареи</a>, только если есть <a object|station>Энергозаправка</a>:

source: <code>if ( condition ) { </code>Instructions A ...<code> } else { </code>Instructions B ...<c/> }
ru: <code>if ( условие ) { </code>Инструкции A ...<code> } else { </code>Инструкции B ...<c/> }

source: With this conditional structure you can execute a <a cbot|bloc>bloc</a> A or a <a cbot|bloc>bloc</a> B depending on a <a cbot|cond>condition</a>. If the condition is true, bloc A is executed. If the condition is false, bloc B is executed. Part <code>else { }</code> is not compulsory.
ru: С помощью этой условной структуры вы можете выполнить <a cbot|bloc>блок</a> A или <a cbot|bloc>блок</a> B в зависимости от <a cbot|cond>условия</a>. Если условие выполняется, блок А выполняется. Если условие ложно, выполняется блок B. Часть <code>else { }</code> не является обязательной.

source: Do not put a <a cbot|term>semicolon</a> at the end of the line <code>if ( )</code>.
ru: Не ставьте <a cbot|term>точку с запятой</a> в конце строки <code>if ( )</code>.

source: Type <code>int</code>
ru: Тип <code>int</code>

source: Use this type for variables that contain only whole numbers, negative or positive. For example:
ru: Используйте этот тип для переменных, которые содержат только целые числа, отрицательные или положительные. Например:

source: To represent real numbers like 12.05 or -0.005, use the type <code><a cbot|float>float</a></code>.
ru: Чтобы представить действительные числа, такие как 12.05 или -0.005, используйте тип <code><a cbot|float>float</a></code>.

source: Do not put space or colon signs inside a number.
ru: Не ставьте пробелы или двоеточия внутри числа.

source: Numbers of the type <code>int</code> are represented with 32 bits. The highest number that can be represented is (2^31)-1, that is 2'147'483'647. The smallest number that can be represented is -(2^31), that is -2'147'483'648.
ru: Числа типа <code>int</code> представлены 32-битными. Наибольшее число, которое можно представить (2^31)-1, это 2'147'483'647. Наименьшее число, которое можно представить -(2^31), это -2'147'483'648.

source: Instruction <code>jet</code>
ru: Инструкция <code>jet</code>

source: Direct control of the jet of a <a object|botgj>winged bot</a>. The jet is what makes the bot fly. Use this instruction in order to take off, climb, descend or land.
ru: Прямое управление реактивным двигателем <a object|botgj>Бота Крылатого</a>. Именно реактивный двигатель заставляет бота летать. Используйте эту инструкцию для взлёта, набора высоты, спуска или приземления.

source: Power of the jet, ranges between <code>-1</code> and <code>+1</code>. <c/>jet(1);<n/> instructs the bot to climb as fast as possible, <c/>jet(-1);<n/> descends as fast as possible, <c/>jet(0);<n/> stabilizes the altitude. In order to get slower altitude changes, use intermediate values, for example <c/>jet(0.3);<n/>.
ru: Сила реактивного двигателя, варьируется между <code>-1</code> и <code>+1</code>. <c/>jet(1);<n/> приказывает боту подняться как можно быстрее, <c/>jet(-1);<n/> опуститься как можно быстрее, <c/>jet(0);<n/> стабилизировать высоту. Чтобы изменять высоту медленнее, используйте среднее значение, например <c/>jet(0.3);<n/>.

source: Return value: <code><a cbot|void>void</a></code>
ru: Возвращает значение: <code><a cbot|void>void</a></code>

source: None.
ru: Ничего.

source: Instruction <code>message</code>
ru: Инструкция <code>message</code>

source: Prints a message on top of the screen. After a few seconds, the message disappears automatically.
ru: Выводит сообщение в верхней части экрана. Через несколько секунд сообщение автоматически исчезнет.

source: Text that is to be displayed. It is possible to append several texts and/or values with the operator <code>+</code>: <c/>message("Not found");<n/> <c/>message(angle);<n/> <c/>message(n + " object(s) found");<n/> <c/>message("Distance = " + dist + " meters");<n/>
ru: Текст, который требуется отобразить. Возможно присоединить несколько кусков текста и/или значение с оператором <code>+</code>: <c/>message("не найден");<n/> <c/>message(angle);<n/> <c/>message(n + " обьект(ы) найден");<n/> <c/>message("Расстояние = " + dist + " метров");<n/>

source: type: <code><a cbot|int>int</a></code> (default value <code>DisplayMessage</code>)
ru: type: <code><a cbot|int>int</a></code> (значение по умолчанию <code>DisplayMessage</code>)

source: <code>DisplayMessage</code> Standard message on yellow background.
ru: <code>DisplayMessage</code> Стандартное сообщение на жёлтом фоне.

source: <code>DisplayInfo </code> Information on green background.
ru: <code>DisplayInfo </code> Информация на зелёном фоне.

source: <code>DisplayWarning</code> Warning on blue background.
ru: <code>DisplayWarning</code> Предупреждение на синем фоне.

source: <code>DisplayError </code> Error on red background.
ru: <code>DisplayError </code> Ошибка на красном фоне.

source: Instruction <code>motor</code>
ru: Инструкция <code>motor</code>

source: The instruction <c/>motor( , );<n/> sets the speed for the left-hand and the right-hand motor of the bot.
ru: Инструкция <c/>motor( , );<n/> устанавливает скорости для правого и левого двигателей бота.

source: The speed given to the motors will remain constant during the execution of the following instructions. Thanks to this characteristic it is possible to perform a rotation during the instruction <c/><a cbot|fire>fire</a>();<n/>. This will sweep a whole zone with only one burst. Here is an example that will sweep the zone in front of the bot:
ru: Скорость, заданная двигателям, будет оставаться постоянной во время выполнения последующих инструкций. Благодаря этой характеристике можно выполнять вращение во время инструкции <c/><a cbot|fire>fire</a>();<n/>. Это охватит всю зону всего за одну очередь. Вот пример, который охватывает зону перед ботом:

source: <a cbot|turn>turn</a>(45); // turns 45 degrees left motor(0.5, -0.5); // slow rotation to the right <a cbot|fire>fire</a>(2); // fire motor(0,0); // stops the rotation
ru: <a cbot|turn>turn</a>(45); // поворачивает на 45 градусов влево motor(0.5, -0.5); // медленное вращение вправо <a cbot|fire>fire</a>(2); // огонь motor(0,0); // остановка вращения

source: With the left-hand motor turning half-speed forward and the right-hand motor turning half-speed backward, the bot will turn slowly on itself during the 2-second-burst.
ru: Когда левый двигатель вращается на половину скорости вперёд, а правый двигатель вращается на половину скорости назад, бот будет медленно поворачиваться на месте во время 2-секундного выстрела.

source: Gives speed instructions to the right and left motors of the robot. The motors will keep this speed until a new motor instruction is performed, or until a <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code> or <code><a cbot|goto>goto</a></code> instruction is performed.
ru: Даёт инструкции по скорости правому и левому моторам бота. Двигатели сохранят эту скорость до тех пор, пока не будет дана новая команда двигателям или пока не будет выполнены команды <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code> или <code><a cbot|goto>goto</a></code>.

source: Speed instruction for the left motor; the value must range between -1 and 1.
ru: Инструкция по скорости для левого мотора; значение должно находиться в диапазоне от -1 до 1.

source: Speed instruction for the right motor; the value must range between -1 and 1.
ru: Инструкция по скорости для правого мотора; значение должно находиться в диапазоне от -1 до 1.

source: Examples : <c/>motor(1, 1);<n/> moves forward with highest possible speed. <c/>motor(-0.5, -0.5);<n/> moves backward with half speed. <c/>motor(1, -1);<n/> turns right as fast as possible.
ru: Примеры : <c/>motor(1, 1);<n/> двигается вперёд с наибольшей возможной скоростью. <c/>motor(-0.5, -0.5);<n/> двигается назад на половине скорости. <c/>motor(1, -1);<n/> со всей возможной скоростью поворачивается направо.

source: Note : <c/>motor(2, 2);<n/> will not move forward any faster than <code>motor(1, 1)</code> <c/>motor(-2, -2);<n/> will not move backward any faster than <code>motor(-1, -1)</code>
ru: Замечание : <c/>motor(2, 2);<n/> будет двигаться вперёд не быстрее, чем <code>motor(1, 1)</code> <c/>motor(-2, -2);<n/> будет двигаться назад не быстрее, чем <code>motor(-1, -1)</code>

source: Instruction <code>move</code>
ru: Инструкция <code>move</code>

source: The instruction <c/>move();<n/> instructs the bot to move forward or backward while keeping the same orientation. In brackets you must specify the length of the move in meters.
ru: Инструкция <c/>move();<n/> приказывает боту двигаться вперёд или назад, придерживаясь того же направления. В скобках вы должны указать дальность перемещения в метрах.

source: If you want the bot to move forward 30 meters, write <c/>move(30);<n/>. In order to move the bot backward after it dropped a chunk of <a object|titanore>titanium ore</a> on the <a object|convert>converter</a>, write <c/>move(-2.5);<n/>.
ru: Если вы хотите, чтобы бот переместился вперёд на 30 метров, то напишите <c/>move(30);<n/>. Чтобы отправить бота назад после того, как он поставит кусок <a object|titanore>Руды Титановой</a> в <a object|convert>Преобразователь</a>, напишите <c/>move(-2.5);<n/>.

source: Moves forward or backward of a given distance, always keeping the current orientation of the bot.
ru: Перемещается вперед или назад на заданное расстояние, всегда сохраняя текущую ориентацию бота.

source: Length of the move, in meters. A negative value makes the bot move backward.
ru: Длина передвижения в метрах. Отрицательное значение заставляет бота двигаться назад.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <code>move()</code>. <code>== 0 </code>Move executed <code>!= 0 </code>error, the instruction was not performed correctly
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <code>move()</code> возвращает значение, отличное от нуля. <code>== 0 </code>Передвижение выполнено <code>!= 0 </code>ошибка, передвижение было выполнено соответствующим образом

source: Type <code>nan</code>
ru: Тип <code>nan</code>

source: This special value indicates that a <a cbot|var>variable</a> of type <code><a cbot|int>int</a></code> or <code><a cbot|float>float</a></code> contains no number, but "nothing". For example, if the instruction <code><a cbot|receive>receive</a></code> can not get the requested information, it returns <code>nan</code> :
ru: Это особое значение показывает, что <a cbot|var>переменная</a> типа <code><a cbot|int>int</a></code> или <code><a cbot|float>float</a></code> содержит не число, но "ничего". Например если инструкция <code><a cbot|receive>receive</a></code> не может получить запрашиваемую информацию, то она возвращает <code>nan</code> :

source: value = receive("Length"); if ( value == nan ) // not found ? { }
ru: value = receive("Length"); if ( value == nan ) // не найдена ? { }

source: Dictionnary
ru: Словарь

source: <code>nan</code> = Not A Number
ru: <code>nan</code> = Не Число

source: Instruction <code>new</code> (for specialists)
ru: Инструкция <code>new</code> (для специалистов)

source: The <code>new</code> operator creates a <a cbot|class>class</a> instance: <c/><s/> MyClass item; // now item is a null reference
ru: Оператор <code>new</code> создает новый <a cbot|class>класс</a>: <c/><s/> MyClass item; // переменная item пуста

source: item = new MyClass(); // now item is a reference // to a new class instance
ru: item = new MyClass(); // теперь item - это ссылка // в новый экземпляр класса

source: If you want to create a new instance at declaration time you can ommit the new <code>new</code> operator by putting () after the declaration:
ru: Если вы хотите создать новый экземпляр для объявления <code>new</code>, то на время можно опустить () после объявления:

source: Instead of: <c/><s/> MyClass item = new MyClass(); <n/>you can write: <c/><s/> MyClass item();
ru: Вместо: <c/><s/> MyClass item = new MyClass(); <n/>вы можете написать: <c/><s/> MyClass item();

source: If your class has a constructor with parameters you can write: <c/><s/> MyClass item = new MyClass(2, 3); <n/>or: <c/><s/> MyClass item(2, 3);
ru: Если ваш класс имеет конструктор с параметрами, то вы можете написать так: <c/><s/> MyClass item = new MyClass(2, 3); <n/>или: <c/><s/> MyClass item(2, 3);

source: <code><a cbot|class>class</a></code>, <code><a cbot|pointer>reference</a></code> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|class>class</a></code>, <code><a cbot|pointer>reference</a></code> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Type <code>null</code>
ru: Тип <code>null</code>

source: This special value indicates that the variable containing it does not reference an instance.
ru: Это специальное значение указывает, что содержащая его переменная не ссылается на экземпляр.

source: <a cbot|pointer>References</a> <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|pointer>References</a> <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Type <code>object</code>
ru: Тип <code>object</code>

source: Position of the object on the planet, in meters. The coordinates <code>x</code> and <code>y</code> correspond to the location on a map, the <code>z</code> coordinate corresponds to the altitude above (respectively below) sea level.
ru: Положение объекта на планете в метрах. Координаты <code>x</code> и <code>y</code> соответствуют местоположению на карте, координата <code>z</code> соответствует высоте над (соответственно ниже) уровнем моря.

source: Orientation of the object, in degrees. The orientation tells you what direction the object is facing. An orientation of <code>0</code> corresponds to an object facing eastwards, thus following the positive <code>x</code> axis. The orientation is measured counterclockwise.
ru: Ориентация объекта в градусах. Ориентация сообщает вам, в каком направлении смотрит объект. Ориентация <code>0</code> соответствует объекту, обращенному на восток, таким образом, следует положительная ось <code>x</code>. Ориентация измеряется против часовой стрелки.

source: Forward/backward angle of the robot. A pitch of <code>0</code> means that the bot is standing on flat ground. A positive inclination means that it is facing upwards, a negative inclination means that it is facing downwards.
ru: Угол наклона бота вперёд/назад. Наклон <code>0</code> означает, что бот стоит на ровной поверхности. Положительный наклон означает, что он направлен вверх, отрицательный наклон означает, что он направлен вниз.

source: Left/right angle of the bot, in degrees. A positive value means that the bot is leaning to the left side, a negative value means that it is leaning to the right side.
ru: Левый/правый угол наклона бота в градусах. Положительное значение означает, что бот наклоняется влево, отрицательное значение означает, что он наклоняется вправо.

source: Energy level, between 0 and 1. A normal <a object|power>power cell</a> that is fully charged returns the value <code>1</code>. A <a object|atomic>nuclear power cell</a> never returns a value higher than 1, it just lasts longer. Attention: The energy level of a bot is always zero, because the energy is not contained in the bot, but in the power cell. To know the energy level of the power cell of a bot, you must write <code>energyCell.energyLevel</code>.
ru: Уровень энергии от 0 до 1. Обычная полностью заряженная <a object|power>Батарея</a> возвращает значение <code>1</code>. <a object|atomic>Батарея Ядерная</a> никогда не возвращает значение выше 1, оно просто длится дольше. Внимание: уровень энергии бота всегда равен нулю, потому что энергия содержится не в боте, а в Батареи. Чтобы узнать уровень Батареи бота, вы должны написать <code>energyCell.energyLevel</code>.

source: Shield level of a robot or building. A level <code>1</code> indicates that the shield is still perfect. Every time that the bot or building gets a bullet or collides with another object, the shield level decreases. When the level reaches <code>0</code>, the next bullet or collision will destroy the bot or building. Bots can re-energize their shield on a <a object|repair>repair center</a>. The shield of a building is repaired if it lays inside the protection sphere of a <a object|botshld>shielder</a>.
ru: Уровень защиты бота или здания. Уровень <code>1</code> указывает, что защита по-прежнему идеальна. Каждый раз, когда бот или здание получают урон или сталкиваются с другим объектом, уровень защиты уменьшается. Когда уровень достигает <code>0</code>, следующее повреждение уничтожит бота или здание. Боты могут восстанавливать свою защиту на <a object|repair>Пункте Ремонта</a>. Защита здания восстанавливается, если она помещается внутрь защитной сферы <a object|botshld>Защитника</a>.

source: Temperature of the jet of <a object|botgj>winged bots</a>. <code>0</code> corresponds to a cold jet. When used, the temperature increases progressively. When it reaches the value <code>1</code>, the jet is overheated and stops working, until it cooled down a little.
ru: Температура реактивного двигателя <a object|botgj>Ботов Крылатых</a>. <code>0</code> соответствует холодному реактивному двигателю. При использовании температура постепенно увеличивается. При достижении значения <code>1</code> реактивный двигатель перегревается и перестаёт работать, пока немного не остынет.

source: The <code>z</code> coordinate of the position indicates the altitude above sea level, whereas the <code>altitude</code> indicates the height above ground. This value is meaningful only for <a object|botgj>winged bots</a> and for <a object|wasp>wasps</a>. For all other objects, this value is zero.
ru: Координата позиции <code>z</code> указывает высоту над уровнем моря, тогда как <code>altitude</code> указывает высоту над землей. Это значение имеет смысл только для <a object|botgj>Ботов Крылатых</a> и для <a object|wasp>Ос</a>. Для всех остальных объектов это значение равно нулю.

source: The age of the object in seconds since it's creation.
ru: Возраст объекта в секундах с момента его создания.

source: This information is special, because it returns the information about another object, in this case the power pack. This means that energyCell contains all the characteristics of a normal object, for example <code>category</code> (PowerCell or NuclearCell), <code>position</code> (the position of the cell), etc. If you want to know the energy level of a robot, you must not check <code>energyLevel</code>, but <code>energyCell.energyLevel</code>. If the bot has bot no power cell, <code>energyCell</code> returns <code>null</code>.
ru: Это особая информация, так как она возвращает информацию о другом объекте, в данном случае о заряде Батареи. Это означает, что energyCell содержит все характеристики обычного объекта, например <code>category</code> (Батарея Обычная или Батарея Ядерная), <code>position</code> (расположение Батареи) и т.д. Если вы хотите узнать уровень заряда бота, вы должны проверять не <code>energyLevel</code>, а <code>energyCell.energyLevel</code>. Если у бота нет Батареи, то <code>energyCell</code> возвращает <code>null</code>.

source: This information also returns the description of a whole object: the description of the object carried by a <a object|botgr>grabber</a>. If it carries nothing, <code>load</code> returns <code>null</code>.
ru: Эта информация также возвращает описание всего объекта: описание объекта, переносимого <a object|botgr>Погрузчиком</a>. Если он ничего не несёт, <code>load</code> возвращает <code>null</code>.

source: Examples
ru: Примеры

source: The type <code>object</code> returns the special value <code><a cbot|null>null</a></code> when the object does not exist. For example:
ru: Тип <code>object</code> возвращает специальное значение <code><a cbot|null>null</a></code>, если объект не существует. Например:

source: object a; a = radar(BotGrabberRoller); if ( a == null ) // object does not exist ? { } if ( a.position.z > 50 ) // is it on a mountain ? { }
ru: object a; a = radar(BotGrabberRoller); if ( a == null ) // объект не существует ? { } if ( a.position.z > 50 ) // он на горе ? { }

source: Instruction <code>open</code>
ru: Инструкция <code>open</code>

source: Open a text file in the files/ folder. This is a method of the <code><a cbot|file>file</a></code> class. This is the reason why we always write <code>handle.open()</code>:
ru: Открывает текстовый файл в файлах/папке. Это метод класса <code><a cbot|file>file</a></code>. Вот почему мы всегда пишем <code>handle.open()</code>:

source: To open a file, proceed as follows:
ru: Для открытия файла необходимо выполнить:
