Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: The <code>Example</code> function will receive an <a cbot|int>integer</a> <code>a</code>, a <a cbot|float>floating point number</a> <code>x</code> and a <a cbot|string>string</a> <code>s</code>. Parameters are "passed by value", that is the values of parameter variables in a function are copies of the values the caller specified as variables. If you pass an <code><a cbot|int>int</a></code> to a function, its parameter is a copy of whatever value was being passed as the argument, and the function can change its parameter value without affecting values in the code that invoked the function.
ru: Функция <code>Example</code> получит <a cbot|int>целое</a> <code>a</code>, а <a cbot|float>число с плавающей запятой</a> <code>x</code> и <a cbot|string>строка</a> <code>s</code>. Параметры "передаются по значению", то есть значения переменных параметров в функции являются копиями значений, которые вызывающий объект указал как переменные. Если вы передаете функции <code><a cbot|int>int</a></code>, её параметр является копией любого значения, переданного в качестве аргумента, и функция может изменить значение своего параметра без влияние на значения в коде, вызвавшем функцию.

source: If you pass a <a cbot|class>class</a> instance or an <a cbot|array>array</a> as parameter to a function, the function only receives a <a cbot|pointer>reference</a> to the instance or the array. That means if you modify the instance or the array in the function, the instance or the array that has been specified by the caller will be actually modified.
ru: Если вы передаёте экземпляр <a cbot|class>класса</a> или <a cbot|array>массив</a> в качестве параметра функции, функция получает только <a cbot|pointer>ссылку</a> к экземпляру или массиву. Это означает, что если вы изменяете экземпляр или массив в функции, экземпляр или массив, указанный вызывающей стороной, будет фактически изменён.

source: Result
ru: Результат

source: A function can also return a result with the <code><a cbot|return>return</a></code> instruction. Therefore the function must be declared no longer as <code><a cbot|void>void</a></code> but as an other <a cbot|type>type</a>:
ru: Функция также может возвращать результат с помощью инструкции <code><a cbot|return>return</a></code>. Следовательно, функция должна быть объявлена не как <code><a cbot|void>void</a></code>, а как другой <a cbot|type>тип</a>:

source: float Average(float a, float b) { return (a+b)/2; } extern void object::Test( ) { float value; value = Average(2, 6); message(value); // will display 4 }
ru: float Average(float a, float b) { return (a+b)/2; } extern void object::Test( ) { float value; value = Average(2, 6); message(value); // отобразит 4 }

source: Some other examples:
ru: Еще несколько примеров:

source: float Pi() { return 3.1415; } string Sign(float a) { if (a > 0) return "positive"; if (a < 0) return "negative"; return "null"; }
ru: float Pi() { return 3.1415; } string Sign(float a) { if (a > 0) return "положительное"; if (a < 0) return "отрицательное"; return "null"; }

source: Overloading
ru: Перегрузка

source: You can declare several functions with the same name but different parameters:
ru: Вы можете объявить несколько функций с одним и тем же названием, но с разными параметрами:

source: CBOT will call either the one or the other function depending on the parameters passed. They must be distinguishable, i.e. you can't declare two functions with the same name and parameter types in the exact same order, e.g. declaring <code>int Pythagoras(float b, float a)</code> will result in error. Note that result type does not matter.
ru: CBOT вызывает ту или иную функцию в зависимости от переданных параметров. Они должны быть различимы, т.е. вы не можете объявить две функции с одним и тем же названием и типами параметров в одном и том же порядке, например, объявление <code>int Pythagoras(float b, float a)</code> приведет к ошибке. Обратите внимание, что тип результата не имеет значения.

source: object::
ru: объект::

source: Declaring a function as a part of the <a cbot|object>object</a> namespace gives it access to <code><a cbot|this>this</a></code> <a cbot|pointer>pointer</a>, in other words, to all available properties of the robot which the program is run on.
ru: Объявление функции как части пространства имен <a cbot|object>объект</a> дает ей доступ к <code><a cbot|this>this</a></code> <a cbot|pointer>указателю</a>, другими словами, ко всем доступным свойствам бота, на котором запущена программа.

source: Use this type for variables that contain the characteristics of an object, be it a bot, a building, some raw material, an enemy, etc. Here are all properties of an object:
ru: Используйте этот тип для переменных, которые содержат характеристики объекта, будь то бот, здание, некоторое сырье, враг и т.д. Вот все свойства объекта:

source: <code><a cbot|int>int</a> object.category </code><a cbot|category>Category</a> of the object <code><a cbot|point>point</a> object.position </code>Position of the object (x,y,z) <code><a cbot|float>float</a> object.orientation </code>Orientation of the object (0..360) <code><a cbot|float>float</a> object.pitch </code>Forward/backward angle of the object <code><a cbot|float>float</a> object.roll </code>Right/left angle of the object <code><a cbot|float>float</a> object.energyLevel </code>Energy level (0..1) <code><a cbot|float>float</a> object.shieldLevel </code>Shield level (0..1) <code><a cbot|float>float</a> object.temperature </code>Jet temperature (0..1) <code><a cbot|float>float</a> object.altitude </code>Altitude above ground <code><a cbot|float>float</a> object.lifeTime </code>Lifetime of the object <code>object object.energyCell </code>Power cell on the bot <code>object object.load </code>Object carried by the bot <code><a cbot|int>int</a> object.team </code>The object's team (see <a battles>code battles</a>) <code><a cbot|point>point</a> object.velocity </code>Velocity of the object
ru: <code><a cbot|int>int</a> object.category </code><a cbot|category>Категория</a> объекта <code><a cbot|point>point</a> object.position </code>Позиция оьъекта (x,y,z) <code><a cbot|float>float</a> object.orientation </code>Направление объекта (0..360) <code><a cbot|float>float</a> object.pitch </code>Вперёд/назад наклон объекта <code><a cbot|float>float</a> object.roll </code>Вправо/влево наклон объекта <code><a cbot|float>float</a> object.energyLevel </code>Уровень энергии (0..1) <code><a cbot|float>float</a> object.shieldLevel </code>Уровень защиты (0..1) <code><a cbot|float>float</a> object.temperature </code>Температура реактивного двигателя (0..1) <code><a cbot|float>float</a> object.altitude </code>Высота над землей <code><a cbot|float>float</a> object.lifeTime </code>Срок службы объекта <code>object object.energyCell </code>Батарея на боте <code>object object.load </code>Объект, переносимый ботом <code><a cbot|int>int</a> object.team </code>Команда объектов (смотри <a battles>Битвы программ</a>) <code><a cbot|point>point</a> object.velocity </code>Скорость объекта

source: Also, some objects have additional methods (instructions). See them in <a cbot>the main list</a> in the <c/>"Instructions specific for some objects" section.
ru: Также у некоторых объектов есть дополнительные методы (инструкции). Смотри их в <a cbot>основном списке</a><c/> в разделе "Специальные инструкции для некоторых объектов".

source: The <n/><a cbot|category>category</a> of an object allows you to know what it is, f. ex. what kind of bot, building, enemy, etc.
ru: <n/>Категория<a cbot|category></a> объекта позволяет узнать, что это такое, т.е. что это за бот, здание, враг и т.д.

source: The bot's team. Used in <a battles>code battles</a>. If the object has no team assigned (e.g. in no team-based levels, the object being a resource), this is equal to <code>0</code>.
ru: Команда бота. Используется в <a battles>битвах программ</a>. Если объекту не назначена команда (например, на командных уровнях объект является ресурсом), это равно <code>0</code>.

source: Current velocity of the object. Should be treated as a three-dimensional vector.
ru: Текущая скорость объекта. Следует рассматривать как трёхмерный вектор.

source: Instruction <code>pencolor</code>
ru: Инструкция <code>pencolor</code>

source: The instruction <c/>pencolor();<n/> instructs the bot to change the color of the pencil.
ru: Инструкция <c/>pencolor();<n /> приказывает боту изменить цвет пера.

source: color: <code><a cbot|int>int</a></code> (default value: <code>Black</code>)
ru: color: <code><a cbot|int>int</a></code> (значение по умолчанию: <code>Black</code>)

source: <a cbot|colors>Color name</a>.
ru: <a cbot|colors>Название цвета</a>.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <c/>pencolor();<n/>. <code>== 0 </code>The color was changed <code>!= 0 </code>The instruction did not work
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <c/>pencolor();<n/> возвращает значение, отличное от нуля. <code>== 0 </code>Цвет был изменён <code>!= 0 </code>Инструкция не сработала

source: Instruction <code>pendown</code>
ru: Инструкция <code>pendown</code>

source: The instruction <c/>pendown();<n/> instructs the bot to have the pen down, so it starts drawing.
ru: Инструкция <c/>pendown();<n/> приказывает боту опустить перо, чтобы он начал рисование.

source: width: <code><a cbot|float>float</a></code> (default value: <code>0.5</code>)
ru: width: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>0.5</code>)

source: Width of the pen. The width cannot be higher than <code>1.0</code> and cannot be lower than <code>0.0</code>. Passing a higher value will result in the width being the highest possible and passing a lower value will result in the width being the lowest possible.
ru: Ширина пера. Ширина не может быть больше <code>1.0</code> и не может быть меньше <code>0.0</code>. Передача большего значения приведет к тому, что ширина будет максимально возможной, а передача меньшего значения приведет к тому, что ширина будет самой низкой из возможных.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <c/>pendown();<n/>. <code>== 0 </code>The pen is now down <code>!= 0 </code>The instruction did not work
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <c/>pendown();<n/> возвращает значение, отличное от нуля. <code>== 0 </code>Перо опущено <code>!= 0 </code>Инструкция не сработала

source: Instruction <code>penup</code>
ru: Инструкция <code>penup</code>

source: The instruction <c/>penup();<n/> instructs the bot to have the pen up, so it stops drawing. The pen is up by default, so it should be used only after using <code><a cbot|pendown>pendown</a></code>.
ru: Инструкция <c/>penup();<n/> приказывает боту поднять перо, чтобы он прекратил рисование. Перо по умолчанию поднято, поэтому его следует использовать только после использования <code><a cbot|pendown>pendown</a></code>.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <c/>penup();<n/>. <code>== 0 </code>The pen is now up <code>!= 0 </code>The instruction did not work
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <c/>penup();<n/> возвращает значение, отличное от нуля. <code>== 0 </code>Перо поднято <code>!= 0 </code>Инструкция не сработала

source: Instruction <code>penwidth</code>
ru: Инструкция <code>penwidth</code>

source: The instruction <c/>penwidth();<n/> instructs the bot to change the width of the pencil.
ru: Инструкция <c/>penwidth();<n/> приказывает боту изменить ширину пера.

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <c/>penwidth();<n/>. <code>== 0 </code>The width was changed <code>!= 0 </code>The instruction did not work
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <c/>penwidth();<n/> возвращает значение, отличное от нуля. <code>== 0 </code>Ширина была изменена <code>!= 0 </code>Инструкция не сработала

source: Instruction <code>pow</code>
ru: Инструкция <code>pow</code>

source: Base.
ru: Основание.

source: Exponent.
ru: Экспонента.

source: x to the y (x raised to the yth power).
ru: x в y (x в степени y).

source: <a cbot|array>Array</a> of categories of the objects that should be detected. For example, when you are looking only for grabbers:
ru: <a cbot|array>Массив</a> категорий объектов, которые необходимо обнаружить. Например, если вы ищете только Погрузчиков:

source: Keyword <format const>Any</format> if you are looking for any object (including even plants and so on). Filters may be useful to use with this keyword.
ru: Ключевое слово <format const>Any</format>, если вы ищете какой-либо объект (включая даже растения и т.д.). Фильтры могут быть полезны для использования с этим ключевым словом.

source: angle: <code><a cbot|float>float</a></code> (default value: <code>0</code>)
ru: angle: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>0</code>)

source: focus: <code><a cbot|float>float</a></code> (default value: <code>360</code>)
ru: focus: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>360</code>)

source: min: <code><a cbot|float>float</a></code> (default value: <code>0</code>)
ru: min: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>0</code>)

source: max: <code><a cbot|float>float</a></code> (default value: <code>1000</code>)
ru: max: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>1000</code>)

source: sens: <code><a cbot|float>float</a></code> (default value: <code>1</code>)
ru: sens: <code><a cbot|float>float</a></code> (значение по умолчанию: <code>1</code>)

source: filter: <code><a cbot|int>int</a></code> (default value: <code><format const>FilterNone</format></code>)
ru: filter: <code><a cbot|int>int</a></code> (значение по умолчанию: <code><format const>FilterNone</format></code>)

source: Determines which type of objects should be detected. Especially useful in use with an <a cbot|array>array</a> or <format const>Any</format>. The following filters are available:
ru: Определяет, какой тип объектов следует обнаруживать. Особенно полезно при использовании с <a cbot|array>массивом</a> или <format const>Any</format>. Доступны следующие фильтры:

source: <code><format const>FilterNone</format> </code>Detects everything (default) <code><format const>FilterOnlyLanding</format> </code>Detects only objects being on the ground <code><format const>FilterOnlyFlying</format> </code>Detects only objects not being on the ground <code><format const>FilterFriendly</format> </code>Detects only allies (objects in the same team) <code><format const>FilterEnemy</format> </code>Detects only enemies (objects in an other team except neutral) <code><format const>FilterNeutral</format> </code>Detects only neutral objects (e.g. resources)
ru: <code><format const>FilterNone</format> </code>Обнаружить всё (по умолчанию) <code><format const>FilterOnlyLanding</format> </code>Обнаружить только объекты на земле <code><format const>FilterOnlyFlying</format> </code>Обнаружить только объекты не на земле <code><format const>FilterFriendly</format> </code>Обнаружить только союзников (объекты в одной команде) <code><format const>FilterEnemy</format> </code>Обнаружить только врагов (объекты в другой команде кроме нейтральных) <code><format const>FilterNeutral</format> </code>Обнаружить только нейтральные объекты (например, ресурсы)

source: The last three are mainly useful in <a battles>code battles</a>. You can also pass a team ID to search only for objects from a specific team. Attention: you should use <format const>FilterNeutral</format> instead of <code>0</code> or else it will not work.
ru: Последние три в основном полезны в <a battles>битвах программ</a>. Вы также можете передать идентификатор группы, чтобы искать объекты только из определенной группы. Внимание: вы должны использовать <format const>FilterNeutral</format> вместо <code>0</code>, иначе это не сработает.

source: Filters and IDs can be mixed using bitwise OR operator <code>|</code>, for example <c/>radar(Any, 0, 360, 0, 1000, 1, 2 | FilterOnlyLanding);<n/> will only detect an object from team <code>2</code> that is on the ground. Attention: you can specify only one team ID at once, but you can specify several filters at once.
ru: Фильтры и идентификаторы можно смешивать с помощью оператора побитового ИЛИ <code>|</code>, например <c/>radar(Any, 0, 360, 0, 1000, 1, 2 | FilterOnlyLanding);<n/> будет обнаруживать только объект из команды <code>2</code>, который находится на земле. Внимание: сразу можно указать только один идентификатор команды, но можно указать сразу несколько фильтров.

source: Instruction <code>rand</code>
ru: Инструкция <code>rand</code>

source: Pseudorandom number between 0 and 1 (including 0, but excluding 1).
ru: Псевдослучайное число от 0 до 1 (включая 0, но исключая 1).

source: Instruction <code>research</code>
ru: Инструкция <code>research</code>

source: Starts a <a cbot|researches>research</a> of the given type.
ru: Начинает <a cbot|researches>исследование</a> заданного типа.

source: <a object|research>ResearchCenter</a> or <a object|labo>AutoLab</a>.
ru: <a object|research>Центр Исследований</a> или <a object|labo>Лаборатория</a>.

source: type: <code><a cbot|int>int</a></code>
ru: тип: <code><a cbot|int>int</a></code>

source: Normally an error stops the program. You can prevent the program from stopping on errors by using the <code><a cbot|errmode>errmode</a>(0)</code> instruction. A value different from zero if an error occurred is then returned by <code>research()</code>. <code>== 0 </code>The research successfully started <code>!= 0 </code>The research could not be started (e.g. the research is disabled in the level, no power cell)
ru: Обычно ошибка останавливает выполнение программы. Вы можете предотвратить остановку работы программы при появлении ошибок, используя инструкцию <code><a cbot|errmode>errmode</a>(0)</code>. В том случае, если возникла ошибка, <code>research()</code> возвращает значение, отличное от нуля. <code>== 0 </code>Исследование успешно началось <code>!= 0 </code>Не удалось начать исследование (например, исследование на уровне отключено, нет Батареи)

source: <a cbot|researches>Research names</a>, <a cbot|canresearch>canresearch</a>, <a cbot|researched>researched</a>, <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|researches>Исследование</a>, <a cbot|canresearch>canresearch</a>, <a cbot|researched>researched</a>, <a cbot|programming>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Instruction <code>researched</code>
ru: Инструкция <code>researched</code>

source: Checks if the <a cbot|researches>research</a> was done in the level.
ru: Проверяет, проводилось ли <a cbot|researches>исследование</a> на уровне.

source: <format const>true</format> if the research was done <format const>false</format> if the research was not done
ru: <format const>true</format> если исследование было проведено <format const>false</format> если исследование не было проведено

source: <a cbot|researches>Research names</a>, <a cbot|research>research</a>, <a cbot|canresearch>canresearch</a>, <a cbot|canbuild>canbuild</a> <a cbot>programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|researches>Исследование</a>, <a cbot|research>research</a>, <a cbot|canresearch>canresearch</a>, <a cbot|canbuild>canbuild</a> <a cbot>программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Value <code>Research names</code>
ru: Значение <code>Research names</code>

source: Research names represent the types of available researches in the CBOT language. You can use them to control <a object|research>ResearchCenter</a> by passing them to appropriate instructions (e.g. <a cbot|research>research</a>, <a cbot|canresearch>canresearch</a>, <a cbot|researched>researched</a>).
ru: Названия исследований представляют собой типы доступных исследований на языке CBOT. Вы можете использовать их для управления <a object|research>Центром Исследований</a>, передавая их соответствующим инструкциям (например, <a cbot|research>research</a>, <a cbot|canresearch>canresearch</a>, <a cbot|researched>researched</a>).

source: In a program, research names are always displayed on a <format const>red background</format>. If a research name is not highlighted in red, it is misspelled. Caps and lower cases should be kept as is.
ru: В программе названия исследований всегда отображаются на <format const>красном фоне</format>. Если название исследования не выделено красным, оно написано с ошибкой. Заглавные и строчные буквы следует сохранять как есть.

source: Below are the different research names available.
ru: Ниже приведены названия различных исследований.

source: Done by <a object|research>ResearchCenter</a>:
ru: Выполнено в <a object|research>Центре Исследований</a>:

source: <code><format const>ResearchTracked</format> </code>Tracked bots (e.g. <a object|botgc>tracked grabber</a>) <code><format const>ResearchWinged</format> </code>Winged bots (e.g. <a object|botgj>winged grabber</a>) <code><format const>ResearchShooter</format> </code>Bots with cannon (e.g. <a object|botfc>tracked shooter</a>) <code><format const>ResearchPhazerShooter</format> </code><a object|botphaz>Phazer shooter</a> <code><format const>ResearchThumper</format> </code><a object|bottump>Thumper</a> <code><format const>ResearchShielder</format> </code><a object|botshld>Shielder</a> <code><format const>ResearchDefenseTower</format> </code><a object|tower>Defense tower</a> <code><format const>ResearchNuclearPlant</format> </code><a object|nuclear>Nuclear plant</a>
ru: <code><format const>ResearchTracked</format> </code>Боты Гусеничные (например, <a object|botgc>Погрузчик Гусеничный</a>) <code><format const>ResearchWinged</format> </code>Боты Крылатые (например, <a object|botgj>Погрузчик Крылатый</a>) <code><format const>ResearchShooter</format> </code>Боты с орудием (например, <a object|botfc>Стрелок Гусеничный</a>) <code><format const>ResearchPhazerShooter</format> </code><a object|botphaz>Стрелок Ферзь</a> <code><format const>ResearchThumper</format> </code><a object|bottump>Кувалдник</a> <code><format const>ResearchShielder</format> </code><a object|botshld>Защитник</a> <code><format const>ResearchDefenseTower</format> </code><a object|tower>Башня Обороны</a> <code><format const>ResearchNuclearPlant</format> </code><a object|nuclear>Энергостанция Ядерная</a>
