Repository: DavydovMA/colobot-data
Catalog: help/cbot/po/*.po
Languages: ru

source: Occasionally, a <a cbot|class>class</a> method needs to know the reference to the instance it is acting upon. For example the instance might want to pass it's own reference to another function. An implicit reference name <code>this</code> is available to methods and <code>this</code> is a reference to the current instance.
ru: Иногда, методы <a cbot|class>класса</a> должны знать ссылку уже действующего экземпляра. Например, экземпляр, возможно, захочет передать свои ссылки другой функции. Неявное название ссылки <code>this</code> доступно для методов, а также <code>this</code> это ссылка на текущий экземпляр.

source: public class MyClass { int m_int; string m_str; void MyFunction() { OtherFunction(this); m_int = 2; } } void OtherFunction(MyClass obj) { message(obj.m_str); } extern void object::Test() { MyClass item(); item.m_str = "Hello"; item.MyFunction(); // display "Hello" }
ru: public class MyClass { int m_int; string m_str; void MyFunction() { OtherFunction(this); m_int = 2; } } void OtherFunction(MyClass obj) { message(obj.m_str); } extern void object::Test() { MyClass item(); item.m_str = "Hello"; item.MyFunction(); // вывести "Hello" }

source: You can also put <code>this</code> before a field name in a method but this is not necessary. In the example above in the method <code>MyFunction()</code> following two lines have strictly the same meaning:
ru: Вы можете написать <code>this</code> перед методом, но в этом нет необходимости. В приведенном ниже примере мы видим две строго одинаковых строки:

source: m_int = 2; this.m_int = 2; // identical
ru: m_int = 2; this.m_int = 2; // они идентичны

source: In a method of the <code><a cbot|object>object</a></code> class, you can also use <code>this.</code> before a fieldname.
ru: В методе класса <code><a cbot|object>object</a></code>, вы можете использовать <code>this.</code> перед названием поля.

source: extern void object::Display() { message(orientation); message(this.orientation); // same thing but // more explicit }
ru: extern void object::Display() { message(orientation); message(this.orientation); // тоже самое, но // более четко }

source: However if a field name is hidden by a parameter declaration or a variable declaration you must use <code>this</code>. In the following example the name <code>value</code> of the parameter is the same as the name of the field <code>value</code> of the <a cbot|class>class</a> <code>MyClass</code>, we must therefore write <code>this.value</code> in order to distinguish the field from the parameter.
ru: Однако, если название поля неизвестно, то объявление параметра или переменной необходимо использовать вместе с <code>this</code>. В следующем примере название параметра <code>value</code> такое же, как и название поля <code>value</code> <a cbot|class>класса</a> <code>MyClass</code>, поэтому мы должны написать <code>this.value</code> для того, чтобы отличить поле от параметра.

source: Instruction <code>thump</code>
ru: Инструкция <code>thump</code>

source: Activates the weapon system of the <a object|bottump>thumper</a>, that turns ants and spiders belly up and makes them completely harmless for a while.
ru: Запускает систему <a object|bottump>Кувалдника</a>, которая переворачивает муравьев и пауков вверх брюхом и на время делает их совершенно безвредными.

source: Zero if everything is OK, a value different from zero if an error occurred. <code>== 0 </code>Thumping performed <code>!= 0 </code>Operation impossible
ru: Если все нормально, то возвращает ноль, если же возникла ошибка, то какое-то число. <code>== 0 </code>Удар нанесён <code>!= 0 </code>Операция невозможна

source: Instruction <code>topo</code>
ru: Инструкция <code>topo</code>

source: Returns the altitude of the ground at a give position. The altitude zero corresponds to sea level. A negative value indicates that at this position ground is covered with water.
ru: Возвращает высоту над землей в заданной позиции. Ноль высоты соответствует уровню моря. Отрицательное значение указывает на то, что в этом месте земля покрыта водой.

source: Coordinates of the position whose altitude you want to know.
ru: Координаты позиции, высоту которой вы хотите узнать.

source: Altitude of the ground at the given position.
ru: Высота земли в данной позиции.

source: Type <code>true</code>
ru: Тип <code>true</code>

source: This value means that a condition is true; it is one of the two values that a <a cbot|bool>boolean</a> <a cbot|var>variable</a> can take.
ru: Это значение означает, что условие выполнено; это одно из двух значений, которые может принимать <a cbot|bool>логическая</a> <a cbot|var>переменная</a>.

source: Instruction <code>turn</code>
ru: Инструкция <code>turn</code>

source: Use the instruction <c/>turn();<n/> to instruct the bot to perform a rotation on itself of a certain number of degrees.
ru: Инструкция <c/>turn();<n/>, приказывает боту выполнить поворот на определенное количество градусов.

source: 90 degreed means a quarter turn, 180 degrees means a half turn. A positive angle will perform a counterclockwise rotation, a negative angle means a clockwise rotation. Here are some examples with <c/>turn();<n/>:
ru: 90 градусов означают поворот на четверть круга, 180 означают поворот на половину круга. Положительный угол приведёт к вращению против часовой стрелки, а отрицательный угол приведёт к вращению по часовой стрелке. Вот несколько примеров использования <c/>turn();<n/>:

source: <c/>turn(90);<n/> quarter turn to the left <c/>turn(-90);<n/> quarter turn to the right (negative angle) <c/>turn(180);<n/> half turn
ru: <c/>turn(90);<n/> поворот на четверть круга налево <c/>turn(-90);<n/> поворот на четверть круга направо (отрицательный угол) <c/>turn(180);<n/> половина оборота

source: In order to turn the bot towards an object found with the instruction <c/><a cbot|radar>radar</a>();<n/>, you must calculate the rotation angle with the instruction <code><a cbot|direct>direction</a>()</code>:
ru: Для того, чтобы повернуть бота в направлении объекта, который был обнаружен с помощью инструкции <c/><a cbot|radar>radar</a>();<n/>, вы должны вычислить угол поворота с помощью инструкции <code><a cbot|direct>direction</a>()</code>:

source: After these lines, just fire the cannon, and there is one hostile element less.
ru: После выполнения этих строк просто стреляйте из орудия и у вас будет на одного врага меньше.

source: Turns the bot with a given angle, right or left, without moving either forward or backward.
ru: Поворачивает бота на заданный угол вправо или влево, не двигаясь ни вперед, ни назад.

source: Angle of the required rotation, in degrees. A positive value turns left, a negative value turns right. <code>turn(180)</code> turns round completely.
ru: Угол необходимого поворота в градусах. Положительное значение поворачивает налево, отрицательное - направо. <code>turn(180)</code> полностью разворачивает.

source: Zero if everything is OK, or a value different from zero if an error occurred. <code>== 0 </code>rotation performed <code>!= 0 </code>rotation impossible
ru: Если все нормально, то возвращает ноль, если же возникла ошибка, то какое-то число. <code>== 0 </code>вращение выполнено <code>!= 0 </code>вращение невозможно

source: Variable types
ru: Типы переменных

source: When you define a <a cbot|var>variable</a>, you must give two elements:
ru: Когда вы определяете <a cbot|var>переменную</a>, вы должны указать два элемента:

source: a name
ru: название

source: a type
ru: и тип

source: Once you defined a variable, you can use it to put information in it. However, the information that a variable can contain must always be of the correct type: a variable of type <a cbot|float>float</a> can not contain a string, etc.
ru: После того, как вы определили переменную, вы можете использовать ее для хранения информации. Однако информация, которую может содержать переменная, всегда должна быть правильного типа: переменная типа <a cbot|float>float</a> не может содержать строку и т.д.

source: For a whole number (12, -500, etc.).
ru: Для целых чисел (12, -500 и т.д.).

source: For a real number (12, 3.14, 0.2, -99.98, etc.).
ru: Для действительных чисел (12, 3.14, 0.2, -99.98 и т.д.).

source: For a boolean variable, that can only take the values <code>true</code> or <code>false</code>.
ru: Для логических переменных, которые могут принимать только два значения <code>true</code> или <code>false</code>, то есть истина или ложь.

source: For texts ("Hello!", "No object found", etc.)
ru: Для текста ("Привет!", "Объект не найден" и т.д.)

source: For the coordinates of a point in space; a variable of this type consists of three parts named x, y and z.
ru: Для координат позиции в пространстве; переменная этого типа состоит из трех частей с названиями x, y и z.

source: A variable of this type contains the information about an object (bot, building, enemy, etc.).
ru: Переменная этого типа содержит информацию об объекте (боте, здании, противнике и т.д.).

source: This type is an "empty type", that you use when you do not want to specify a type.
ru: Это «пустой тип», который вы используете, когда не хотите указывать тип.

source: Variables
ru: Переменные

source: A variable is like a box, where you can put some information. The content of the variable can change during the execution of the program.
ru: Переменная похожа на ящик, куда вы можете поместить некоторую информацию. Содержимое переменной может изменяться во время выполнения программы.

source: For example, you can use a variable to count the number of titanium ore units that the grabber has collected and carried to the converter. First, you must find a name for it: the name should not be too long, but explain by itself what the variable is used for. Let's call it <code>countTit</code>. This variable must contain only whole numbers, so choose the type <code>int</code>. At the beginning of the program, you must declare the variable. Then you put the value <code>0</code> into the variable, and every time you grab a titanium ore, you increase the variable by <code>1</code>. At every moment, the variable contains the number of titanium ore units that the grabber collected.
ru: Например, вы можете использовать переменную для подсчета количества Руды Титановой, которую Погрузчик собрал и перенес в Преобразователь. Во-первых, вы должны найти для неё название: название не должно быть слишком длинным, но само по себе объяснять, для чего используется переменная. Назовём её <code>countTit</code>. Эта переменная должна содержать только целые числа, поэтому выберите тип <code>int</code>. В начале программы вы должны объявить переменную. Затем вы помещаете значение <code>0</code> в переменную и каждый раз, когда берете Руду Титановую, увеличиваете переменную на <code>1</code>. В каждый момент переменная содержит количество Руды Титановой, собранной Погрузчиком.

source: For the declaration of the variable, write the following line: <c/><s/> int countTit;<n/>
ru: Для объявления переменной напишите следующую строку: <c/><s/> int countTit;<n/>

source: To put <code>0</code> into the variable, write: <c/><s/> countTit = 0;<n/>
ru: Чтобы поместить в переменную <code>0</code>, напишите: <c/><s/> countTit = 0;<n/>

source: At every titanium ore grabbed, write: <c/><s/> countTit = countTit + 1<n/>
ru: Каждый раз когда берёте Руду Титановую, напишите: <c/><s/> countTit = countTit + 1<n/>

source: You have much freedom in the choice of the name for a variable, you can call them by any name, f. ex.: <code>dist</code>, <code>direct</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>nothing_2_shoot_at</code>, etc. A variable name must always begin with a letter. It can be followed by any combination of letters, digits or the underscore character <code>_</code>. You can of course not use the keywords of the CBOT language like <code><a cbot|for>for</a></code>, <code><a cbot|while>while</a></code>, <code><a cbot|break>break</a></code>, <code><a cbot|continue>continue</a></code>, <code>do</code>, etc. You should be careful about the choice of the names that you give to variables; writing a program can become very difficult if you forget the names of variables or if you do not remember what they are used for. Elaborate your own system to find variable names, and do not use names like <code>Bmo45</code>, <code>a</code> or <code>tgBinX</code>.
ru: В выборе названия для переменной у вас есть довольно много возможностей, вы можете называть их как угодно, например: <code>dist</code>, <code>direct</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>nothing_2_shoot_at</code> и т.д. Название всегда должно начинаться с латинской буквы. За нем может следовать любая комбинация латинских букв, символов или символа подчеркивания <code>_</code>. Вы конечно не можете использовать для названий ключевые слова языка CBOT, как например <code><a cbot|for>for</a></code>, <code><a cbot|while>while</a></code>, <code><a cbot|break>break</a></code>, <code><a cbot|continue>continue</a></code>, <code>do</code> и т.д. При выборе названия для переменных вы должны быть осторожны; написание программы может стать очень сложным, если вы забудете названия переменных или если вы не сможете вспомнить для чего они используются. Разработайте свою собственную систему для придумывания названий переменных, но не используйте такие названия как <code>Bmo45</code>, <code>a</code> или <code>tgBinX</code>.

source: In the example above, the keyword <code>int</code> indicates that this variable can contain only whole numbers, which is adequate to counting objects. If you want to measure a distance, better use a variable that can contain also real numbers, with a fractional part (like 3.45 or 0.034): in this case, use the type <code>float</code>.
ru: В приведенном выше примере ключевое слово <code>int</code> показывает, что эта переменная может содержать только целые числа, которые соответствуют подсчитываемым объектам. Если вы хотите измерить расстояние, то лучше используйте переменную, которая может содержать и дробные числа с дробной частью (например 3.45 или 0.034): в этом случае используйте тип <code>float</code>.

source: the name,
ru: название,

source: the type of the information stored inside,
ru: тип информации, хранящейся внутри,

source: the content, i.e. the information itself.
ru: содержание, т.е. сама информация.

source: the name
ru: название

source: You need the name to be able to distinguish the different variables from each other.
ru: Название необходимо, чтобы можно было отличать разные переменные друг от друга.

source: the type
ru: тип

source: <code><a cbot|int>int</a></code> for a whole number (12, -500, etc.)
ru: <code><a cbot|int>int</a></code> для целого числа (12, -500 и т.д.)

source: <code><a cbot|float>float</a></code> for a real number (3.14, 0.2, -99.98, etc.)
ru: <code><a cbot|float>float</a></code> для действительного числа (3.14, 0.2, -99.98 и т.д.)

source: <code><a cbot|string>string</a></code> for a character string ("Hello!", "No object found", etc.)
ru: <code><a cbot|string>string</a></code> для строки символов ("Привет!", "Объект не найден" и т.д.)

source: <code><a cbot|point>point</a></code> for a x,y,z-coordinate in space
ru: <code><a cbot|point>point</a></code> для x,y и z-координат в пространстве

source: <code><a cbot|object>object</a></code> for information about an object (bot, building, etc.)
ru: <code><a cbot|object>object</a></code> для информации об объекте (бот, здание и т.д.)

source: The content
ru: Содержимое

source: The content of a variable is an information of the kind specified in the type. It can change during the execution of the program.
ru: Содержимое переменной - это информация того типа, который указан в типе. Оно может измениться во время выполнения программы.

source: Once you declared a variable, it still does not contain any value. Before you can use it, you must put a value inside: <c/><s/> int i, j;
ru: После того, как вы объявили переменную, она по-прежнему не содержит никакого значения. Прежде чем вы сможете его использовать, вы должны поместить в неё значение: <c/><s/> int i, j;

source: j = 25; // j takes the value 25 j = i; // can not write this, because i has got no content yet.
ru: j = 25; // j принимает значение, равное 25 j = i; // так писать нельзя, так как i еще ничего не содержит.

source: You can also declare a variable and put a value inside in the same line, writing: <c/><s/> int countTit = 0;
ru: Вы также можете в одной строке одновременно объявить переменную и записать в нее значение, написав: <c/><s/> int countTit = 0;

source: When you assign a value to a variable with the equals sign <code>=</code>, the value on the right side is copied into the value on the left side. Consider the following example: <c/><s/> int i, j;
ru: Когда вы присваиваете значение переменной с помощью знака равенства <code>=</code>, значение с правой стороны копируется в переменную с левой стороны. Изучите следующий пример: <c/><s/> int i, j;

source: i = 5+2; // i takes the value 7 j = i+6; // j takes the value of i plus 6, this is 13 i = j; // i takes the value of j, this is 13
ru: i = 5+2; // i принимает значение, равное 7 j = i+6; // j принимает значение i плюс 6, то есть 13 i = j; // i принимает значение j, то есть 13

source: At the end of this example, both variables <code>i</code> and <code>j</code> contain the value <code>13</code>.
ru: В конце этого примера обе переменные <code>i</code> и <code>j</code> содержат значение <code>13</code>.

source: The following assignment is not correct, because on the left side of the equals sign <code>=</code>, there can be only a variable name: <c/><s/> i+2 = j; // impossible
ru: Последующее присвоение неправильно, так как с левой стороны знака равенства <code>=</code>, может быть только имя переменной: <c/><s/> i+2 = j; // невозможно

source: If you want to exchange the values of two variables, you must use a third variable. Here is an example to exchange the content of two variables <code>a</code> and <code>b</code> : <c/><s/> int temp;
ru: Если вы хотите поменять местами значения двух переменных, то вы должны использовать третью переменную. Вот пример обмена содержимого двух переменных, <code>a</code> и <code>b</code> : <c/><s/> int temp;

source: temp = a; // temp takes the value of a a = b; // the content of b is copied into a b = temp; // the content of temp is copied into b
ru: temp = a; // temp принимает значение a a = b; // содержимое b копируется в a b = temp; // содержимое temp копируется в b

source: Type <code>void</code>
ru: Тип <code>void</code>

source: Use this type when you want to declare a function that returns nothing.
ru: Используйте этот тип, если хотите объявить функцию, которая ничего не возвращает.

source: Example: <c/><s/>void MyFunction(int a)
ru: Например: <c/><s/>void MyFunction(int a)

source: Instruction <code>wait</code>
ru: Инструкция <code>wait</code>

source: The instruction <c/>wait();<n/> instructs the bot to wait for some seconds, according to the value written in brackets.
ru: Инструкция <c/>wait();<n/> предписывает боту подождать несколько секунд в соответствии со значением, указанным в скобках.

source: In order to wait until the <a object|power>power cell</a> is recharged on a power station, wait 5 seconds with <c/>wait(5);<n/>.
ru: Чтобы дождаться зарядки <a object|power>Батареи</a> на Энергозаправке, подождите 5 секунд с помощью <c/>wait(5);<n/>.

source: In order to wait until the <a object|convert>converter</a> finished transforming some <a object|titanore>titanium ore</a> in a <a object|titan>titanium cube</a>, wait 15 seconds with <c/>wait(15);<n/>.
ru: Чтобы подождать, пока <a object|convert>Преобразователь</a> закончит преобразовывать <a object|titanore>Руду Титановую</a> в <a object|titan>Титан</a>, подождите 15 секунд с помощью <c/>wait(15);<n/>.

source: Waits for a moment.
ru: Ждёт некоторое время.

source: Specifies the time that the bot must wait.
ru: Указывает время, в течение которого бот должен ждать.

source: Instruction <code>while</code>
ru: Инструкция <code>while</code>

source: The instruction <code>while () {}</code> is used to repeat a set of instructions several times.
ru: Инструкция <code>while () {}</code> используется для повторения набора инструкций несколько раз.

source: look for a spider,
ru: ищет паука,

source: turn towards it,
ru: поворачивается к нему,

source: shoot.
ru: стреляет.

source: Just execute this program once, and it will kill all spiders around it.
ru: Просто выполните эту программу один раз, и она уничтожит всех пауков вокруг себя.

source: <code>while ( condition ) { </code>Instructions ...<c/> }
ru: <code>while ( условие ) { </code>Инструкции ...<c/> }

source: This instruction allows you to perform the instructions inside the <a cbot|bloc>block</a> several times.
ru: Эта инструкция позволяет вам выполнять инструкции внутри <a cbot|bloc>блока</a> несколько раз.

source: Be careful not to confuse the instruction <code>while( ) { }</code> with the instruction <c/><a cbot|do>do</a> { } while( );<n/>; the latter tests the condition only after the instructions in the block have been performed a first time.
ru: Будьте осторожны, не перепутайте инструкцию <code>while( ) { }</code> с инструкцией <c/><a cbot|do>do</a> { } while( );<n/>; последняя проверяет условие только после того, как инструкции в блоке были выполнены в первый раз.

source: <c/>int i = 0; while ( i < 10 ) { <n/>Instructions ...<c/> i = i+1; }
ru: <c/>int i = 0; while ( i < 10 ) { <n/>Инструкции ...<c/> i = i+1; }

source: Do not put a <a cbot|term>semicolon</a> at the end of the line <code>while ( )</code>.
ru: Не ставьте <a cbot|term>точку с запятой</a> в конце строки <code>while ( )</code>.

source: The instructions <code><a cbot|break>break</a></code> and <code><a cbot|continue>continue</a></code> can be useful inside a block following the instruction <code>while { }</code>.
ru: Инструкции <code><a cbot|break>break</a></code> и <code><a cbot|continue>continue</a></code> могут быть полезны внутри блока, следующего за инструкцией <code>while { }</code>.

source: Instruction <code>writeln</code>
ru: Инструкция <code>writeln</code>

source: Write one line of text to an open file in the files/ folder. This is a method of the <code><a cbot|file>file</a></code> class. This is the reason why we always write <code>handle.writeln()</code>:
ru: Запишет одну строку текста в открытый файл в файлах/папке. Это метод класса <code><a cbot|file>file</a></code>. Вот почему мы всегда пишем <code>handle.writeln()</code>:

source: The file must have been opened for writing (<code>"w"</code>) with the <code><a cbot|open>open</a></code> instruction. The line will automatically be terminated by the end of line characters 0x0D (CR) and 0x0A (LF).
ru: Файл должен быть открыт для записи (<code>"w"</code>) с помощью инструкции <code><a cbot|open>open</a></code>. Строка автоматически завершается символами конца строки 0x0D (CR) и 0x0A (LF).

source: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code> and <code><a cbot|eof>eof</a></code>. <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <code><a cbot|file>file</a></code>, <code><a cbot|open>open</a></code>, <code><a cbot|close>close</a></code>, <code><a cbot|readln>readln</a></code> и <code><a cbot|eof>eof</a></code>. <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Fires the gun, with a burst that lasts a certain time. The longer the burst, the more energy it needs. This instruction can be used with the following bot types:
ru: Стреляет из орудия очередью, которая длится определенное время. Чем дольше импульс, тем больше энергии ему нужно. Эту инструкцию можно использовать со следующими типами ботов:
