Repository: DavydovMA/colobot-data
Catalog: help/bots/po/*.po
Languages: ru

source: <button 144/> Tracked Shooter
ru: <button 144/> Стрелок Гусеничный

source: Tracked bot equipped with a fireball cannon.
ru: Стрелок Гусеничный оснащён орудием огне-ядреным.

source: The fireball cannon is an efficient weapon against most kinds of <a object|mother>enemies</a>. Use it sparingly though for it requires large amounts of energy. A <a object|power>regular power cell</a> will only allow you to shoot 4 fireball bursts.
ru: Орудие огне-ядреное эффективно против большинства <a object|mother>врагов</a>. Используйте орудие разумно, так как оно потребляет много энергии. <a object|power>Батарея Обычная</a> позволит вам сделать всего 4 выстрела.

source: Tip : it is possible to move the mouse while shooting, so as to sweep a larger area.
ru: Совет : можно перемещать мышь во время стрельбы, чтобы накрыть большую область.

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botfr>wheeled shooter</a> is a better option. When it is possible to build <a object|botfj>winged bots</a>, these represent the best solution for long distances.
ru: Гусеничные боты могут подниматься по крутым склонам, но они довольно медленные и потребляют много энергии. На ровной земле на коротких дистанциях лучше подойдет <a object|botfr>Колёсный бот</a>. Когда можно построить <a object|botfj>Крылатых ботов</a>, то они лучше всего подходят для дальних расстояний.

source: Programming
ru: Программирование

source: To program the bot's movements, use the following commands : <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.
ru: Чтобы запрограммировать передвижение бота, используйте следующие команды : <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.

source: To program the fireball cannon, use <code><a cbot|fire>fire</a></code>. To raise or lower the aim, use <code><a cbot|aim>aim</a></code>.
ru: Чтобы запрограммировать орудие, используйте <code><a cbot|fire>fire</a></code>. Чтобы поднять или опустить прицел, используйте <code><a cbot|aim>aim</a></code>.

source: Object <a cbot|category>Category</a>
ru: Объект <a cbot|category>Категория</a>

source: See also
ru: Смотрите также

source: <a cbot>CBOT Language</a>, <a cbot|type>Variables</a> and <a cbot|category>Categories</a>.
ru: <a cbot>Язык CBOT</a>, <a cbot|type>Переменные</a> и <a cbot|category>Категории</a>.

source: <button 145/> Winged Shooter
ru: <button 145/> Стрелок Крылатый

source: Jet propelled flying bot equipped with a fireball cannon.
ru: Стрелок Крылатый оснащён реактивным двигателем и орудием огне-ядреным.

source: The display at the bottom of your screen indicates the temperature of the reactor. Keep an eye on it. If the reactor overheats, the engine will stop and the bot will crash.
ru: Дисплей внизу вашего экрана показывает температуру реактивного двигателя. Следите за ней. Если реактор перегреется, двигатель остановится и бот рухнет.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botfr>wheeled shooter</a> instead.
ru: Крылатые боты могут перелетать через естественные препятствия, такие как горы или озера, но их энергия быстро заканчивается. На земле они медленные. Чтобы преодолеть небольшое расстояние, где не требуется летать, лучше использовать <a object|botfr>Колёсный бот</a>.

source: To program the bot's movements, use the following commands : <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|jet>jet</a></code>, <code><a cbot|goto>goto</a></code>.
ru: Чтобы запрограммировать передвижение бота, используйте следующие команды : <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|jet>jet</a></code>, <code><a cbot|goto>goto</a></code>.

source: <button 143/> Wheeled Shooter
ru: <button 143/> Стрелок Колёсный

source: Wheeled bot equipped with a fireball cannon.
ru: Стрелок Колёсный оснащён орудием огне-ядреным.

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to use a <a object|botfj>winged shooter</a> instead, or, if this is impossible, a <a object|botfc>tracked shooter</a>.
ru: Колёса являются стандартным, быстрым и энергосберегающим режимом движения, который идеально подходит для относительно ровной местности. Если поверхность идет под уклон, лучше использовать вместо него <a object|botgj>Крылатый бот</a> или, если это невозможно, <a object|botgc>Гусеничный бот</a>.

source: <button 151/> Legged Shooter
ru: <button 151/> Стрелок Муравьиногий

source: Ant-legged creeping bot equipped with a fireball cannon.
ru: Стрелок Муравьиногий оснащён орудием огне-ядреным.

source: A moving legged shooter uses up half as much energy as a <a object|botfr>wheeled shooter</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
ru: Движущийся Муравьиногий бот расходует вдвое меньше энергии, чем <a object|botfr>Колёсный бот</a>. Муравьиногий бот также отлично приспособлен для карабканья по самым крутым склонам.

source: <button 138/> Tracked Grabber
ru: <button 138/> Погрузчик Гусеничный

source: Tracked bot equipped with an operating arm.
ru: Погрузчик Гусеничный оснащён манипулятором.

source: <button 32/> Grabs an object or lays it down again, at a position that is determined by one of the following options : <button 33/> The object is lying in front of the bot, on the ground or on the back of a second bot. <button 35/> The object is the bot's own power cell. <button 34/> The object is lying behind the bot, on the ground.
ru: <button 32/> Берёт объект или снова ставит его в положение, определяемое одним из следующих параметров : <button 33/> Объект лежит спереди бота, на земле или на спине второго бота. <button 35/> Объект это собственная Батарея бота. <button 34/> Объект лежит позади бота, на земле.

source: <a object|titanore>Titanium ore</a>.
ru: <a object|titanore>Руда Титановая</a>.

source: <a object|uranore>Uranium ore</a>.
ru: <a object|uranore>Руда Урановая</a>.

source: <a object|titan>Cube of titanium</a>.
ru: <a object|titan>Титан</a>.

source: <a object|power>Regular power cell</a>.
ru: <a object|power>Батарея Обычная</a>.

source: <a object|atomic>Nuclear power cell</a>.
ru: <a object|atomic>Батарея Ядерная</a>.

source: <a object|bbox>Black box</a>.
ru: <a object|bbox>Чёрный Ящик</a>.

source: <a object|key>Keys A, B, C, and D</a>.
ru: <a object|key>Ключи A, B, C, и D</a>.

source: <a object|bullet>Organic matter</a>.
ru: <a object|bullet>Био-Материя</a>.

source: Tracked bots can ascend steep inclinations but they are quite slow and use much energy. On flat ground for short distances, a <a object|botgr>wheeled grabber</a> is a better option. When it is possible to build <a object|botgj>winged bots</a>, these represent the best solution for long distances.
ru: Гусеничные боты могут подниматься по крутым склонам, но они довольно медленные и потребляют много энергии. На ровной земле на коротких дистанциях лучше подойдет <a object|botfr>Колёсный бот</a>. Когда можно построить <a object|botfj>Крылатых ботов</a>, то они лучше всего подходят для дальних расстояний.

source: A grabber won't function underwater. What you'll need instead is a <a object|botsub>subber</a>.
ru: Погрузчик не работает под водой. Вместо него вам понадобится <a object|botsub>Амфибия</a>.

source: To program the operating arm, use <code><a cbot|grab>grab</a></code> and <code><a cbot|drop>drop</a></code>.
ru: Чтобы запрограммировать манипулятор, используйте <code><a cbot|grab>grab</a></code> и <code><a cbot|drop>drop</a></code>.

source: <button 139/> Winged Grabber
ru: <button 139/> Погрузчик Крылатый

source: Jet propelled flying bot equipped with an operating arm.
ru: Погрузчик Крылатый оснащён реактивным двигателем и манипулятором.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botgr>wheeled grabber</a> instead.
ru: Крылатые боты могут перелетать через естественные препятствия, такие как горы или озера, но их энергия быстро заканчивается. На земле они медленные. Чтобы преодолеть небольшое расстояние, где не требуется летать, лучше использовать <a object|botfr>Колёсный бот</a>.

source: <button 137/> Wheeled Grabber
ru: <button 137/> Погрузчик Колёсный

source: Wheeled bot equipped with an operating arm.
ru: Погрузчик Колёсный оснащён манипулятором.

source: <a object|titan>Converted titanium</a>.
ru: <a object|titan>Преобразователь</a>.

source: <button 150/> Legged Grabber
ru: <button 150/> Погрузчик Муравьиногий

source: Ant-legged creeping bot equipped with an operating arm.
ru: Погрузчик Муравьиногий оснащён манипулятором.

source: A moving legged grabber uses up half as much energy as a <a object|botgr>wheeled grabber</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
ru: Муравьиногий бот расходует вдвое меньше энергии, чем <a object|botfr>Колёсный бот</a>. Муравьиногий бот также отлично приспособлен для карабканья по самым крутым склонам.

source: <button 154/> Tracked Orga Shooter
ru: <button 154/> Био-Стрелок Гусеничный

source: Tracked bot equipped with an orgaball cannon.
ru: Био-Стрелок Гусеничный оснащён орудием био-ядреным.

source: The orgaball cannon is more effective than the <a object|botfc>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
ru: Орудие био-ядреное более эффективно, чем <a object|botfc>орудие огне-ядреное</a>. Орудие стреляет небольшими токсичными ядрами из <a object|bullet>Био-Материи</a>. <a object|power>Батарея Обычная</a> позволит вам сделать всего 11 выстрелов.

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botor>wheeled orga shooter</a> is a better option. When it is possible to build <a object|botoj>winged bots</a>, these represent the best solution for long distances.
ru: Гусеничные боты могут взбираться на крутые склоны, но они довольно медленные и используют много энергии. На ровной земле и для коротких дистанциях лучше использовать <a object|botor>Колёсный бот</a>. Если можно построить <a object|botoj>Крылатых ботов</a>, то они лучше всего подойдут для больших расстояний.

source: To program the orgaball cannon, use <code><a cbot|fire>fire</a></code>. To raise or lower the aim, use <code><a cbot|aim>aim</a></code>.
ru: Чтобы запрограммировать орудие, используйте <code><a cbot|fire>fire</a></code>. Чтобы поднять или опустить прицел, используйте <code><a cbot|aim>aim</a></code>.

source: <button 155/> Winged Orga Shooter
ru: <button 155/> Био-Стрелок Крылатый

source: Jet propelled flying bot equipped with an orgaball cannon.
ru: Био-Стрелок Крылатый оснащён реактивным двигателем и орудием био-ядреным.

source: The orgaball cannon is more effective than the <a object|botfj>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
ru: Орудие био-ядреное более эффективно, чем <a object|botfc>орудие огне-ядреное</a>. Орудие стреляет небольшими токсичными ядрами из <a object|bullet>Био-Материи</a>. <a object|power>Батарея Обычная</a> позволит вам сделать всего 11 выстрелов.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botor>wheeled orga shooter</a> instead.
ru: Крылатые боты могут перелетать через естественные препятствия, такие как горы или озера, но их энергия быстро заканчивается. На земле они медленные. Чтобы преодолеть небольшое расстояние, где не требуется летать, лучше использовать <a object|botfr>Колёсный бот</a>.

source: <button 153/> Wheeled Orga Shooter
ru: <button 153/> Био-Стрелок Колёсный

source: Wheeled bot equipped with an orgaball cannon.
ru: Био-Стрелок Колёсный оснащён орудием био-ядреным.

source: The orgaball cannon is more effective than the <a object|botfr>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
ru: Орудие био-ядреное более эффективно, чем <a object|botfc>орудие огне-ядреное</a>. Орудие стреляет небольшими токсичными ядрами из <a object|bullet>Био-Материи</a>. <a object|power>Батарея Обычная</a> позволит вам сделать всего 11 выстрелов.

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to instead use a <a object|botoj>winged orga shooter</a>, or, if this is impossible, a <a object|botoc>tracked orga shooter</a>.
ru: Колёса являются стандартным, быстрым и энергосберегающим режимом движения, который идеально подходит для относительно ровной местности. Если поверхность идет под уклон, лучше использовать вместо него <a object|botgj>Крылатый бот</a> или, если это невозможно, <a object|botgc>Гусеничный бот</a>.

source: <button 156/> Legged Orga Shooter
ru: <button 156/> Био-Стрелок Муравьиногий

source: Ant-legged creeping bot equipped with an orgaball cannon.
ru: Био-Стрелок Муравьиногий оснащён орудием био-ядреным.

source: The orgaball cannon is more effective than the <a object|botfs>fireball cannon</a>. It shoots small spheres of corrosive <a object|bullet>organic matter</a>. A <a object|power>regular power cell</a> will allow you to shoot 11 orgaball bursts.
ru: Орудие био-ядреное более эффективно, чем <a object|botfc>орудие огне-ядреное</a>. Орудие стреляет небольшими токсичными ядрами из <a object|bullet>Био-Материи</a>. <a object|power>Батарея Обычная</a> позволит вам сделать всего 11 выстрелов.

source: A moving legged orga shooter uses up half as much energy as a <a object|botor>wheeled orga shooter</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
ru: Движущийся Муравьиногий бот расходует вдвое меньше энергии, чем <a object|botfr>Колёсный бот</a>. Муравьиногий бот также отлично приспособлен для карабканья по самым крутым склонам.

source: <button 147/> Phazer Shooter
ru: <button 147/> Стрелок Ферзь

source: Tracked bot equipped with a very powerful phazer cannon, efficient against most kinds of enemies. When you aim upward, it can shoot up to 60 meters. It is the only weapon that can kill the <a object|mother>Alien Queen</a>.
ru: Стрелок Ферзь Гусеничный оснащён очень мощным фазированным орудием, эффективным против большинства типов врагов. Когда вы прицеливаетесь вверх, оно может стрелять на расстояние до 60 метров. Это единственное орудие, которое может убить <a object|mother>Королеву Пришельцев</a>.

source: To program the phazer cannon, use <code><a cbot|fire>fire</a></code>. To raise or lower the aim, use <code><a cbot|aim>aim</a></code>.
ru: Чтобы запрограммировать орудие, используйте <code><a cbot|fire>fire</a></code>. Чтобы поднять или опустить прицел, используйте <code><a cbot|aim>aim</a></code>.

source: <button 148/> Recycler
ru: <button 148/> Утилизатор

source: Tracked bot designed to convert a <a object|wreck>derelict bot</a> back into a reusable <a object|titan>titanium cube</a>.
ru: Утилизатор Гусеничный, предназначен для переработки <a object|wreck>Обломки бота</a> обратно в <a object|titan>Титан</a>.

source: To program the recycling of a derelict bot, use <code><a cbot|recycle>recycle</a></code>.
ru: Чтобы запрограммировать Утилизатор используйте <code><a cbot|recycle>recycle</a></code>.

source: <button 141/> Tracked Sniffer
ru: <button 141/> Разведчик Гусеничный

source: Tracked bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
ru: Разведчик Гусеничный оснащён гео-радаром для поиска подземных недр. Всякий раз, когда обнаруживается что-то полезное, гео-радар срабатывает и ставит следующие отметки:

source: a <a object|stonspot>red cross</a> -> <a object|titanore>titanium ore</a>.
ru: <a object|stonspot>Крест Красный</a> -> <a object|titanore>Руда Титановая</a>.

source: a <a object|uranspot>yellow circle</a> -> <a object|uranore>uranium ore</a>.
ru: <a object|uranspot>Круг Жёлтый</a> -> <a object|uranore>Руда Урановая</a>.

source: a <a object|enerspot>green cross</a> -> energy deposit, useful for a <a object|station>power station</a> or a <a object|energy>power plant</a>.
ru: <a object|enerspot>Крест Зелёный</a> -> месторождение энергии для <a object|station>Энергозаправки</a> или <a object|energy>Энергостанции Обычной</a>.

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botsr>wheeled sniffer</a> is a better option. When it is possible to build <a object|botsj>winged bots</a>, these represent the best solution for long distances.
ru: Гусеничные боты могут подниматься по крутым склонам, но они довольно медленные и потребляют много энергии. На ровной земле на коротких дистанциях лучше подойдет <a object|botfr>Колёсный бот</a>. Когда можно построить <a object|botfj>Крылатых ботов</a>, то они лучше всего подходят для дальних расстояний.

source: To program the sniffing arm, use <code><a cbot|sniff>sniff</a></code>.
ru: Чтобы запрограммировать гео-радар, используйте <code><a cbot|sniff>sniff</a></code>.

source: <button 157/> Shielder
ru: <button 157/> Защитник

source: Tracked bot designed to protect and defend against all <a object|mother>enemy</a> attacks within a perimeter of 10 to 25 meters. The individual shields of bots and buildings are re-energized through the shielder's defensive actions. This bot is the only way to get through narrow passages adorned with poisonous green mushrooms.
ru: Защитник Гусеничный предназначен для обороны и защищает от всех видов атак <a object|mother>врага</a> в пределах от 10 до 25 метров. Индивидуальные щиты ботов и строений снова перезаряжается энергией благодаря оборонительным способностям Защитника. Этот бот - единственный способ пробраться через узкие проходы, заросшие ядовитыми зелёными грибами.

source: A <a object|power>regular power cell</a> allows for a 20-second activity span with a radius of 25 meters, much too short in most cases. A <a object|atomic>nuclear power cell</a> is of course more suited to this bot.
ru: <a object|power>Батарея Обычная</a> допускает 20-секундный период активности в радиусе 25 метров, что в большинстве случаев недостаточно. Для этого бота, лучшим решением будет<a object|atomic>Батарея Ядерная</a>.

source: The energy consumption is proportional to the radius of the protective sphere. With a radius of 10 meters, the bot can work 2.5 times longer than with the maximum radius of 25 meters.
ru: Расход энергии пропорционален радиусу защитной сферы. При радиусе 10 метров бот может работать в 2,5 раза дольше, чем при максимальном радиусе в 25 метров.

source: To program the deployment of the shield, use <code><a cbot|shield>shield</a></code>.
ru: Чтобы запрограммировать развертывание щита, используйте<code><a cbot|shield>shield</a></code>.

source: <button 142/> Winged Sniffer
ru: <button 142/> Разведчик Крылатый

source: Jet propelled flying bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
ru: Разведчик Крылатый оснащён реактивным двигателем и гео-радаром для поиска подземных недр. Всякий раз, когда обнаруживается что-то полезное, гео-радар срабатывает и ставит следующие отметки:

source: The display at the bottom of your screen indicates the temperature of the reactor. Keep an eye on it. If the reactor overheats, the engine stops and the bot crashes.
ru: Дисплей внизу вашего экрана показывает температуру реактивного двигателя. Следите за ней. Если реактор перегреется, двигатель остановится и бот рухнет.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply uses up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botsr>wheeled sniffer</a> instead.
ru: Крылатые боты могут перелетать через естественные препятствия, такие как горы или озера, но их энергия быстро заканчивается. На земле они медленные. Чтобы преодолеть небольшое расстояние, где не требуется летать, лучше использовать <a object|botfr>Колёсный бот</a>.

source: <button 140/> Wheeled Sniffer
ru: <button 140/> Разведчик Колёсный

source: Wheeled bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
ru: Разведчик Колёсный оснащён гео-радаром для поиска подземных недр. Всякий раз, когда обнаруживается что-то полезное, гео-радар срабатывает и ставит следующие отметки:

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to use a <a object|botsj>winged sniffer</a> instead, or, if this is impossible, a <a object|botsc>tracked sniffer</a>.
ru: Колёса являются стандартным, быстрым и энергосберегающим режимом движения, который идеально подходит для относительно ровной местности. Если поверхность идет под уклон, лучше использовать вместо него <a object|botgj>Крылатый бот</a> или, если это невозможно, <a object|botgc>Гусеничный бот</a>.

source: <button 152/> Legged Sniffer
ru: <button 152/> Разведчик Муравьиногий

source: Ant-legged creeping bot equipped to prospect the geological structure of the subsoil. Whenever it locates something of use, the sniffer lays down the following marks:
ru: Разведчик Муравьиногий оснащён гео-радаром для поиска подземных недр. Всякий раз, когда обнаруживается что-то полезное, гео-радар срабатывает и ставит следующие отметки:

source: A moving legged shooter uses up half as much energy as a <a object|botsr>wheeled sniffer</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
ru: Движущийся Муравьиногий бот расходует вдвое меньше энергии, чем <a object|botfr>Колёсный бот</a>. Муравьиногий бот также отлично приспособлен для карабканья по самым крутым склонам.

source: <button 149/> Subber
ru: <button 149/> Амфибия

source: Amphibious tracked bot equipped with an operating claw. The subber is the only bot capable of moving and running operations underwater.
ru: Амфибия Гусеничный оснащён манипулятором. Амфибия - единственный бот, способный перемещаться и выполнять операции под водой.

source: It is best to check the <a object|power>power cell</a> readings prior to immersion since replacing or recharging it underwater is impossible. The subber can only pick up objects from the ground, as opposed to, for example, a battery from the back of another bot.
ru: Лучше всего проверить заряд <a object|power>Батареи</a> перед погружением, так как замена или перезарядка под водой невозможны. Амфибия может подбирать объекты только с земли, в отличие, например, от батареи со спины другого бота.
