Repository: DavydovMA/colobot-data
Catalog: help/bots/po/*.po
Languages: ru

source: To program the operating claw, use <code><a cbot|grab>grab</a></code> and <code><a cbot|drop>drop</a></code>.
ru: Чтобы запрограммировать манипулятор, используйте <code><a cbot|grab>grab</a></code> и <code><a cbot|drop>drop</a></code>.

source: <button 173/> Target Bot
ru: <button 173/> Бот Цель

source: Wheeled bot intended solely for target practice. It is autonomous and its trajectory is dependant upon the nature of the exercise.
ru: Бот Колёсный, предназначен исключительно для тренировок в стрельбе. Он автономен, и его траектория движения зависит от типа тренировки.

source: Note that target bots, loaded as they are with <a object|tnt>TNT</a>, are extremely sensitive to shocks.
ru: Заметьте, что целевые боты загружены <a object|tnt>TNT</a>, и чрезвычайно чувствительны к ударам и взрываются.

source: <button 158/> Practice Bot
ru: <button 158/> Бот Учебный

source: Wheeled bot intended solely for training and practice. Its only purpose is to help you get accustomed to the programming of the bots' various ground movements.
ru: Бот Колёсный, предназначен исключительно для обучения и практики. Его единственная цель - помочь вам привыкнуть к программированию различных передвижений ботов по земле.

source: Instructions
ru: Инструкции

source: To program the bot's movements, use the following commands: <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.
ru: Чтобы запрограммировать передвижение бота, используйте следующие команды : <code><a cbot|move>move</a></code>, <code><a cbot|turn>turn</a></code>, <code><a cbot|motor>motor</a></code>, <code><a cbot|goto>goto</a></code>.

source: <button 146/> Thumper
ru: <button 146/> Кувалдник

source: Tracked bot designed to hit the ground with enormous force. The purpose of the thumping is to turn <a object|ant>ants</a> and <a object|spider>spiders</a> belly up within a radius of 100 meters. An insect on its back is not dead but will struggle to get right side up again. After approximately 60 seconds of effort, it will usually succeed.
ru: Бот Гусеничный, предназначен для нанесения удара по земле с огромной силой. Цель удара - перевернуть <a object|ant>Муравьев</a> и <a object|spider>Пауков</a> в радиусе 100 метров. Насекомое на спине не умрет, но будет стараться снова перевернуться и встать на лапки. Примерно через 60 секунд усилий это обычно удается.

source: To visualize the zone of impact, hit the <range> button <button 41/>. Little red dots outline the circular zone for 20 seconds.
ru: Чтобы показать зону действия удара, нажмите <range> кнопку <button 41/>. Маленькие красные точки очертят круговую зону на 20 секунд.

source: The bot uses up a large amount of power. A thump will drain 2/5ths of a <a object|power>regular power cell</a>.
ru: Бот потребляет большое количество энергии. При ударе расходуется 2/5 энергии от <a object|power>Батареи Обычной</a>.

source: To program the thumping, use <code><a cbot|thump>thump</a></code>.
ru: Чтобы запрограммировать удары, используйте <code><a cbot|thump>thump</a></code>.

source: The following objects can be transported :
ru: Следующие объекты могут быть перемещены :

source: TODO
ru: ВЫПОЛНИТЬ

source: <button 193/> Tracked Builder
ru: <button 193/> Строитель Гусеничный

source: Tracked bot equipped with a neutron gun.
ru: Строитель Гусеничный оснащён орудием нейтронным.

source: <button 196/> Opens a build menu with the following options : <button 160/> <code><a object|factory>BotFactory</a> </code>Robot Factory <button 163/> <code><a object|research>ResearchCenter</a> </code>Research Center <button 168/> <code><a object|radar>RadarStation</a> </code>Radar <button 172/> <code><a object|exchange>ExchangePost</a> </code>Information Exchange Post <button 169/> <code><a object|repair>RepairCenter</a> </code>Repair Center <button 165/> <code><a object|tower>DefenseTower</a> </code>Defense Tower <button 166/> <code><a object|labo>AutoLab</a> </code>Organic Matter Analyzer <button 164/> <code><a object|station>PowerStation</a> </code>Power Station <button 167/> <code><a object|energy>PowerPlant</a> </code>Power Cell Factory <button 170/> <code><a object|nuclear>NuclearPlant</a> </code>Nuclear Plant <button 162/> <code><a object|convert>Converter</a> </code>Titanium Converter <button 161/> <code><a object|derrick>Derrick</a> </code>Derrick <button 174/> <code><a object|captor>PowerCaptor</a> </code>Parabolic Lightning Conductor <button 175/> <code><a object|safe>Vault</a> </code>Vault
ru: <button 196/> Открывает меню строений со следующими параметрами : <button 160/> <code><a object|factory>BotFactory</a> </code>Фабрика Ботов <button 163/> <code><a object|research>ResearchCenter</a> </code>Центр Исследований <button 168/> <code><a object|radar>RadarStation</a> </code>Радар <button 172/> <code><a object|exchange>ExchangePost</a> </code>Пункт Обмена Информацией <button 169/> <code><a object|repair>RepairCenter</a> </code>Пункт Ремонта <button 165/> <code><a object|tower>DefenseTower</a> </code>Башня Обороны <button 166/> <code><a object|labo>AutoLab</a> </code>Лаборатория <button 164/> <code><a object|station>PowerStation</a> </code>Энергозаправкa <button 167/> <code><a object|energy>PowerPlant</a> </code>Энергостанция Обычная <button 170/> <code><a object|nuclear>NuclearPlant</a> </code>Энергостанция Ядерная <button 162/> <code><a object|convert>Converter</a> </code>Преобразователь <button 161/> <code><a object|derrick>Derrick</a> </code>Вышка <button 174/> <code><a object|captor>PowerCaptor</a> </code>Молниеотвод <button 175/> <code><a object|safe>Vault</a> </code>Ангар

source: Tracked bots can ascend steep inclinations but they are quite slow and use a lot of energy. On flat ground for short distances, a <a object|botbr>wheeled builder</a> is a better option. When it is possible to build <a object|botbj>winged bots</a>, these represent the best solution for long distances.
ru: Гусеничные боты могут подниматься по крутым склонам, но они довольно медленные и потребляют много энергии. На ровной земле на коротких дистанциях лучше подойдет <a object|botfr>Колёсный бот</a>. Когда можно построить <a object|botfj>Крылатых ботов</a>, то они лучше всего подходят для дальних расстояний.

source: To program the neutron gun, use <code><a cbot|build>build</a></code>.
ru: Чтобы запрограммировать орудие, используйте <code><a cbot|build>build</a></code>.

source: <button 194/> Winged Builder
ru: <button 194/> Строитель Крылатый

source: Jet propelled flying bot equipped with a neutron gun.
ru: Строитель Крылатый оснащён реактивным двигателем и орудием нейтронным.

source: Winged bots can fly across natural obstacles such as mountains or lakes but their energy supply is used up quickly. They're slow on the ground. To cover a short distance that will not call for flying, it is recommended to use a <a object|botbr>wheeled builder</a> instead.
ru: Крылатые боты могут перелетать через естественные препятствия, такие как горы или озера, но их энергия быстро заканчивается. На земле они медленные. Чтобы преодолеть небольшое расстояние, где не требуется летать, лучше использовать <a object|botfr>Колёсный бот</a>.

source: <button 192/> Wheeled Builder
ru: <button 192/> Строитель Колёсный

source: Wheeled bot equipped with a neutron gun.
ru: Строитель Колёсный оснащён орудием нейтронным.

source: Wheels constitute a standard, fast and energy-saving mode of propulsion, which is perfectly adapted for a relatively flat terrain. Whenever the terrain gets sloped, it is advised to use a <a object|botbj>winged builder</a> instead, or, if this is impossible, a <a object|botbc>tracked builder</a>.
ru: Колёса являются стандартным, быстрым и энергосберегающим режимом движения, который идеально подходит для относительно ровной местности. Если поверхность идет под уклон, лучше использовать вместо него <a object|botgj>Крылатый бот</a> или, если это невозможно, <a object|botgc>Гусеничный бот</a>.

source: <button 195/> Legged Builder
ru: <button 195/> Строитель Муравьиногий

source: Ant-legged creeping bot equipped with a neutron gun.
ru: Строитель Муравьиногий оснащён орудием нейтронным.

source: A moving legged builder uses up half as much energy as a <a object|botbr>wheeled builder</a>. A legged bot is also perfectly adapted to climb the steepest slopes.
ru: Муравьиногий бот расходует вдвое меньше энергии, чем <a object|botfr>Колёсный бот</a>. Муравьиногий бот также отлично приспособлен для карабканья по самым крутым склонам.
