Repository: DavydovMA/colobot-data
Catalog: levels/missions/chapter003/level002/po/*.po
Languages: ru

source: Amnesia
ru: Амнезия

source: Find your spaceship in the Tropica maze.
ru: Найдите свой Космический Корабль в лабиринте Тропики.

source: From Mission Control
ru: Из Центра Управления

source: It is our hope that this message will reach you.
ru: Мы надеемся, что Вы получите это сообщение.

source: A transmission from the observation satellite a few hours ago informed us that you seemed to be wandering in a frighteningly uncoordinated manner. Your SatCom has ceased broadcasting. Your reactor seems to have suffered some sort of damage and your helmet was spotted at the bottom of a lake. If this is indeed the case, do not try to retrieve it, do not go into the water! Water on Tropica is highly toxic. You would not survive it.
ru: В передаче со спутника наблюдения несколько часов назад сообщается, что Вы перемещаетесь каким-то странным образом. Ваш СатКом прекратил передачу. Ваш реактивный двигатель, похоже, получил повреждения, а Ваш шлем был обнаружен на дне озера. Если это действительно так, не пытайтесь вернуть его, не заходите в воду! Вода на Тропике очень токсична. Вы не переживёте этого.

source: Get back to your ship as quickly as possible and try to transmit information about the possible causes of this disaster. The satellite's information remains undecipherable. We have been speculating about an X-factor ever since the first expedition got lost. It appears you have just encountered it.
ru: Вернитесь на свой Корабль как можно быстрее и попробуйте передать информацию о возможных причинах этого несчастья. Информация со спутников окончательно не расшифрована. Мы думаем о X-факторе, поскольку первая экспедиция пропала. Похоже, Вы только что столкнулись с тем же.

source: There is nothing we can really do to guide you but don't forget that you're following in the footsteps of a previous expedition. If what happened to you is what happened to them, chances are they may have left some clues along the way back to their own spaceship which landed in roughly the same area as yours. Use those clues.
ru: Мы ничего не можем сделать, чтобы помочь Вам, но не забывайте, что Вы следуете по стопам предыдущей экспедиции. Если с Вами произошло то, что произошло с ними, есть шанс, что они оставили подсказки по пути обратно к своему Космическому Кораблю, который приземлился примерно в том же районе, что и Ваш. Используйте эти подсказки.

source: You may also want to consider planting flags. They indicate the direction of the wind so you can use them to orient yourself.
ru: Вы также можете захотеть расставить флаги. Они покажут направление ветра, чтобы Вы могли использовать их для ориентирования.

source: This is all we can say for now... Good Luck...
ru: Это всё, что мы можем сказать сейчас... Удачи...

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
ru: <format key><key help/></format> позволяет Вам просмотреть эти инструкции в любое время с помощью Вашего личного СатКом <button 63/>.

source: See also
ru: Смотрите также

source: <a command>Controls</a>
ru: <a command>Управление</a>

source: Walkthrough
ru: Прохождение

source: Here is a breakdown of the steps to follow to get back to the spaceship.
ru: Вот последовательность шагов, чтобы вернуться к Космическому Кораблю.

source: Go round the lake, and head towards the green fluorescent globe. This globe is generated by a gravi-plant that will make flight impossible inside the globe.
ru: Обойдите озеро и направляйтесь в сторону зелёного светящегося шара. Этот шар создаётся грави-растением, что делает полёт невозможным внутри шара.

source: Follow the left flank of the valley, passing a pond on your right, and climb the small slope. On top you will be facing some giant ants: run as fast as you can towards another gravi-plant a little further on your right, your wounds will have time to heal later.
ru: Следуйте по левой стороне долины, обойдите пруд справа от Вас, и поднимитесь на маленький склон. Наверху Вы столкнётесь с несколькими гигантскими муравьями: бегите как можно быстрее к другому грави-растению чуть дальше справа, Ваши раны успеют зажить позже.

source: Use your reactor to fly past the lake before the gravi-plant on your right.
ru: Используйте свой реактивный двигатель, чтобы перелететь через озеро до грави-растения правее от Вас.

source: When you leave the gravi-plant, keep on the left-hand side of the lake, and follow the shore until you reach a peninsula adorned with fern-like plants.
ru: Когда Вы покинете грави-растение, держитесь на левой стороне озера и следуйте по берегу, пока Вы не достигнете полуострова, украшенного растениями папоротника.

source: Do some island-hopping across the larger lake. Aim for the trees in order to avoid falling into the water on the other side of the island. The last island is 50 cm under water but you can still land on it without having your head submerged.
ru: Перепрыгните через большое озеро. Направляйтесь к деревьям, чтобы избежать падения в воду на другой стороне острова. Последний остров находится на 50 см. под водой, но Вы можете приземлиться на нём, не окунувшись с головой.

source: The path continues to the left. A giant ant is waiting for you there, but it will not do you much harm.
ru: Тропа ведёт налево. Там Вас поджидает гигантский муравей, но особого вреда он Вам не принесёт.

source: Give your reactor enough time to cool down, then fly across the small lake. Try to land as high on the right as you can, this is the best way not to fall into the second lake.
ru: Дайте Вашему реактивному двигателю остыть, затем перелетите через небольшое озеро. Попытайтесь приземлиться как можно выше справа, это лучший способ не упасть во второе озеро.

source: Cross the second lake, get aboard the spaceship, and take off.
ru: Переберитесь через второе озеро, взойдите на борт Космического Корабля и взлетайте.
