Repository: DavydovMA/colobot-data
Catalog: levels/battles/chapter001/level003/po/*.po
Languages: ru

source: Code battle - vs other player
ru: Битва программ - против другого игрока

source: Challenge your friend!
ru: Бросьте вызов своему другу!

source: Code Battle (vs Player)
ru: Битва Программ (против Игрока)

source: This is <a battles>a code battle</a> level, where you fight against an other program, presumably written by some other player.
ru: Этот уровень <a battles>Битвы программ</a>, где Вы сражаетесь с другой программой, предположительно написанной другим игроком.

source: Objective
ru: Цель

source: Destroy the other team located on the opposite side of the river.
ru: Уничтожьте другую команду, находящуюся на противоположной стороне реки.

source: Notes\m notes;
ru: Заметки\m заметки;

source: There is <a object/enerspot>an underground power source</a> only under the beginning base areas.
ru: <a object|enerspot>Подземное Месторождение Энергии</a> находится только под начальной базой.

source: You can try to find a program to fight against in the International Colobot Community (<code>http://colobot.info</code>).
ru: Вы можете попробовать найти программу, с которой можно бороться, в International Colobot Community (<code>http://colobot.info</code>).

source: The pre-built <a object|derrick>Derricks</a> and <a |object\radar>RadarStations</a> are indestructible.
ru: Предварительно построенные <a object|derrick>Вышка</a> и <a object|radar>Радар</a> неразрушимы.
