Repository: DavydovMA/colobot-data
Catalog: levels/missions/chapter003/level005/po/*.po
Languages: ru

source: Black Box
ru: Чёрный Ящик

source: Explore the underwater world looking for another black box.
ru: Исследуйте подводный мир в поисках другого Чёрного Ящика.

source: From Mission Control
ru: Из Центра Управления

source: Locate and retrieve another <a object|bbox>black box</a> from the previous expedition.
ru: Найдите и извлеките другой <a object|bbox>Чёрный Ящик</a> от предыдущей экспедиции.

source: The observation satellite seems to have spotted it underwater. Water is harmless to you as long as you wear your helmet but keep in mind that you can't carry objects underwater. A <a object|botsub>subber</a> may come in handy.
ru: Спутник наблюдения, кажется, заметил его под водой. Вода безвредна для Вас, пока Вы одеты в шлем, но имейте ввиду, что Вы не можете нести предметы под водой. <a object|botsub>Амфибия</a> может оказаться кстати.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
ru: <format key><key help/></format> позволяет Вам просмотреть эти инструкции в любое время с помощью Вашего личного СатКом <button 63/>.

source: See also
ru: Смотрите также

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
ru: <a command>Управление</a> и <a cbot>Язык CBOT</a>

source: Satellite Report
ru: Спутниковый Отчёт

source: Currently in a geo-stationary orbit of Tropica.
ru: Сейчас на геостационарной орбите Тропики.

source: -> SURFACE<c/>
ru: -> ПОВЕРХНОСТЬ<c/>

source: \tab;Temperature: 29.4C \tab;Atmosphere: helium, oxygen \tab;Wind: 0.3 mps \tab;Titanium ore: some \tab;Uranium ore: none
ru: \tab;Температура: 29.4C \tab;Атмосфера: гелий, кислород \tab;Ветер: 0.3 м/с \tab;Руда Титановая: немного \tab;Руда Урановая: отсутствует

source: -> SUBSOIL<c/>
ru: -> НЕДРА<c/>

source: \tab;Energy source: none \tab;Titanium ore: none \tab;Uranium ore: none
ru: \tab;Энергия: отсутствует \tab;Руда Титановая: отсутствует \tab;Руда Урановая: отсутствует

source: -> ADDITIONAL INFORMATION<c/>
ru: -> ДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ<c/>

source: \tab;Detected: titanium ore \tab; - Requires: converter \tab;Detected: scattered derelicts \tab;Detected: black box (underwater)
ru: \tab;Обнаружено: Руда Титановая \tab; - Требует: Преобразователь \tab;Обнаружено: много хлама \tab;Обнаружено: Чёрный Ящик (под водой)

source: Walkthrough
ru: Прохождение

source: Locate the <a object|bbox>black box</a> on your own. You can try to spot it from above, using your jet engine, or dive into the water.
ru: Найдите <a object|bbox>Чёрный Ящик</a> самостоятельно. Вы можете попытаться обнаружить его сверху, используя свой реактивный двигатель или погрузиться в воду.

source: Build a <a object|convert>converter</a> near the chunks of titanium ore. You'll find them in the vicinity of the spaceship to the east.
ru: Постройте <a object|convert>Преобразователь</a> вблизи кусков Руды Титановой. Вы найдёте их поблизости от Космического Корабля на востоке.

source: Produce two <a object|titan>cubes</a>.
ru: Переработайте два <a object|titan>куба</a>.

source: Build a <a object|factory>bot factory</a> not too far from the black box.
ru: Постройте <a object|factory>Фабрику Ботов</a> не слишком далеко от Чёрного Ящика.

source: Manufacture a <a object|botsub>subber</a>.
ru: Изготовьте <a object|botsub>Амфибию</a>.

source: Bring the black box back on board.
ru: Перенесите Чёрный Ящик на борт.

source: Take off.
ru: Взлетайте.

source: The black box is lying at the bottom of a small lake, northeast of the spaceship.
ru: Чёрный Ящик лежит на дне небольшого озера, к северо-востоку от Космического Корабля.

source: You can build the bot factory right beside the lake, on the south bank.
ru: Вы можете построить Фабрику Ботов прямо рядом с озером, на южном берегу.

source: <a command>Controls</a>
ru: <a command>Управление</a>
