Repository: DavydovMA/colobot-data
Catalog: levels/exercises/chapter003/level004/po/*.po
Languages: ru

source: Exchange posts 1
ru: Пункты Обмена Информацией 1

source: Collect valuable information from information exchange posts.
ru: Получите важную информацию из Пунктов Обмена Информацией.

source: Exercise
ru: Упражнение

source: Several <a object|exchange>information exchange posts</a> stand in the middle of a <a object|mine>mine</a> field. When the bot is close enough to an exchange post, it can read the information that it contains. Every exchange post contains the angle of the rotation that must be performed in order to reach the next exchange post, without touching a <a object|mine>mine</a>. The exchange posts are distant 20m from each other.
ru: Несколько <a object|exchange>Пунктов Обмена Информацией</a> стоят посреди <a object|mine>минного</a> поля. Когда бот достаточно близко к Пункту Обмена Информацией, он может прочитать информацию, которая там содержится. Каждый Пункт Обмена Информацией содержит угол поворота, на который нужно повернуть, чтобы перейти к следующему Пункту Обмена Информацией, не дотронувшись к <a object|mine>мине</a>. Пункты Обмена Информацией расположены на расстоянии 20 метров друг от друга.

source: General principe
ru: Общий принцип

source: Move 20m forward.
ru: Передвинуться 20 метров вперёд.

source: Read the direction of the next <a object|exchange>information exchange post</a>.
ru: Прочитать направление к следующему <a object|exchange>Пункту Обмена Информацией</a>.

source: Execute the necessary rotation.
ru: Выполнить необходимый поворот.

source: In order to repeat the steps above, use a <code><a cbot|for>for</a></code> loop, as we saw it before.
ru: Чтобы повторить шаги выше, используйте цикл <code><a cbot|for>for</a></code>, как мы делали это раньше.

source: Move forward with the instruction <c/>move(20);<n/>.
ru: Передвинуться вперёд с помощью инструкции <c/>move(20);<n/>.

source: Use the instruction <c/><a cbot|receive>receive</a>("Direction");<n/> in order to read the information contained in the <a object|exchange>exchange post</a>. This is of course possible only when the bot is close enough to the exchange post. You will need a <a cbot|var>variable</a> to contain the value retrieved from the exchange post. Let us call it <code>dir</code>; you must declare it with the following line:
ru: Используйте инструкцию <c/><a cbot|receive>receive</a>("Direction");<n/> чтобы прочитать информацию содержащуюся в <a object|exchange>Пункте Обмена Информацией</a>. Это возможно только когда бот достаточно близко к Пункту Обмена Информацией. Вам понадобиться <a cbot|var>переменная</a>, чтобы сохранить значение, полученное из Пункта Обмена Информацией. Давайте назовем её <code>dir</code>; Вы должны объявить её следующей строкой:

source: Then retrieve the rotation angle from the exchange post, and put it into the variable:
ru: Затем получите угол поворота из Пункта Обмена Информацией, и сохраните его в переменной:

source: Then you can execute the rotation:
ru: Затем Вы можете выполнить поворот:

source: Remark
ru: Комментарий

source: You can click on an <a object|exchange>information exchange post</a> in order to read what information it contains. In this exercise, every exchange post contains only one value called <code>"Direction"</code>, but it can contain up to 10 different values, as you will see in some of the following exercises.
ru: Вы можете нажать на <a object|exchange>Пункт Обмена Информацией</a>, чтобы прочитать, какую информацию он содержит. В этом упражнении каждый Пункт Обмена Информацией содержит только одно значение, которое называется <code>"Напрвление"</code>, но он может содержать до 10 различных значений, как Вы увидите в некоторых следующих упражнениях.

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Repeat 5 times :
ru: Повторять 5 раз :
