Repository: DavydovMA/colobot-data
Catalog: levels/exercises/chapter006/level003/po/*.po
Languages: ru

source: Remote control #2
ru: Дистанционное управление #2

source: Remote control a robot using an information exchange post, so it will pass over the 6 blue waypoints.
ru: Дистанционное управление ботом используя Пункт Обмена Информацией, чтобы он прошёл по 6 синим точкам.

source: Exercise
ru: Упражнение

source: Remote control a robot using an <a object|exchange>information exchange post</a>, so it will pass over the 6 blue waypoints. The main actors of this exercise are:
ru: Дистанционное управление ботом используя <a object|exchange>Пункт Обмена Информацией</a>, чтобы он прошёл по 6 синим точкам. Основные составляющие этого упражнения:

source: A <a object|botgr>wheeled grabber</a> robot without an energy cell. This is the master you have to program.
ru: <a object|botgr>Погрузчик Колёсный</a> без Батареи. Это ведущий, который Вам нужно запрограммировать.

source: An <a object|exchange>information exchange post</a> that receives information from the master and then transmits it to the slave.
ru: <a object|exchange>Пункт Обмена Информацией</a>, который получает информацию от ведущего, а затем передает её ведомому.

source: A <a object|bottr>practice bot</a> which waits for orders from the exchange post. This robot has already been programmed.
ru: <a object|bottr>Бот Учебный</a>, который ждёт приказы из Пункта Обмена Информацией. Этот бот уже запрограммирован.

source: An information exchange post stores "name/value" couples. To control the "slave" robot we use two couples:
ru: Пункт Обмена Информацией хранит пары "name/value". Для управления "ведомым" ботом, мы используем только одну пару:

source: name="order", value=order number
ru: name="order", value=order число

source: nom="param", valuer=parameter for the operation
ru: nom="param", valuer=parameter для приказа

source: Order #1 means "move" and order #2 means "turn". The parameter is the distance to move or the turning angle. For example to make the slave move 20 meters write: <c/><s/> <a cbot|send>send</a>("order", 1, 100); // order "move"
ru: Приказ #1 будет "move", а приказ #2 будет "turn". Параметром являться расстояние или угол поворота. Например, чтобы ведомый передвинулся 20 метров напишите: <c/><s/> <a cbot|send>send</a>("order", 1, 100); // приказ "move"

source: <a cbot|send>send</a>("param", 20, 100); // distance 20 meters
ru: <a cbot|send>send</a>("param", 20, 100); // расстояние 20 метров

source: These two instruction send following 2 pieces of information to the exchange post: <c/> order=1 param=20
ru: Эти две инструкции отправляют 2 части информации в Пункт Обмена Информацией: <c/> order=1 param=20

source: The slave robot waits for an order and executes it. Once the order has been executed by the slave, it removes the order from the exchange post. Once an order has been sent, the master must wait for the slave finishing the order before sending the next order. This is done by testing if the order is still inside the exchange post. Just write: <c/><s/> while ( <a cbot|testinfo>testinfo</a>("order", 100) ) // wait for end of work
ru: Ведомый бот ждёт приказ и выполняет его. После того, как приказ был выполнен ведомым, он удаляется из Пункта Обмена Информацией. После отправки приказа, ведущий должен дождаться пока ведомый выполнит приказ, прежде чем отправлять следующий приказ. Это делается проверкой находится ли приказ в Пункте Обмена Информацией. Просто напишите: <c/><s/> while ( <a cbot|testinfo>testinfo</a>("order", 100) ) // ждать окончания работы

source: As we must give more than one order its most convenient to write a <a cbot|function>function</a> <code>SendToPost</code>, that sends the order and wait for its completion: <c/><s/>void object::SendToPost(float order, float param)
ru: Поскольку мы должны передать более одного приказа, удобней написать <a cbot|function>функцию</a> <code>SendToPost</code>, которая отправляет приказ и ждёт его завершение: <c/><s/>void object::SendToPost(float order, float param)

source: { send("param", param, 100); // send the parameter send("order", order, 100); // send the order while ( testinfo("order", 100) ) // wait for end of work { wait(1); } }
ru: { send("param", param, 100); // Отправить параметр send("order", order, 100); // Отправить приказ while ( testinfo("order", 100) ) // ждать окончания работы { wait(1); } }

source: To move forward by 20 meters, you must write in the main program: <c/><s/> SendToPost(1, 20); // move(20);
ru: Для передвижения 20 метров вперёд, Вы должны написать в главной программе: <c/><s/> SendToPost(1, 20); // move(20);

source: This is the route the robot must travel through:
ru: Это маршрут, по которому должен пройти бот:

source: It's up to you to finish the programming.
ru: Теперь Вы должны сами закончить эту программу.

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.
