Repository: DavydovMA/colobot-data
Catalog: levels/missions/chapter001/level003/po/*.po
Languages: ru

source: Departure
ru: Отправление

source: Equip your spaceship and get ready for takeoff.
ru: Снарядите свой Космический Корабль и будьте готовы к взлёту.

source: From Mission Control
ru: Из Центра Управления

source: Your <a object|base>spaceship</a> is now standing on the launching pad, ready for takeoff.
ru: Ваш <a object|base>Космический Корабль</a> сейчас стоит на стартовой площадке и готов к взлёту.

source: The last drill left for <a object|human>you</a> to perform before embarking on your journey is to equip your spaceship with its <a object|bbox>black box</a>. The only way to reach the <a object|bbox>black box</a> is by a steep path that can only be climbed by a <a object|botgc>tracked grabber</a> which you need to build.
ru: Последняя тренировка, которую <a object|human>Вы</a> должны выполнить перед тем, как отправиться в путешествие, заключается в оснащении вашего Космического Корабля <a object|bbox>Чёрным Ящиком</a>. Единственный способ добраться до <a object|bbox>Чёрного Ящика</a> - по крутому подъёму, который под силу преодолеть только <a object|botgc>Погрузчик Гусеничный</a>, который Вам необходимо создать.

source: Unfortunately your <a object|factory>bot factory</a> hasn't yet got the capacity to assemble this type of bot. You need to request your <a object|research>research center</a> to come up with a blueprint for this particular propeller.
ru: К сожалению, Ваша <a object|factory>Фабрика Ботов</a> пока ещё не в состоянии собрать этот тип бота. Вам необходимо запросить <a object|research>Центр Исследований</a> разработать схему этого специфического двигателя.

source: Procedure
ru: Процедура

source: Power the research center with one of the green <a object|power>power cells</a>.
ru: Включите Центр Исследований с помощью одной зелёной <a object|power>Батареи</a>.

source: Click on the <tracked bot research program> button <button 64/>.
ru: Нажмите на кнопке <tracked bot research program> <button 64/>.

source: Drop a <a object|titan>titanium cube</a> in the center of the <a object|factory>bot factory</a> and build a <a object|botgc>tracked grabber</a>.
ru: Поставьте <a object|titan>Титан</a> в центр <a object|factory>Фабрики Ботов</a> и создайте <a object|botgc>Погрузчик Гусеничный</a>.

source: Power and radio-control the <a object|botgc>tracked grabber</a> to the top of the southwest-oriented mountain.
ru: Включите и по радио-управлению выведите <a object|botgc>Погрузчик Гусеничный</a> к вершине юго-западной горы.

source: Bring the black box back aboard your spaceship.
ru: Принесите Чёрный Ящик назад на борт Вашего Космического Корабля.

source: Don't forget to take the <a object|botgr>wheeled grabber</a> along. These bots may prove very useful in the future.
ru: Не забудьте захватить <a object|botgr>Погрузчик Колёсный</a>. Эти боты могут оказаться очень полезными в будущем.

source: Climb aboard the <a object|base>spaceship</a>.
ru: Поднимитесь на борт <a object|base>Космического Корабля</a>.

source: Select the <a object|base>spaceship</a> and take off <button 28/>.
ru: Выберите <a object|base>Космический Корабль</a> и взлетайте <button 28/>.

source: Please note: To work more efficiently, you can use the <a object|botgr>wheeled grabber</a>.
ru: Обратите внимание: для более эффективной работы, Вы можете использовать <a object|botgr>Погрузчик Колёсный</a>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
ru: <format key><key help/></format> позволяет Вам просмотреть эти инструкции в любое время с помощью Вашего личного СатКом <button 63/>.

source: See also
ru: Смотрите также

source: <a command>Controls</a>
ru: <a command>Управление</a>

source: Walkthrough
ru: Прохождение

source: Before taking off, you need to bring the following aboard your spaceship:
ru: Прежде чем взлететь, Вам необходимо захватить на борт Вашего Космического Корабля следующее:

source: <a object|bbox>Black box</a>.
ru: <a object|bbox>Чёрный Ящик</a>.

source: <a object|botgr>Wheeled</a> and <a object|botgc>tracked</a> grabbers.
ru: <a object|botgr>Колёсный</a> и <a object|botgc>Гусеничный</a> Погрузчик.

source: <a object|human>Yourself</a>.
ru: <a object|human>Себя</a>.

source: Power the <a object|research>research center</a> with one of the green <a object|power>power cells</a>.
ru: Включите <a object|research>Центр Исследований</a> с помощью одной зелёной <a object|power>Батареи</a>.

source: Activate the <a object|research>research center</a> then click on the <button 64/> <tracked bot research program> button.
ru: Запустите <a object|research>Центр Исследований</a> нажав на кнопке <button 64/> <tracked bot research program>.

source: Place a <a object|titan>titanium cube</a> inside the <a object|factory>bot factory</a>.
ru: Разместите <a object|titan>Титан</a> внутри <a object|factory>Фабрики Ботов</a>.

source: Step back out and activate the <a object|factory>bot factory</a>.
ru: Отойдите назад и запустите <a object|factory>Фабрику Ботов</a>.

source: Click on the <button 138/> <build a <a object|botgc>tracked grabber</a>> button.
ru: Нажмите на кнопке <button 138/> <создать <a object|botgc>Погрузчик Гусеничный</a>>.

source: Power the <a object|botgc>tracked grabber</a> with a brand new <a object|power>power cell</a>.
ru: Включите <a object|botgc>Погрузчик Гусеничный</a> с помощью новой <a object|power>Батареи</a>.

source: Radio-control the <a object|botgc>tracked grabber</a> to the top of the mountain in the south-west.
ru: Направьте по радио-управлению <a object|botgc>Погрузчик Гусеничный</a> к вершине горы на юго-запад.

source: Bring the <a object|bbox>black box</a> back aboard your <a object|base>spaceship</a>.
ru: Принесите <a object|bbox>Чёрный Ящик</a> назад на борт Вашего <a object|base>Космического Корабля</a>.

source: Radio-control both the <a object|botgc>tracked</a> and the <a object|botgr>wheeled</a> grabbers onto the platform.
ru: По радио-управлению оба Погрузчика <a object|botgc>Гусеничный</a> и <a object|botgr>Колёсный</a>, приведите на платформу.

source: 10) Climb aboard the <a object|base>spaceship</a> yourself. 11) Take off!
ru: 10) Поднимите на борт <a object|base>Космического Корабля</a> Себя. 11) Взлетайте!

source: In order to take off, select the <a object|base>spaceship</a>, provided that it is visible, by clicking on it. If it is not visible, you need to click one of the buttons in the upper left corner of your screen. The blue triangle <button 130/> allows you to alternate between symbols for bots and symbols for buildings. Click once to shift to the <buildings> list. A <button 171/> <spaceship> symbol will now appear. Click on the button to select it.
ru: Для взлёта выберите <a object|base>Космический Корабль</a>, если он виден, нажмите по нему. Если он не виден, Вам необходимо нажать одну из кнопок в верхнем левом углу Вашего экрана. Синий треугольник <button 130/> позволяет Вам переключаться между символами для ботов и символами для зданий. Нажмите один раз, чтобы перейти к <buildings> списку. Появится символ <button 171/> <spaceship>. Нажмите на кнопке, чтобы выбрать его.

source: Once the spaceship is selected, click on the larger <button 28/> <takeoff> button in the lower center of your screen. If the objects mentioned above as well as yourself are indeed standing on deck, takeoff will take place.
ru: Как только Космический Корабль выбран, нажмите на большую кнопку <button 28/> <takeoff> в нижней части экрана. Если вышеупомянутые объекты и Вы действительно стоите на палубе, взлёт состоится.

source: No object or bot should hinder the closing of the eight large panel doors.
ru: Ни один объект или бот не должны препятствовать закрытию восьми больших панельных дверей.

source: Here is a detailed breakdown of the operations:
ru: Вот подробное описание операций:
